{
    "24": {
        "salary": 0, 
        "title": "IT Support Specialist", 
        "url": "/company/COMBINED-PUBLIC-COMMUNICATIONS/jobs/IT-Support-Specialist-51ce78f2bc859ffd?fccid=b305faa5932d7df8", 
        "company": "Combined Public Communications", 
        "summary": "IT Support Specialist\nWe are looking for a Jr. – Mid level IT Support Specialist with experience working in a virtual environment. We are a small telecommunications company in Cold Spring, KY. You will work with a small, but agile, team of IT professionals focused on providing the highest level of service to our customers.\nResponsibilities:\nYou will be working with the team configuring, maintaining, upgrading and deploying PC’s, laptops and mobile devices. You will also be creating, modifying and deleting AD/Exchange user accounts, distribution and security groups. As part of the team you will assist senior Specialists in the upkeep and monitoring of our virtual environment and assist in administration of our internal PBX (VoIP) phone system.\nSkillset:\nCommunication skills with technical and nontechnical people\nWorking independently and in team environments\nWork in person and over the phone to solve issues\nTrack support tickets and manage your time\nWrite technical documentation and train coworkers\nWindows 10 and 7 installation, setup, and support\nActive Directory – Modifying users/groups, and email features\nExchange – Creation and modification of user mailboxes\nMicrosoft Office troubleshooting including Word, PowerPoint, Excel and, Outlook\nVoIP Phone systems – Regular maintenance and modifications\nDesktop, laptop, server, and basic network setup, troubleshooting, and replacement\nPeripheral support: Printers, scanners, tablets, smartphones, etc.\nQuick learning of proprietary systems and web pages\nRequirements:\nMinimum 2 year degree in information systems and/or 3+ years of related experience\nMust be punctual and driven to meet required task deadlines.\nStrong verbal and written communication skills.\nALL season, reliable transportation is required\nJob Type: Full-time", 
        "location": "Newport, KY 41076", 
        "date": "2017-04-07 23:16:14.098742", 
        "type": " Full-time"
    }, 
    "25": {
        "salary": 75000.0, 
        "title": "Network Administrator", 
        "url": "/company/B2B/jobs/Network-Administrator-4ab010d5bb62332e?fccid=5636cb908f2c9d10", 
        "company": "B2B Technical", 
        "summary": "We are seeking a Network Administrator for New York City.\nTasks and Responsibilities:\nConfigure and support the Cisco Network Infrastructure based on Nexus (7010, 5548 and 1000v), Catalyst switches (4500, 3850, 3750, 3560), and ISR/ASR1000 Routers\nSupport and administer CHECKPOINT Firewalls\nSupport and administer Cisco Wireless Controllers\nMonitor usage, evaluate, troubleshoot the WAN (Wide Area Network)\nPerform first and second level support, including problem investigation, troubleshooting and contact with vendors and maintenance companies\nReview network equipment logs and alerts, and perform any corrective actions\nMonitor network usage and evaluate the performance of the network infrastructure\nPrepare and update technical documentation and configuration templates where needed\nProvide telephone “stand-by” support outside business hours when required.\nSkills:\nCisco installation, configuration, security and best practices implementation and troubleshooting\nCheckpoint Firewall administration – good understanding of networking protocols and standards\nCheckpoint CCSA, CCSE or equivalent training and/or equivalent certifications\nCisco Wireless controllers equipment administration\nVPN secure IPSEC or GRE Tunnels configuration and troubleshooting\nSound knowledge of TCP/IP Networking and protocols\nExperience:\nFive or more years hands-on experience managing and configuring Cisco devices\nFive or more years hands-on experience administering Checkpoint Firewalls\nThree or more years of experience working in a large 24/7 Data Center\nJob Type: Contract\nSalary: $30.00 to $45.00 /hour\nJob Location:\nNew York City, NY\nRequired experience:\nNetwork Administration: 5 years", 
        "location": "New York, NY", 
        "date": "2017-04-20 23:16:30.226114", 
        "type": " Contract"
    }, 
    "26": {
        "salary": 57428.8, 
        "title": "Desktop Support Technician", 
        "url": "/company/Ohio-Department-of-Medicaid/jobs/Desktop-Support-Technician-0e3c35f0cc33a674?fccid=9dad9f0c42aa7c8e", 
        "company": "Ohio Department of Medicaid", 
        "summary": "POSITION DESCRIPTION: \nPrimary Technology: \n Desktop Support\nSecondary Technology: \n LAN/Printer Support\nInstalls/uninstalls, maintains, configures, upgrades tracks, &/or administers hardware &/or software independently in one or more of the following technologies: workstation support, application administration, network administration, server administration, business continuity, information security, telecommunications & network connectivity, &/or SAN administration (i.e., multiple technology domains) where technical work requires specific knowledge to evaluate, select, adapt & modify standard procedures; devises new approaches to problems encountered. Diagnoses, analyzes & resolves issues for customer(s) across assigned multiple technology domains.\nCreates, organizes, files & maintains documentation. Reviews & monitors enterprise security systems; takes appropriate action & responds to alarms/alerts per agency policy & procedure (e.g., network printer administration, SafeBoot, Computrace, anti-virus, spam, etc.).\nInterfaces with vendors &/or other platforms from a hardware &/or software perspective .Answers questions & presents informal mentorship opportunities to peers &/or lower-level staff via conversation, observation or technical documentation.Job duty, knowledge, skill, & ability statements at a lower-level are understood to be able to be performed at any higher level.\nRequired Qualifications:\nEducation\nCore associate program in Computer Science or Information Systems OR equivalent work experience.\nAND\n \nExperience\nMinimum 3 years combined work experience in any combination of the following: installing, monitoring/maintaining, configuring, upgrading, and/or administering/operating multiple technology domains as specified by the agency position description and vacancy/job posting (i.e. Desktop Support & LAN/Printer Support).\nJob Type: Full-time\nSalary: $57,428.80 /year\nRequired education:\nAssociate\nRequired experience:\nDesktop Support: 3 years", 
        "location": "Columbus, OH", 
        "date": "2017-04-12 23:16:34.439000", 
        "type": " Full-time"
    }, 
    "27": {
        "salary": 0, 
        "title": "IT Support Specialist", 
        "url": "/company/AEQUOR-Technologies,-Inc./jobs/IT-Support-Specialist-09cb64860b707fa0?fccid=91b44cea9fbac389", 
        "company": "Aequor Technologies", 
        "summary": "Location: Boston, MA\nDuration: 15+ Months\nDescription\n(Intermediate, 1 - 3 Years Experience).\nMaintains, analyzes, troubleshoots, and repairs computer systems, hardware and computer peripherals. Documents, maintains, upgrades or replaces hardware and software systems.\nSupports and maintains user account information including rights, security and systems groups.\nMay require an associate’s degree in a related area or 1 - 3 years of experience in the field or in a related area.\nFamiliar with a variety of the fields concepts, practices, and procedures.\nRelies on experience and judgment to plan and accomplish goals.\nPerforms a variety of complicated tasks.\nTypically reports to a project leader or manager.\nA wide degree of creativity and latitude is expected.\nPosition Description: \nField incoming help \nrequests\n from \nend users\n via both telephone and work orders in a courteous manner.\nDocument all pertinent end user\n identification information, including name, department, contact information, and nature of problem or issue.\nBuild rapport and elicit problem details from help desk customers.\nPrioritize and schedule problems.\nEscalate problems (when required) to the appropriately experienced technician.\nRecord, track, and \ndocument the help desk request\n problem-solving process, including all successful and unsuccessful decisions made, and actions taken, through to the final resolution.\nApply diagnostic utilities to aid in \ntroubleshooting\n .\nAccess software updates, drivers, knowledge bases, and frequently asked questions resources on the Internet to aid in problem resolution.\nIdentify and learn appropriate software and hardware used and supported by the organization.\nPerform \nhands-on fixes at the desktop level\n , including \ninstalling and upgrading software\n , implementing file \nbackups\n , and \nconfiguring systems and applications\n .\nTest fixes to ensure problem has been adequately resolved.\nPerform post-resolution \nfollow-ups\n to help requests.\nDevelop help sheets and knowledge base articles for end users.\nWork with end-users to ensure transition of all software and customized settings are complete\nFollow refresh process and documentation to ensure quality and accuracy\nAbility to follow technical process / documentation required\nSpecific knowledge of support practices on \nhardware desktop and laptop devices\nPerform related duties consistent with the scope and intent of the position\nJob Type: Contract\nRequired experience:\nIT Support: 2 years", 
        "location": "Cambridge, MA", 
        "date": "2017-04-11 23:16:52.933124", 
        "type": " Contract"
    }, 
    "20": {
        "salary": 0, 
        "title": "IT Support Specialist", 
        "url": "/company/Technomad-LLC/jobs/IT-Support-Specialist-e92d327701395ba4?fccid=f68c67832f813d65", 
        "company": "Technomad LLC", 
        "summary": "Duties Include, but are not limited to: \n1) Troubleshoots, monitors and repairs end user IT equipment (“equipment”):\nResponds to and resolves requests for assistance with equipment and connections;\nReplaces parts and adjusts software and settings on equipment as needed;\nperforms facility-based moves, adds, and changes (MACs), as needed;\nProvides 24x7 on-call support based on regional and facility IT staff rotation;\nWorks closely with team members to create accounts in Active Directory and Exchange;\nMonitor critical network and infrastructure systems through industry standard monitoring tools and systems;\nPerforms minor system administration and network administration tasks as needed;\nDocuments actions taken in ticketing system;\n2) Provides Help Desk response services:\nAnswers Help Desk calls;\nLogs tickets into ticketing system;\nAssigns tickets to appropriate resources;\nEscalates priority notifying management on appropriate tickets;\n3) Prepares and delivers new equipment:\nPrepares new equipment to specification;\nTests new equipment and connectivity to assure it meets specifications;\nPrepares and delivers documentation for equipment;\nMaintains accurate inventory of equipment;\nDelivers equipment as necessary;\nProvides appropriate level of training where required;\n4) Project participation and management:\nParticipate in corporate sponsored infrastructure and application technology rollouts;\nRequirements: \nKnowledge, Skills & Abilities\nManages and prioritizes own workload;\nDemonstrates ability to multi-task;\nPossesses strong analytical and troubleshooting skills;\nDemonstrates a customer orientation; strength in analytical, math, and reasoning skills;\nEffectively communicates verbally and in writing;\nPossesses proficiency in MS Office applications;\nMust be able to travel to assigned sites to complete work;\nEducation\nHigh School Degree, Associates degree in Information Systems is preferred;\nExperience\nMust have 2 years IT experience in a similar role;\nHealthcare experience is preferred;\nCisco / Vmware / Palo Alto knowledge is a plus;\nCertificate/License\nA+ certification;\nNetwork+ certification;\nCharacteristics\n :\nExcellent verbal and written communication skills;\nSelf-motivated, able to prioritize own time effectively;\nstrong project management skills;\nability to relate well with other professionals and peers;\nstrong customer service orientation;\nJob Type: Full-time\nJob Location:\nBonita Springs, FL\nRequired education:\nHigh school or equivalent\nRequired experience:\nIT Support: 1 year", 
        "location": "Bonita Springs, FL", 
        "date": "2017-04-16 23:15:54.626825", 
        "type": " Full-time"
    }, 
    "21": {
        "salary": 0, 
        "title": "Help Desk Specialist", 
        "url": "/company/SMS-Data-Products-Group-Inc./jobs/Help-Desk-Specialist-fc0d482e4906ea62?fccid=9de6d6f3e4890fe8", 
        "company": "SMS Data Products Group Inc", 
        "summary": "As part of a a tri-zone help desk team, handles daily maintenance and monitoring of managed hardware and software for Hanscom AFB clients and customers, both classifed and unclassifed systems\nSupport client voice issues, to include analog, VoIP and SIP services\nAssists in workstation life-cycle rotations\nEnsures team provides support for remote clients and users\nSupports and complies with IT procedures for team and client usage\nInstalls and configures systems in compliance with AFNet polices and asset management requirements\nSupports team in lifecycle management of existing and new hardware inventory using standard desktop images and entprise client management tools to build, patch secure and deploy desktop computer systems to include computer peripheral equipment\nPrepares and processes Information Technology assets for resource reutilization.\nEnsures workstations, peripherals, communications devices, and operating system/application software are properly configured for network operation, are on-line, and are available to users\nPeriodically reviews processes and procedures and client configurations for completeness, effectiveness and compliance with information assurance polices and DISA STIGs\nServes as the system troubleshooter, a critical role in keeping client systems operational.\nContacts the customer organization Point of Contact to coordinate hardware maintenance when necessary.\nImplements software patches and security fixes.\nEnsures all software installed on customer organization systems is appropriately licensed, authorized, and recorded in the base software license inventory.\nJob Type: Full-time\nJob Location:\nBedford, MA\nRequired education:\nBachelor's\nRequired experience:\nHelp Desk: 1 year\nRequired licenses or certifications:\nSecret\nSecurity + CE", 
        "location": "Bedford, MA", 
        "date": "2017-04-21 23:15:58.823936", 
        "type": " Full-time"
    }, 
    "22": {
        "salary": 0, 
        "title": "PC Technician", 
        "url": "/company/Computer-Experts/jobs/PC-Technician-5485af7a72671cd8?fccid=c38f2d1be223ddd1", 
        "company": "Computer Experts", 
        "summary": "Computer Experts PC Technicians work in the Service Department of the retail store.\nThe position can be Full-time or Part-time.\nRequired Knowledge/Skills: \n-Experience working with Windows Operating Systems\n-Building custom computers\n-Installing software\n-Virus removals\n-Computer diagnostics\n-Data transfers\n-Excellent interpersonal, written, and telephone skills\n-Exceptional time management ability\nQualifications: \n-Valid driver's license with reliable transportation\n-Able to pass drug test and background check\nJob Type: Full-time", 
        "location": "Palm Bay, FL 32905", 
        "date": "2017-04-20 23:15:59.013051", 
        "type": " Full-time"
    }, 
    "23": {
        "salary": 0, 
        "title": "IT Specialist", 
        "url": "/company/Apprentice-Information-Systems/jobs/IT-Specialist-beb35ec6687d3731?fccid=a4d9a500116edf12", 
        "company": "Apprentice Information Systems", 
        "summary": "Summary\nAre you ready to take your career in information technology to the next level? We have a great position geared to help you expand your skills. Here are some questions to ask yourself:\nAre you interested in new technology and computer systems?\nDo you love to learn new things that will advance your career?\nAre you passionate about helping customers and making a difference?\nDo you enjoy working as part of a close-knit team that backs each other up?\nDo you enjoy one-on-one interaction with the customer?\nIf so, our Information Technology Specialist role may be perfect for you. This isn’t just hearing the problems– this is actually \nsolving\n the problems. You will get to work hand-in-hand with hardware engineers, network administrators, software programmers, and repair technicians to get the job done.\nAbout Us\nApprentice Information Systems provides I.T. products and services to government in Arkansas. Apprentice is headquartered in Rogers, AR, with a second office in North Little Rock. We are a growing, stable company with 35 employees and business in 73 of the 75 counties in Arkansas. To better serve a premier customer, we are looking to add to our team. We have a casual 'make-it-happen' culture, and love to make work fun. We provide highly developed software and hardware solutions to state and county government. With over twenty years of experience in the industry, AIS understands the needs of Arkansas governments. We pride ourselves on being a one-stop shop when it comes to technology solutions for county and state government, and can handle every aspect of an office’s technology needs, from running computer network wiring, providing and servicing computer hardware.\nBenefits\nAIS offers a competitive benefits package to our full-time employees. These benefits include: Medical, Supplemental, Retirement, and more. Additionally, we offer 8 paid holidays, 2 personal days, sick time, plus and a great vacation plan. AIS provides the opportunity to be a part of a small yet growing company, wherein you’re part of a team that works closely together and closely with the customer. We have a fun and casual culture in which each team member can make a real impact. We believe in working in a way that glorifies God, honors our families, and makes the customer the boss. And we even get served lunch each Monday and Breakfast each Friday! Come be a part of a dynamic team that is #1 in the marketplace for a very good reason. We will provide all the training, tools, and the fully equipped work truck, plus a great manager to bring you up to speed.\nKey Result Area: \nThe IT specialist position installs, modifies and makes minor repairs to personal computer hardware and software systems, and provides technical advice and support to system users. \nPrincipal Duties and Responsibilities: \nResolve Customer Problems (tickets)\nReceive customer call tickets via the Apprentice call system.\nBased upon information in the ticket, perform given troubleshooting steps and escalate as needed.\nCustomer follow up on open tickets and delivery of status reports to incorporated teams and customers.\nCommunicate with customers and internal teams to ensure that customer concerns are resolved and their needs are fulfilled.\nIdentifies the hardware and software needed to satisfy user requirements and communicates with sales manager.\nInstalls hardware and peripheral components such as monitors, keyboards, printers and disk drives on users’ premises.\nLoads appropriate software packages such as operating systems, networking components and office applications.\nAssists in the customization and adaptation of existing programs to meet users’ requirements.\nProvides telephone, in-person and online support to end-users.\nCoordinates activities with network services and information systems groups.\nProvides updates, status and completion information to manager and/or users, via voice mail, e-mail or in-person communication.\nRefers major hardware problems to service personnel for correction.\nConnects users to networks and provides initial training in facilities and applications.\nMinimum Logistical Job Requirements\nAbility to travel within Northwest Arkansas estimated at 80% of time. If in Fort Smith/Van Buren area travel may be less.\nAbility to work flexible hours, weekends and evenings as needed.\nAbility to climb ladders and lift up to 40lbs\nEducation: \nBachelor’s or Associate’s degree in information or computer sciences, business administration, decision support, or related field or relevant certification from recognized trade or technical school is preferred.\nExperience\n3 years of industry experience (networks, hardware, software, customer service, or county government) of which preferred at least 1 year in a role that directly interfaces with customers or the public.\nRequired Professional Skills\nExcellent team player\nStrong attention to detail\nAbility to learn new techniques and configurations within an environment.\nStrong customer focus\nGood communication skills\nAbility to explain technical issues/remedies to customers in simple language they can understand\nCapacity to maintain patience, courtesy, and professionalism in times of stress and deal directly, promptly and respectfully, even with difficult people and issues.\nRequired Technical Skills: \nRequired general knowledge of computer hardware, systems, networks, components, and software\nRequired proficiency in Windows XP, 7, 8, 8.1, 10 Technologies.\nRequired proficiency in PC Repair\nRequired proficiency in printer troubleshooting and other computer peripheral troubleshooting.\nSoftware support proficiency preferred.\nOther Requirements: \nValid Driver’s license required\nPass background check\nPass Clean Drug Screening\nJob Type: Full-time\nJob Location:\nVan Buren, AR\nRequired education:\nBachelor's\nRequired experience:\nIT: 3 years\nRequired license or certification:\nDriver's License", 
        "location": "Van Buren, AR", 
        "date": "2017-04-14 23:16:11.934477", 
        "type": " Full-time"
    }, 
    "28": {
        "salary": 50000.0, 
        "title": "IT Field Service Technician", 
        "url": "/company/Norman-Alan-Company,-LLC/jobs/IT-Field-Service-Technician-7eab1ce886023de3?fccid=642b93c8608bd8a9", 
        "company": "Norman Alan Company LLC", 
        "summary": "Norman Alan Company is a diversified staff of information technology professionals working as a team to design, implement, and maintain IT systems for companies in Greensburg and surrounding areas. Our primary IT Services include: Network Design and Placement, Managed Services, Remote Support Services, and Cloud Services.\nAs a Network Administrator, you will be responsible for onsite support at the offices of our clients. This position is responsible for providing all aspects of ongoing network administration, server support and end-user support – from solving problems, to making changes, to proactive and preventative maintenance, to reactive support.\nPrimary Responsibilities: \nInstalling, managing, configuring and troubleshooting software on desktops and laptops.\nInstalling, managing, configuring and troubleshooting software on servers.\nManaging, configuring and troubleshooting firewall security appliance.\nUser account maintenance, including: adding new user accounts; setting-up new user desktop profiles and mail profiles; deleting user accounts; and resetting passwords.\nComputer setup, including: setting up and connecting new computers, installing software, setting-up user profiles, migrating profiles and data.\nNormal working hours are Mon – Fri, 8 AM – 5 PM however, candidate must be able to work after hours and weekends as scheduled.\nNorman Alan Company will only entertain individuals that have strong work ethic, professional appearance, sharp communication skills, and experience dealing with corporate clients.\nDesired Qualifications: \nAssociate or Bachelor’s degree in technical field\n3+ yrs. experience supporting multiple customers via phone or in the field\nMicrosoft-based Server environments, SonicWALL products, disk-based and cloud based backup solutions and related network infrastructure including PC’s and mobile devices.\nMicrosoft Server OS administration and configuration\nFunctional knowledge of core networking concepts including TCP/IP, DHCP, DNS\nExchange administration with migration and upgrade experience\nStrong troubleshooting skills\nLAN/WAN (VPN, VLAN, Firewalls, etc.)\nMicrosoft Certification a plus\nWork Environment Conditions: \nLocation: Daily local car travel in a 50-mile radius of Greensburg is required, using a personal vehicle. On most occasions, work for this position is performed in the field, onsite at the offices of our clients in the local area. A valid driver's license, a reliable personal vehicle, and a responsible driving record are required.\nPhysical Requirements: \nThe employee is frequently required to stand, walk and sit, and use hands to operate computer keyboard, mouse, telephone and basic office equipment. The employee is occasionally required to stoop, kneel, crouch or crawl. The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. While performing the duties of this job, the employee is regularly required to talk, see and hear. Ability to drive a vehicle.\nSalary & Compensation: \nExpense reimbursement for any travel  * Excellent Health/Vision/Dental plans - premium 100% paid by Norman Alan Company for employee, spouse and dependents\n401k Retirement Plan w/ 6% Company Match\nPaid Vacation, Sick Time & Holidays\nRequired experience: \nIT Support: 3 years+\nRequired education: \nAssociate\nJob Type: \nFull-Time Salary\nPlease include salary requirement when submitting your resume.\nNOTE: Resumes will NOT be considered from outside the Greensburg/Pittsburgh Metro Region. NOTE: Resumes will NOT be considered if you do not have 3+ years of relevant IT experience.\nJob Type: Full-time\nSalary: $40,000.00 to $60,000.00 /year", 
        "location": "Greensburg, PA 15601", 
        "date": "2017-04-17 23:17:05.732811", 
        "type": " Full-time"
    }, 
    "29": {
        "salary": 57428.8, 
        "title": "Desktop Support Technician", 
        "url": "/company/Ohio-Department-of-Medicaid/jobs/Desktop-Support-Technician-0e3c35f0cc33a674?fccid=9dad9f0c42aa7c8e", 
        "company": "Ohio Department of Medicaid", 
        "summary": "POSITION DESCRIPTION: \nPrimary Technology: \n Desktop Support\nSecondary Technology: \n LAN/Printer Support\nInstalls/uninstalls, maintains, configures, upgrades tracks, &/or administers hardware &/or software independently in one or more of the following technologies: workstation support, application administration, network administration, server administration, business continuity, information security, telecommunications & network connectivity, &/or SAN administration (i.e., multiple technology domains) where technical work requires specific knowledge to evaluate, select, adapt & modify standard procedures; devises new approaches to problems encountered. Diagnoses, analyzes & resolves issues for customer(s) across assigned multiple technology domains.\nCreates, organizes, files & maintains documentation. Reviews & monitors enterprise security systems; takes appropriate action & responds to alarms/alerts per agency policy & procedure (e.g., network printer administration, SafeBoot, Computrace, anti-virus, spam, etc.).\nInterfaces with vendors &/or other platforms from a hardware &/or software perspective .Answers questions & presents informal mentorship opportunities to peers &/or lower-level staff via conversation, observation or technical documentation.Job duty, knowledge, skill, & ability statements at a lower-level are understood to be able to be performed at any higher level.\nRequired Qualifications:\nEducation\nCore associate program in Computer Science or Information Systems OR equivalent work experience.\nAND\n \nExperience\nMinimum 3 years combined work experience in any combination of the following: installing, monitoring/maintaining, configuring, upgrading, and/or administering/operating multiple technology domains as specified by the agency position description and vacancy/job posting (i.e. Desktop Support & LAN/Printer Support).\nJob Type: Full-time\nSalary: $57,428.80 /year\nRequired education:\nAssociate\nRequired experience:\nDesktop Support: 3 years", 
        "location": "Columbus, OH", 
        "date": "2017-04-12 23:17:06.663142", 
        "type": " Full-time"
    }, 
    "4": {
        "salary": 44000.0, 
        "title": "Computer Network Technician", 
        "url": "/company/Cybertools,-inc./jobs/Computer-Network-Technician-a48466bb7951844d?fccid=2c503e22ce8c4f7b", 
        "company": "Cybertools Inc", 
        "summary": "Computer Network Technician / Systems Administrator\nAre you an experienced network technician that is tired of spending hours on a lengthy commute to the north end? Are you interested in working for a professional and innovative company in the South Sound region?\nDo you have an outgoing personality and enjoy working directly with end users and business owners? Do you take pride in your ability to delivering excellent customer service? Are you wanting to work in a team environment where you can contribute your ideas to the company?\nAt Cybertools we provide IT consulting, managed services and break / fix solutions to small and medium sized business clients.\nWe are looking for a network support technician who can help manage and support our client’s IT infrastructures. You will work with evolving technology on a daily basis as well as a variety of networks and clients. This exposure will allow you to gain valuable experience and grow your skill set while working on the job. This unique opportunity allows you to get into an established, growing company and take advantage of the opportunities that will arise as we continue to expand.\nPrimary Responsibilities\nSolve technical issues for our clients both remotely and on-site\nAccurately track your time and work progress in our ticketing system\nIdentify technological solutions that could benefit our clients\nWork with our team to design new solutions to address client needs\nContribute to team meetings by sharing innovative ideas and providing feedback on current solutions\nTechnical Skills Needed\n2 years experience as a network technician, or systems administrator\nExperience with Microsoft server environments\nExperience with Microsoft desktop applications in a networked environment\nExperience in configuration of network firewalls, routers and switches\nExperience in client facing situations preferred\nExcellent communication and interpersonal skills\nExcellent documentation skills and attention to detail\nAbility to multi-task and manage several customer projects at once\nJob Type: Full-time\nSalary: $44,000.00 /year\nRequired experience:\nNetworking: 2 years\nRequired license or certification:\nDriver's License", 
        "location": "Puyallup, WA 98374", 
        "date": "2017-04-20 23:14:47.762701", 
        "type": " Full-time"
    }, 
    "8": {
        "salary": 36000.0, 
        "title": "IT Assistant", 
        "url": "/company/Valley-Truck-and-Tractor-Company/jobs/IT-Assistant-abf99026b2794772?fccid=8441d51d6d402dfa", 
        "company": "Valley Truck and Tractor Company", 
        "summary": "Purpose:\nAssists the Information Technology Manager in the areas of; technology-related product/service selections, set-up, support, communications, and data protection in order to assist employees in efficiently completing work. Assists in assuring that up-to-date, effective hardware and software applications are in place, operational and employees are properly trained in their use.\nResponsibilities:\nAssists in collecting IT asset information to ensure appropriate lifecycle management\nWorks with Information Technology Manager to establish and adhere to annual IT budget\nMay assist in the purchasing new technology solutions including computers, servers, cell phones, software, etc.\nAssists/Recommends and reports on policies to allow for the most cost-effective use of existing solutions\nMaintains knowledge of current technology and stays abreast of new technological advancements in order to provide cost effective solutions for the company\nAssists in safeguarding dealership technology systems through items such as acceptable use, password, and network access policies and monitoring\nAssists in safeguarding data by facilitating timely back-ups and processing\nAssists with installs software, vendor, and pricing updates on all systems and the installation and set-up of all new equipment\nProvides IT support to employees in all locations by prioritizing, troubleshooting and resolving problems quickly\nEscalates technology installation and support issues to the Information Technology Manager as appropriate.\nPerform hardware installations and repair\nTravel to locations to transport equipment, troubleshoot, maintain and repair equipment, and provide training\nMay assist with facilitating IDT training\nMay be required to work weekends and non-“normal” business hours\nOther related responsibilities as may be required\nDesired Experience, Education, Skills and Knowledge\n2+ years’ experience in information technology support\nBachelors degree or equivalent preferred\nAbility to work effectively as a team member\nStrong communication skills with ability to train others on technology solutions\nExperience with routers, servers, and network technology desired\nAbility to define problems, collect data, establish facts and draw valid conclusions.\nMust be physically able to perform minor lifting of equipment, climbing or crawling to install equipment and run cables and occasionally long periods of time sitting at a workstation\nMust be willing to travel to company locations\nFamiliar with John Deere and competitive products desired\nAbility to work effectively as a member of a team\nJob Type: Full-time\nSalary: $16.00 to $20.00 /hour", 
        "location": "Yuba City, CA", 
        "date": "2017-04-19 23:15:14.388647", 
        "type": " Full-time"
    }, 
    "59": {
        "salary": 33500.0, 
        "title": "IT Help Desk Support Technician", 
        "url": "/company/Single-Path,-LLC/jobs/IT-Help-Desk-Support-Technician-101ec3b736c84b7b?fccid=33aad51d3efdbc9a", 
        "company": "Single Path LLC", 
        "summary": "Primary Duties and Responsibilities include but are not limited to:\nManage the day-to-day functions of using technology including, but not limited to, network, e-mail, and various software systems\nSupport of Macintosh (macOS and macOS server) and Windows (Desktop/Server) operating systems, iOS devices (iPads, iPods), Google Console, including knowledge for VMware\nAbility to deploy software using Network/Server/MDM based software installation\nKnowledge and Support of Workgroup Manager, Open Directory, Active Directory, and Google Console\nInstallation of all new desktop computers, servers, and computer related equipment (printers and other peripherals)\nInstallation and troubleshoot use of interactive teaching solutions (boards & projectors)\nRepair and replace non-functioning computer equipment\nCreate, maintain and update all required computer images\nMaintain and upgrade networking equipment as required\nInstall and support of software and updates as necessary\nMaintaining software license compliance records\nSupport telephone system issues as necessary and facilitating repair requests\nMaintain appropriate physical security and control on all computer assets\nMaintain inventory records of all equipment (purchases, placements, repairs and final dispositions)\nMaintain a working knowledge of all computer-related equipment in order to facilitate timely troubleshooting and repairs\nPerforming other duties as assigned.\nPhysical Demands:\nAbility to read and communicate effectively with employees\nAbility to apply common sense understanding to carry out instructions provided in either written, diagram or oral form\nWork involves walking, talking, hearing, using hands to handle, feel or operate objects or controls, and reaching with hands and arms\nVision abilities required include close vision and the ability to adjust focus\nMay be required to push, pull, lift, and/or carry up to 60 pounds\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\nQualifications:\nBachelor's Degree in Computer Technology or related field or equivalent experience desired\nMinimum two-year experience in computer hardware and software installation and maintenance desired\nThis position requires the ability to establish effective working relationships with all levels of staff\nJob Type: Full-time\nSalary: $32,000.00 to $35,000.00 /year\nRequired experience:\nIT Support: 1 year\nCustomer Service: 1 year", 
        "location": "Crystal Lake, IL", 
        "date": "2017-04-20 23:18:56.890758", 
        "type": " Full-time"
    }, 
    "58": {
        "salary": 42000.0, 
        "title": "IT Field Service Technician", 
        "url": "/company/True-North-Logistics/jobs/IT-Field-Service-Technician-dcd7ad34d381227f?fccid=bfada0d8f93064e5", 
        "company": "True North Logistics", 
        "summary": "True North Logistics (TNL) has several immediate opportunities for IT Field Service Technicians in support of a government client. Successful candidates will provide timely and efficient general IT technical services. These services will include desk side support to computer HW, SW, and other electronic or mechanical devices including clients, servers, and legacy systems. Technicians will also provide resolution of incidents that could not be resolved remotely and are transferred from the Service Desk to the site for resolution.\nExperience: Two to four (2-4) years of related experience in information systems. Experience in SAN/Back-Up/Recovery technologies and operations in a fast paced, Enterprise IT support environment are a plus.\nCertifications Required: A+ and OS Certification. OS certification can be obtained within 90 days. The OS requirement is completion of Microsoft 70-685 - “Windows 7 Enterprise Desktop Support Technician”.\nJob Type: Contract\nSalary: $21.00 /hour\nRequired education:\nHigh school or equivalent\nRequired experience:\nInformation Systems: 2 years\nRequired licenses or certifications:\nA+ Certified\nSecret Security Clearance DoD", 
        "location": "Mechanicsburg, PA", 
        "date": "2017-04-19 23:18:56.440205", 
        "type": " Contract"
    }, 
    "55": {
        "salary": 41500.0, 
        "title": "PC Technician II", 
        "url": "/company/City-of-Bradenton/jobs/PC-Technician-a8002cfc7267da4b?fccid=9dca2d60299c295e", 
        "company": "City of Bradenton", 
        "summary": "FLSA Status: \n Non-Exempt, On-call 24x7\nSupervision Exercised: \n None; ability to manage projects and resources where required.\nSupervision Received: \n Minimal supervision received; position requires self-management and initiative.\nGeneral Purpose of the Position: \n The purpose of this position is to implement personal computers, peripherals, desktops and phones and provide technical support on both. Where appropriate, this position will also provide application and technical support. This position also helps the City of Bradenton maximize its investment in technology by implementing solutions to the furthest extent.\nEssential Duties and Responsibilities: \nConfigure and install personal computers, peripherals and phones to City standards.\nMaintain technical procedures and storage room(s) in a manner to support the implementation of equipment.\nResponsible for the appropriate disposal of computers.\nComplete appropriate paperwork for inventory (i.e. hardware and software) and purchasing.\nWhere necessary, interface with vendors for equipment repair.\nMake recommendations for purchases and cascading equipment.\nProvide application and technical support.\nAnalyze user requests and develop reports to support business needs.\nEstablish and maintain effective and professional working relationships with team members, management, customers, and vendors.\nPromote courtesy and professionalism throughout the City of Bradenton.\nSkills and Physical Abilities Required: \nProvide excellent customer service.\nPossess in-depth knowledge of computer operations (i.e. hardware and software).\nPossess working knowledge of Microsoft applications and the internet.\nDemonstrate sound verbal and written communication skills, good troubleshooting and analytical skills.\nAbility to make sound decisions, demonstrate flexibility, and work with people at all levels of the organization.\nAbility to present technical information in a non-technical manner.\nAbility to physically move computer equipment.\nComputer Equipment and Software Requirements: \n Microsoft operating systems and desktop applications. Crystal Report Writer. Technical operations of computer hardware and operating systems. Basic knowledge of networking and security.\nEducation and Experience Required: \n Bachelor’s Degree with three (3) years of experience providing desktop support. Possession of and ability to maintain a valid Florida driver’s license.\nPreferred: \n Bachelor’s Degree in Technology.\nPay Grade: \n 114 \nSalary Range: Minimum: \n $16.03/hour \nMaximum: \n $24.05/hour\nJob Type: Full-time\nSalary: $33,000.00 to $50,000.00 /year\nRequired education:\nBachelor's", 
        "location": "Bradenton, FL", 
        "date": "2017-04-10 23:18:52.150678", 
        "type": " Full-time"
    }, 
    "54": {
        "salary": 37000.0, 
        "title": "Information Technology Specialist (entry level)", 
        "url": "/company/ACI-Federal/jobs/Information-Technology-Specialist-f8b8316dc8bcd9db?fccid=58476d2e8b9c7544", 
        "company": "ACI Federal", 
        "summary": "A Secret Clearance or higher is required for this position, and must be attained before applying for the position.\nPosition Overview\nInstall, Configure, Service, Repair and Maintain:\nIT Systems (stand-alone and server environments)\nNetwork Services (hardware and software)\nStorage Networking Devices (hardware and software)\nLocal and Base Area Networks\nWireless Hubs, Routers, and Switches * Evaluate and Resolve customer IT problems\nMinimum Requirements\n2 yrs. IT experience\nActive SECRET-level clearance OR US Military Service within last 24 months\nOne of the following:\nCompTIA A+ (CE)\nNetwork+ (CE)\nSecurity+ (CE)\nSSCP\nCCNA\nGSEC\nSCNP\nOne of the following in addition to #3 (Candidates can test for MTA prior to start)\nMTA\nMCTS\nMCSA\nA+\nNetwork+\nCCNA\nTechnical Skills (Preferred)\nInternet Protocol Version 6 (IPv6)\nEnhanced Interior Gateway Routing Protocol (EIGRP)\nBorder Gateway Protocol (BGP)\nVirtual Load Area Networks (VLANs)\nVirtual Private Networks (VPNs)\nNetwork Address Translation (NAT)\nDefense Message Systems\nMS Server\nJob Type: Full-time\nSalary: $37,000.00 /year\nRequired education:\nHigh school or equivalent\nRequired experience:\nIT: 2 years\nRequired licenses or certifications:\nMTA, A+, CCNA, or Network+\nCompTIA A+ (CE), Network+ (CE), or Security+ (CE)\nActive Secret Clearance or Higher", 
        "location": "Barstow, CA", 
        "date": "2017-04-07 23:18:51.843022", 
        "type": " Full-time"
    }, 
    "57": {
        "salary": 60000.0, 
        "title": "IT Technical Support", 
        "url": "/company/A1-Computer-Services,-Inc./jobs/IT-Technical-Support-4c06c7c4c279b753?fccid=58571d56fc72a5ce", 
        "company": "A1 Computer Services Inc", 
        "summary": "Field Engineers are responsible for implementing and maintaining all aspects of our client’s technology. This includes daily support incidents, desktop and server troubleshooting, hardware/software installation and upgrades, new infrastructure build outs and relocations. Traveling to/and between these locations is required, and part of the daily job tasks.\nPosition Supports Clients primarily in Westchester/Putnam Counties in NY\nTechnical Requirements:\nMicrosoft Windows Server 2008/2012/2016, Active Directory\nMicrosoft Windows 7/8 and 10\nMicrosoft Office 2010/2013/2016\nMicrosoft Exchange 2010/2013/2016 ( Office 365 migration experience a plus)\nUnderstanding of networking concepts: TCP/IP, LAN/WAN, DHCP, DNS, Routing, Switching and Firewalls\nExperience deploying home networks including Cable/DSL/FIOS modems, firewalls, hardware and software VPN clients\nEmail and spam troubleshooting\nServers and Workstations maintenance\nData backup and recovery\nTrend/Webroot Antivirus or similar software\nCertifications preferred but not required\nQualifications include:\nExceptional written and oral communication skills.\nExceptional interpersonal skills, with a focus on rapport-building, listening, and questioning skills\nStrong documentation skills.\nAbility to absorb and retain information quickly.\nExperience working in a team-oriented, collaborative environment\nOutstanding client services skills, ability to effectively prioritize and execute tasks in a high-pressure environment\nTransportation and clean driver’s license\nJob Type: Full-time\nSalary: $45,000.00 to $75,000.00 /year\nRequired experience:\nIT Support: 2 years", 
        "location": "Brewster, NY 10509", 
        "date": "2017-04-21 23:18:56.163143", 
        "type": " Full-time"
    }, 
    "56": {
        "salary": 0, 
        "title": "IT Tech", 
        "url": "/company/The-Cardiology-Center,-Inc./jobs/IT-Tech-f2b393a787e68f8d?fccid=83d65e0322df458f", 
        "company": "Office Delray Beach", 
        "summary": "Looking for a skilled IT Tech with PC, printer, and networking troubleshooting as well as various other support functions and miscellaneous office duties. This position is entry level.\nJob Type: Full-time\nRequired experience:\nInformation Technology: 1 year", 
        "location": "Delray Beach, FL", 
        "date": "2017-04-19 23:18:55.891180", 
        "type": " Full-time"
    }, 
    "51": {
        "salary": 70000.0, 
        "title": "Desktop Support Technician", 
        "url": "/company/CTG,-Inc./jobs/Desktop-Support-Technician-95384f6dbd980314?fccid=49798603e4669d2a", 
        "company": "CTG Inc", 
        "summary": "We at CTG are presently seeking Desktop Support Technician at Neillsville, WI for one of our Clients, if this opportunity interests you I urge you to email me your updated resume in word format with your contact information and the best time to reach you.\nPlease feel free to call me (Waseem Khan) at 800-992-5350 Ext 4985. If you need more information\nPosition: Desktop Support Technician\nLocation: Neillsville, WI\n 54456\nDuration: 6 Months\nEssential job functions: \nDescription\nDesktop Support Technician\nThis is a 6 month contract to hire.\nThe candidate will be responsible for daily operation duties of user support, administration, monitoring, and deployment of new and replacement equipment. This Position will report directly to the Conduent Site Operations Manager. Specific duties of the IT Technician will be performed in accordance with the Customer priorities as directed by the Site Operations Manager:\nInstall, configure, and administer Microsoft Windows operating systems\nInstall, configure, and support end user hardware\nProvide desktop and application support\nProvide outstanding customer service and communication to the end users\nOther project and duties as assigned\nJob Type: Contract\nSalary: $35.00 /hour\nJob Location:\nNeillsville, WI\nRequired education:\nHigh school or equivalent\nRequired experience:\nInstall, configure, and administer Microsoft Windows: 2 years\nDesktop Support: 3 years", 
        "location": "Neillsville, WI", 
        "date": "2017-04-18 23:18:46.935460", 
        "type": " Contract"
    }, 
    "50": {
        "salary": 78500.0, 
        "title": "Network Administrator", 
        "url": "/company/Berns-Inc/jobs/Network-Administrator-238716831a4a4fff?fccid=328a0bd8f93d3c3c", 
        "company": "Berns Inc", 
        "summary": "Berns Inc. is a boutique software development studio operating on the cutting edge of distributed ledger technology. Our dedicated team is committed to building an online environment that fosters security, anonymity, and accountability for a more powerful user experience.\nWe are looking for a talented Systems Administrator to help us with our needs. The ideal candidate will have 3+ years of experience, possess the ability to oversee network operations including the installation, support, and maintenance of servers or other computer systems, as well as planning for and responding to service outages and other problems. This candidate must be organized, strong verbal and written ability and a knack for problem solving!\nResponsibilities:\nUser administration (setup and maintaining account)\nSupport LANs, WANs, network segments, Internet, and intranet systems.\nMaintain system efficiency.\nEnsure design of system allows all components to work properly together.\nTroubleshoot problems reported by users.\nMake recommendations for future upgrades.\nMaintain network and system security.\nAnalyze and isolate issues.\nMonitor networks to ensure security and availability to specific users.\nEvaluate and modify system's performance.\nIdentify user needs.\nMaintain integrity of the network, server deployment, and security.\nEnsure network connectivity throughout a company's LAN/WAN infrastructure is on par with technical considerations.\nDesign and deploy networks.\nPerform network address assignment.\nAssign routing protocols and routing table configuration.\nAssign configuration of authentication and authorization of directory services.\nMaintain network facilities in individual machines, such as drivers and settings of personal computers as well as printers.\nMaintain network servers such as file servers, VPNgateways, intrusion detection systems.\nAdminister servers, desktop computers, printers, routers, switches, firewalls, phones, personal digital assistants, smartphones, software deployment, security updates and patches.\nThis position is FULL TIME and ON SITE. NO TELECOMMUTING.\nJob Type: Full-time\nSalary: $72,000.00 to $85,000.00 /year\nJob Location:\nCanoga Park, CA 91303\nRequired experience:\nNetwork Administration: 3 years", 
        "location": "Canoga Park, CA 91303", 
        "date": "2017-04-21 23:18:44.950777", 
        "type": " Full-time"
    }, 
    "53": {
        "salary": 55000.0, 
        "title": "Jr. System Administrator", 
        "url": "/company/Consumer-Direct-Inc./jobs/Junior-System-Administrator-e52488cdf22ce1d9?fccid=f96142b65bae1ccb", 
        "company": "Consumer Direct Inc", 
        "summary": "We’re looking for a Junior Systems Administrator to step in and keep our Office and Production environment running smooth. The ideal candidate will have a passion for architecting and building out efficient and automated systems and will not shy away from change when they see a better solution.\nJob Duties\nWrite and maintain shell scripts\nConfigure & harden linux servers\nArchitect automation solutions for code deployments\nProvide office desktop support Mac & Windows\nMonitor systems daily & troubleshoot errors\nArchitect & configure upgrades/changes to production environment\nPerform regular security scan of network & severs\nPerform misc. job related duties as assigned\nKnowledge/Skills Required\nKnowledge of linux\nKnowledge of SSH\nKnowledge of relational databases including a database query language\nSkilled in the use of personal computers and related software applications\nGeneral knowledge of the Internet including surfing and how to search keywords using search engines such as Google\nEmail configuration settings for Outlook, MacMail, Thunderbird, smartphone devices and other common email clients\nFamiliarity with Protocols (HTTP, FTP, SSH, SSL, MySQL, POP3, IMAP, SMTP)\nHelpful Skills\nKnowledge of Docker\nKnowledge of MySQL\nKnowledge of Jenkins\nKnowledge of Payment Card Industry (PCI) best practices for security\nPassion for systems & network security\nPrevious server administration\nAmazon Web Services (AWS) experience\nFamiliarity with networking (routers, switches, DNS) etc.\nFamiliarity with programming languages such (JAVA, PHP)\nJob Type: Full-time\nSalary: $45,000.00 to $65,000.00 /year", 
        "location": "Costa Mesa, CA 92626", 
        "date": "2017-04-19 23:18:47.608988", 
        "type": " Full-time"
    }, 
    "52": {
        "salary": 58000.0, 
        "title": "Network Administrator", 
        "url": "/company/Wellmore-Behavioral-Health/jobs/Network-Administrator-042a16cdf9f14c83?fccid=251f7cf97077655f", 
        "company": "Wellmore Behavioral Health", 
        "summary": "The Network Administrator is a member of the Wellmore IT Department. The department is comprised of both Applications and Network staff, each reporting to its own manager and under the administrative leadership of the Director of Systems Operations. The Network Administrator will directly report to the IT Network Manager and will be involved in the installation, maintenance, upgrade and performance of the organization's networks.\nREQUIREMENTS: \nDiploma in Computer Science, Management Information Systems or equivalent Engineering fields; supplemented with one or more courses in current technology.\nMust have a Bachelor of Science degree in related computer field or hold appropriate certifications in the computer electronic field with 1+ year of practical experience.\nMicrosoft Certified Systems Engineer (MCSE) is highly desirable.\nConsiderable (7+ years) and current experience as a Network Administrator on a medium sized network of servers, desktop systems and communications devices using current technologies.\nJob Type: Full-time\nSalary: $58,000.00 /year\nJob Location:\nWaterbury, CT\nRequired education:\nBachelor's\nRequired experience:\nNetwork Administration: 1 year", 
        "location": "Waterbury, CT 06710", 
        "date": "2017-04-21 23:18:47.247050", 
        "type": " Full-time"
    }, 
    "88": {
        "salary": 60000.0, 
        "title": "IT Desktop Support", 
        "url": "/company/Human-Capital-Staffing/jobs/IT-Desktop-Support-8ffd135bd82e26b8?fccid=7e7a136e09cec46e", 
        "company": "Human Capital Staffing", 
        "summary": "Supporting IT equipment in large corporate environment\nIMAC Support – IT equipment Install/Move/Add/Change\nTrack and resolve customer incidents and requests through the ServiceNow ticketing tool\nTroubleshoot and resolve hardware and software issues for Windows and MAC devices\nRestoration and migration of user data\nShipping, receiving and disposal of IT equipment\nSmart Hands support to assist other support groups such as networking, server and telecommunication teams\nPrinter and peripheral device support\nInventory management of IT assets including asset auditing\nVideo Conference room equipment support and meeting support\nExecute and follow appropriate KB articles\nSpecial event support including potential afterhours support requirements\nVIP support\nRequired Qualifications: \nWindows and MAC hardware and software troubleshooting skills and experience\nExcellent verbal and written communication skills\nAbility to do in-depth research and troubleshooting for complex technical issues\nAbility to complete all work tasks with minimal supervision\nAbility to work in an on-call rotation\nStrong customer service experience in a corporate environment\nExcellent time management skills to prioritize workload\nAbility to walk, bend and lift equipment up to 50 pounds and perform Physical duties of connecting computer equipment\nExperience supporting both MAC & Windows OS, Microsoft Office, smart phones, AV/VC equipment, printers and the following PC hardware manufactures: Apple, Lenovo, Dell, HP.\nHigh level of professionalism and strong personal interaction skills\nHigh level of flexibility and the ability to positively respond to changes in work requirements\nAbility to operate and communicate effectively while under pressure is essential\nAbility to communicate and interact with both technical and non-technical customers\nGood technical writing skills and a willingness to document all work performed\nAbility and willingness to learn new technologies\nWillingness and skills necessary to determine the solution & root cause of issue\nRequired Minimum Education: \nHigh School Diploma (required)\nAssociate Degree or at least some college courses in related field (preferred)\nRequired Minimum Experience: \nA Minimum of 3 years of experience in a related field\nPreferred Certifications: \nComp TIA A+\nMCDST – Microsoft Certified Desktop Support Technician\nACSP: Apple Certified Support Professional or ACDT: Apple Certified Desktop Technician\nMCSA – Windows 10\nJob Type: Full-time\nSalary: $30.00 /hour\nJob Location:\nBoston, MA\nRequired education:\nHigh school or equivalent\nRequired experience:\nIT Support: 3 years", 
        "location": "Boston, MA", 
        "date": "2017-04-21 23:20:22.771046", 
        "type": " Full-time"
    }, 
    "89": {
        "salary": 38500.0, 
        "title": "IT Specialist", 
        "url": "/company/Enlite-IT-Solutions,-Inc./jobs/IT-Specialist-ec736e3e1e0d3555?fccid=638c7b0fae5518b0", 
        "company": "Enlite  IT  Solutions Inc", 
        "summary": "Enlite IT Solutions, Inc., an IT firm specializing in education IT, is seeking candidates for the position of IT specialist. Based in Tustin, CA, Enlite provides complete IT solutions to charter and private schools in the Orange, LA, and Riverside county areas. This is a full time position (40 hrs/week) with time split between the company office and onsite visits to clients.\nResponsibilities: \nReview, triage, and troubleshoot help desk tickets\nWork and consult with Senior Engineer on project planning and implementation\nSupport client environments including deployment and configuration of hardware, software, network, and telecom equipment\nSupport staff and faculty via NOC, phone, email, and Ad-hoc support sessions\nReport and communicate system issues with the Senior Engineer.\nCreate, edit, and maintain client and company documentation, including Knowledge Base articles, password revisions, client system configurations, and all IT related information\nStay abreast with emerging technological developments related to computer hardware, software, as well as the latest trends in computer and systems management\nEducation & Experience: \nBA/BS in Information Technology, Information Science, Information Systems or an equivalent combination of education & experience which has provided both theoretical and practical knowledge in the field.\n4+ years experience in IT preferred\nExperience working in a mixed client environments\nRequired Skills\nMaintain and troubleshoot Windows OS, Mac OS, Linux, Chrome OS\nKnowledge of Active Directory, Azure\nDesired Skills: \nMicrosoft Exchange Server, Office 365, and G-Suite administration\nLayer 2-Layer 7 configuration\nCCNA/CCNP, or other major vendor certification (Juniper, Brocade, etc…)\nMCP/MCSE\nKnowledge of database maintenance, administration, and best practices\nVirtualization/Container knowledge such as VMWare, Hyper-V, and Proxmox\nRemote Client access platforms, RDWeb, AWS, and Citrix\nMSP (Managed Service Provider) experience\nGeneral Skills: \nCapability of expanding quickly into larger responsibilities as the company grows rapidly\nMust successfully pass a background check\nPossess a current valid driver’s license and own a registered/insured vehicle to commute to and from work\nAbility to stand and sit for extended periods of time\nSolid written & verbal skills\nStrong communication skills (in person, phone and/or email)\nAbility to multitask\nAbility to move or carry equipment weighing up to 60lbs\nJob Type: Full-time\nSalary: $35,000.00 to $42,000.00 /year\nRequired experience:\nIT: 4 years\nRequired license or certification:\nDriver's License", 
        "location": "Tustin, CA 92780", 
        "date": "2017-04-20 23:20:23.054755", 
        "type": " Full-time"
    }, 
    "82": {
        "salary": 48040.0, 
        "title": "IT Specialist", 
        "url": "/company/Strategic-Data-Systems/jobs/IT-Specialist-c0cf3480a2f90b0b?fccid=7195f9d9a703fd11", 
        "company": "Strategic Data Systems", 
        "summary": "Strategic Data Systems is looking for an IT Specialist Tier 2 to join our team. We are known for providing IT and Engineering solutions with multiple opportunities supporting the Department of Defense. The Perks: We offer competitive salaries, great benefits package and the opportunity for you to receive or maintain security clearances/certifications that can enhance your IT career locally or beyond.\nIT Specialist Mid\nMarine Corps Base,Camp Pendleton, CA 92055\nSalary Negotiable / Full-Time with Benefits\nFlexible Start-Date – Immediate Opening\nYou will support the installation, configuration and troubleshooting of computer software, printers and networks in an Enterprise-level, DOD Windows / Active Directory environment.\nYour work may also involve: \nPerform repairs on HP & Dell desktops/laptops; along with Xerox, HP and Lexmark network printers.\nUtilize HP Service Manager and Remedy Help Desk Support to prioritize, track and document incident and MAC (move, add, change) tickets.\nPerform hard drive re imaging, data recovery, decryption and encryption.\nDeploy computers, peripherals and configure smart phones/CAC readers.\nUtilize Active Directory, Remote Desktop Connection, Element and HP Service Manager to troubleshoot user account issues and configure DNS/ IP settings.\nTo qualify for this position you will need the following certifications and experience: \nThis role requires someone with 3-4 years' IT support experience, one of the following CompTIA certifications: Security+CE,Network+CE,A+CE and an active DOD security clearance.\nStrategic Data Systems is committed to providing equal employment opportunities to all employees and applicants without regard to race, religion, sex, national origin, age, disability or any other protected status in accordance with all applicable federal, state and local laws.\nJob Type: Full-time\nSalary: $43,680.00 to $52,400.00 /year\nRequired licenses or certifications:\nActive DOD Secret Security Clearance\nCompTIA A+CE or Network+CE or Security+CE", 
        "location": "Camp Pendleton, CA 92055", 
        "date": "2017-04-18 23:20:10.311866", 
        "type": " Full-time"
    }, 
    "83": {
        "salary": 0, 
        "title": "Information Technology Specialist", 
        "url": "/company/Virginia-National-Bank/jobs/Information-Technology-Specialist-86c98f6e98830aa0?fccid=c33c12e96d7bb397", 
        "company": "Virginia National Bank", 
        "summary": "Information Technology Specialist\nGENERAL SUMMARY: \n Installs, modifies and makes minor repairs to personal computer hardware and software systems, and provides technical advice and support to system users.\nPRIMARY JOB RESPONSIBILITIES: \nSupport and maintain bank network\nSupport and maintain servers and PCs\nPerform backups\nMaintain antivirus, patch system, and antispyware\nProvide end user technical support\nProvide secondary core banking platform support\nQUALIFICATIONS: \nHigh School diploma or GED\nStrong background in client server based computing and networks\nStrong background with Windows operating systems\nStrong background with server hardware\nHelpdesk or customer support experience preferred\nBanking background preferred, experience with FIS IBS system a plus\nEOE - Minorities / Females / Protected Veterans / Individuals with Disabilities\nInterested candidates submit resumes and letters of interest outlining salary requirements.\nJob Type: Full-time", 
        "location": "Charlottesville, VA", 
        "date": "2017-04-18 23:20:10.599468", 
        "type": " Full-time"
    }, 
    "80": {
        "salary": 27500.0, 
        "title": "Summer IT Intern", 
        "url": "/company/Kainos-Technologies/jobs/Summer-IT-Intern-9577c46893cb0fec?fccid=83ade44b39a5f2f6", 
        "company": "Kainos Technologies", 
        "summary": "Overview: \nKainos is a Texas based managed service provider responsible for supporting networks and systems associated with our client's business operations in and around the Central Texas area.\nThis position will be responsible for supporting both our installation and technology support groups working out of our home office in Waco, Texas.\nResponsibilities: \nProvide 1st tier support services to Kainos Clients who require assistance with their information technology resources\nInstall and configure computers, VoIP phones, and other common technology/devices for new and existing clients\nProvide after-hours or weekend support when necessary to perform high-risk or planned downtime of client IT systems for upgrades and maintenance - rare but sometimes required\nSupport our clients with regular maintenance such as monitoring backups, and verifying infrastructure system functionality\nInstall and support client Audio/Video equipment\nSupport the installation of intrusion detection systems, access control systems and security surveillance systems\nInterface with management, employees, and customers\nDevelop instructional documentation and convey highly technical information that can be understood by all client employees\nUpdate internal documentation on client configuration and standard system builds\nProvide support for the installation, maintenance and troubleshooting of wireless networks\nOther responsibilities as required\nRequirements: \nEducation & Experience Requirements: \nCurrently enrolled in or recently completed an Associate’s or Bachelor’s degree program in IT or related field\nGeneral Requirements: \nAbility to troubleshoot computer hardware, software, Microsoft technologies (Windows 7, 8 and 10), and IP networks\nAbility to properly terminate Ethernet cable\nAbility to address and resolve information technology issues promptly, effectively and independently\nWorking knowledge of audio/video equipment\nMust have current driver’s license\nExcellent verbal and written communication skills along with strong customer service skills\nAbility to make effective decisions in both routine and crisis situations\nPersonal initiative with strong organizational and analytical skills\nAbility to adjust to priority shifts throughout a given day\nPhysical Requirements: \nGood response to challenges posed by short deadlines\nAcute attention to detail\nA positive, upbeat attitude\nAbility to regularly lift up to 50 pounds for duties such as delivering computers, unpacking and rack-mounting equipment, etc.\nJob Type: Internship\nSalary: $12.50 to $15.00 /hour\nRequired license or certification:\nDriver's License", 
        "location": "Waco, TX", 
        "date": "2017-04-21 23:19:55.565403", 
        "type": " Internship"
    }, 
    "81": {
        "salary": 0, 
        "title": "Desktop Support Technician", 
        "url": "/company/Global-Data-Consultants,-LLC/jobs/Desktop-Support-Technician-ae7dc733343486eb?fccid=bf153771496fc62e", 
        "company": "Global Data Consultants LLC", 
        "summary": "Overview: \nGDC IT Solutions is currently recruiting for a \nDesktop Support Technician\n to support our client in the \nMacungie, PA\n area.\nPosition Overview: \nThe Desktop Support Technician will provide desktop support to end users in a manufacturing environment.\nResponsibilities: \nProvide primarily onsite technical support to internal end users\nInvestigate, define, and resolve complex problems\nSupport multiple locations within a 10 mile radius and resource must be willing to commute to those locations as needed\nInstall, upgrade, and troubleshoot software/hardware\nSupport desktops, laptop, printers, scanners, and mobile devices\nCommunicate verbally and in writing to technical and non-technical audiences\nCollaborate with other IT support team members in troubleshooting and resolving infrastructure and end-user problems, in addition to using all available resources such as personal skills, vendor documentation, and online knowledge bases\nMinimum Qualifications: \n5+ Years of total experience in technical end user support\nPrior experience working onsite in a desktop support role\nExpereince working in a large, manufactuing environment\nPreferred Experience: \nSome networking skills are a plus\nWhat We Do: \nGDC IT Solutions (GDC) is a full-service Information Technology (IT) company providing solutions that empower businesses to increase employee productivity, maximize investments, and improve operational efficiencies. With experienced and certified professionals, we deliver services in the areas of application development, data center, 24/7 multilingual service desk, desktop lifecycle management, project management, business process consulting, and IT staff augmentation.\nWhat Makes GDC Different: \nOur employees are our greatest asset continually driving our success each and every day. We attract and maintain the best talent to provide a personal customer experience at every touchpoint. Our technology professionals care about day-to-day client interactions and resolving customer issues quickly and efficiently, the first time. We deliver services with a code of high ethical responsibility, both to protect our clients and to assure that the work is carried out at the maximum level of professionalism. We are technology experts remaining one step ahead as technology evolves and constantly engaging to understand our clients’ business technology needs in order to deliver the best possible solution.\nWhy Work for GDC?\nCutting Edge Technology and Innovation: \n GDC fully supports and embraces continuing education and industry certifications to stay ahead of trends and remain current within the technology landscape. We recognize that our employees add the real value to our clients and to our business. By approaching our daily operations with a passion for innovation and a shared-learning environment, everyone can make a positive difference.\nCareer Growth: \n GDC is one of the fastest growing companies in the region! Sustained growth means ongoing opportunity. Many of our senior leaders have grown within the company, starting with the helpdesk or other entry-level roles to become thought leaders in the fields of IT infrastructure, application development, project management, and business development.\nEmployee-Centric Environment: \n GDC prides itself on employee satisfaction with a firm belief that happy employees are the most productive employees. In appreciation of our employees and their contributions, we sponsor numerous events throughout the year including an annual gala, golf, lunch barbeques and more.\nComprehensive Benefits Package: \n GDC offers competitive compensation, excellent benefits, and a positive work environment designed around the philosophy of mutual respect. Our comprehensive benefits package includes medical, dental, prescription, vision, 401(k), short and long-term disability, and group life\nHoliday and Vacation: \n GDC firmly believes in a comfortable work-life balance, and we offer comprehensive holiday and paid-time-off (PTO) packages. We provide a generous PTO package, and we encourage our staff to use it — whether it’s for vacation or other personal reasons everyone needs time to relax and refresh.\nEqual Opportunity Workplace: \nGDC is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. All qualified applicants will receive consideration for employment.\nVisit our\n \nCareer Center\n \nfor the latest employment opportunities.\nJob Type: Full-time", 
        "location": "Macungie, PA", 
        "date": "2017-04-21 23:20:09.570704", 
        "type": " Full-time"
    }, 
    "86": {
        "salary": 38500.0, 
        "title": "IT Specialist", 
        "url": "/company/Enlite-IT-Solutions,-Inc./jobs/IT-Specialist-ec736e3e1e0d3555?fccid=638c7b0fae5518b0", 
        "company": "Enlite  IT  Solutions Inc", 
        "summary": "Enlite IT Solutions, Inc., an IT firm specializing in education IT, is seeking candidates for the position of IT specialist. Based in Tustin, CA, Enlite provides complete IT solutions to charter and private schools in the Orange, LA, and Riverside county areas. This is a full time position (40 hrs/week) with time split between the company office and onsite visits to clients.\nResponsibilities: \nReview, triage, and troubleshoot help desk tickets\nWork and consult with Senior Engineer on project planning and implementation\nSupport client environments including deployment and configuration of hardware, software, network, and telecom equipment\nSupport staff and faculty via NOC, phone, email, and Ad-hoc support sessions\nReport and communicate system issues with the Senior Engineer.\nCreate, edit, and maintain client and company documentation, including Knowledge Base articles, password revisions, client system configurations, and all IT related information\nStay abreast with emerging technological developments related to computer hardware, software, as well as the latest trends in computer and systems management\nEducation & Experience: \nBA/BS in Information Technology, Information Science, Information Systems or an equivalent combination of education & experience which has provided both theoretical and practical knowledge in the field.\n4+ years experience in IT preferred\nExperience working in a mixed client environments\nRequired Skills\nMaintain and troubleshoot Windows OS, Mac OS, Linux, Chrome OS\nKnowledge of Active Directory, Azure\nDesired Skills: \nMicrosoft Exchange Server, Office 365, and G-Suite administration\nLayer 2-Layer 7 configuration\nCCNA/CCNP, or other major vendor certification (Juniper, Brocade, etc…)\nMCP/MCSE\nKnowledge of database maintenance, administration, and best practices\nVirtualization/Container knowledge such as VMWare, Hyper-V, and Proxmox\nRemote Client access platforms, RDWeb, AWS, and Citrix\nMSP (Managed Service Provider) experience\nGeneral Skills: \nCapability of expanding quickly into larger responsibilities as the company grows rapidly\nMust successfully pass a background check\nPossess a current valid driver’s license and own a registered/insured vehicle to commute to and from work\nAbility to stand and sit for extended periods of time\nSolid written & verbal skills\nStrong communication skills (in person, phone and/or email)\nAbility to multitask\nAbility to move or carry equipment weighing up to 60lbs\nJob Type: Full-time\nSalary: $35,000.00 to $42,000.00 /year\nRequired experience:\nIT: 4 years\nRequired license or certification:\nDriver's License", 
        "location": "Tustin, CA 92780", 
        "date": "2017-04-20 23:20:11.528253", 
        "type": " Full-time"
    }, 
    "87": {
        "salary": 75000.0, 
        "title": "Network/PC Technician", 
        "url": "/company/Network-Technology-Systems/jobs/Network-PC-Technician-92961ae051045208?fccid=5fd318460c067730", 
        "company": "Network Technology Systems", 
        "summary": "Looking for someone with system and network administrator experience at least 3 years. We are a new company seeking someone that is wIlling to help grow the business. We are a IT firm we service commercial and residential clients please send your resume.\nJob Type: Commission\nSalary: $50,000.00 to $100,000.00 /year\nRequired experience:\nInformation Technology: 3 years\nRequired licenses or certifications:\nA+ Certification\nNetwork+ Certification", 
        "location": "Diamondhead, MS 39525", 
        "date": "2017-04-23 23:20:16.008498", 
        "type": " Commission"
    }, 
    "84": {
        "salary": 0, 
        "title": "ENTRY LEVEL* Network Center Technician – Overland Park, KS (Help Desk/ IT)", 
        "url": "/company/NextGen-Global-Resources-LLC/jobs/Entry-Level-Network-Center-Technician-80a8d627ffe90de9?fccid=80d7dbbe923ac254", 
        "company": "NextGen Global Resources LLC", 
        "summary": "Entry Level Core Network Operations Technicians needed\nIdeal candidates have IT background with help desk experience (use of ticketing system)\nStart date: Early May 2017\nEligibility: \nUS CITIZENS ONLY\nThis role requires24x7x365support so candidates must be able to support flexible hours and schedules to ensure all shifts are covered. Tech background of some sort is preferred.\nDaily tasks:\nRun testing procedures using various tools\nPerform Check In/Check Out process\nAbility to quickly learn new tools and systems\nWillingness to work on any assigned shift\nProficient in using Microsoft office application such as Outlook, Excel, Word\nPerform routine ticket management and escalations to drive problems to final resolution\nTraining will be provided upon hire(previous NOC experience is not required)\nJob Type: Contract\nRequired license or certification:\nUS CITIZEN", 
        "location": "Overland Park, KS", 
        "date": "2017-04-14 23:20:10.955943", 
        "type": " Contract"
    }, 
    "85": {
        "salary": 0, 
        "title": "IT Service Desk Specialist (Tier 1)", 
        "url": "/company/Arraya-Solutions/jobs/IT-Service-Desk-Specialist-9a49454b44b22bde?fccid=8e131eee5da0bed7", 
        "company": "Arraya Solutions", 
        "summary": "Arraya Solutions, a leading Mid-Atlantic technology consulting firm and managed services provider located just outside Philadelphia is looking for a \nService Desk Specialist\n to join our team!\nWe are a culture that embraces change, values family and we are actively involved with the community. Our team consists of people with positive attitudes who have an interest in growing their knowledge around technology and leaders that are heavily involved in the day to day activities.\nIn this role, you will be responsible for supporting and growing our managed service offerings, which include cloud-based backup, and infrastructure monitoring and problem remediation. This individual will be asked to maintain our managed services infrastructure and field service calls from customers regarding requests and issues. Additionally, this position will be expected to monitor and service our internal infrastructure and staff.\nResponsibilities: \nField Support Call\nHardware and Software incident remediation\nAccount provisioning/administration\nOn-site and remote technical support\nScheduling updates\nEmployee account creation and management\nLaptop provisioning/repair\nNetwork print services\nManaging multiple client ticket systems\nMonitoring of client networks/infrastructure and following a notification and escalation process\nDesired Attributes: \nStrong customer service skills\nExperience with \nWindows Operating Systems\n , with an understanding of security permissions for Active Directory.\nExperience with Microsoft’s System Center Configuration Manager (SCCM)\nExperience with Microsoft Office 365\nExperience with monitoring solutions, such as \nMicrosoft System Center Operations Manager\n , Nagios XI.\nFamiliarity with SharePoint, Exchange and SQL\nExperience supporting laptop/desktop workstations and troubleshooting problems related to end-user applications.\nMicrosoft certifications are a plus\nPosition Type and Expected Hours of Work: \nThis is a full-time position, (40) hours/week. Please note there are two shifts available for the Service Desk. Days and hours of work for the \nsecond shift is between 3:00pm – 11:30pm\n , \nSaturday through Wednesday\n and \nthird shift is between 11:00pm – 7:30am, Saturday through Wednesday\n .\nA possibility of off-hours support work.\nJob Type: Full-time", 
        "location": "Plymouth Meeting, PA 19462", 
        "date": "2017-04-11 23:20:11.262623", 
        "type": " Full-time"
    }, 
    "3": {
        "salary": 50000.0, 
        "title": "IT Technician", 
        "url": "/company/USTECHLAND-CORP./jobs/IT-Technician-dd6cc04c5ca2440a?fccid=70c07b025617cd40", 
        "company": "USTECHLAND CORP", 
        "summary": "We are an IT company looking for professionals\nWe are looking for experienced technician all over the USA. There are multiple positions PART TIME, FULL TIME, CONTRACT (side work, flexible hours, and contractor). \nGo here to apply: \n \nhttps://ustechland.com/SignUp\nJob Type: Full-time\nSalary: $50,000.00 /year\nRequired education:\nAssociate\nRequired experience:\nInformation Technology: 1 year\nRequired language:\nEnglish", 
        "location": "Boston, MA", 
        "date": "2017-04-14 23:14:47.392702", 
        "type": " Full-time"
    }, 
    "7": {
        "salary": 55000.0, 
        "title": "IT Generalist / Jr. Admin.", 
        "url": "/company/Intex-Recreation-Corp/jobs/IT-Generalist-6b78054be235443c?fccid=2f52ec1606149d18", 
        "company": "Intex Recreation Corp", 
        "summary": "INTEX is an entrepreneurial industry leader manufacturing and marketing Above Ground Swimming Pools, Pool Accessories and Inflatable Airbeds. With over 40 years of experience, our well known products are sold worldwide to major retail customers.\nWe have an excellent career opportunity for a JR IT professional. We require 2-4 years of related work experience. Bachelor’s degree and/or certifications preferred. Salary range is between $45,000 - $55,000 DOE\nWe are seeking a dynamic individual who is a quick learner with an open mind. We need someone who is a team player with good communication skills.\nsome responsibilities will include but not limited to:\n1. work with TCP/IP Networks, desktop support, Linux, VMware Virtualization, MS Windows, Active Directory, Firewalls, Network Switches\n2. application support\n3. Network support (routing changes/updates, firewall changes/updates, switching changes/updates)\n4. server support including Linux Servers (Apache, PHP, MySQL)\n5. Windows servers, including active directory, general technical housekeeping & documentation, VOIP, MAC Savy\nIt will be a PLUS to have MCSE Certification, Red Hat Certification, MAC Experience, LAMP stack & strong documentation skills\nIf you are motivated by challenges, take pride in your work, and are looking for a ground-floor opportunity, then consider joining the team that is setting the pace in the industry!\nJob Type: Full-time\nSalary: $55,000.00 /year", 
        "location": "Long Beach, CA", 
        "date": "2017-04-21 23:14:56.681721", 
        "type": " Full-time"
    }, 
    "100": {
        "salary": 35000.0, 
        "title": "System Administrator", 
        "url": "/company/Red-Paladin/jobs/System-Administrator-7ac13c94bddaea7e?fccid=e90d309547f42799", 
        "company": "Red Paladin", 
        "summary": "SUMMARY\n-Manage and tune client computer software systems, servers, virtual machines, and network connections to ensure high levels of availability and security of the supported business applications. -Participate in the planning and implementation of policies and procedures to ensure system provisioning and maintenance that is consistent with company's goals, industry best practices, and regulatory requirements\nSKILLS\n .\n-Experience with Windows Server (2003, 2008, and 2012) platforms.\n-Experience with Windows Security Configuration and Analysis.Experience with Windows security tools/appliances (Firewalls, IPS).Experience with Local Area Network technologies (Switches, Hubs, Routers, VPN, etc).Working knowledge how to provide support for MS Active Directory including Windows domain group policies and administration.\n-Experience with VMware, Segregated Storage, NAS, SAN, and Backups.Experience with backup and recovery tools/software.\nESSENTIAL DUTIES & JOB RESPONSIBILITIES\n-Troubleshoot network systems and respond to issues and or problems.\n-Provides documentation and management reporting.\n-Provide tactical and strategic input on overall network planning and related projects.\n-Review, analyze and evaluate business systems and user needs.Install new software releases, system upgrades, evaluate and install patches and resolve software and OS related problems.\n-Perform system backups and recovery. Maintain data files and monitors system configuration to ensure data integrity.\n-Provide user support as required.Investigate network and security issues and provide recommendations for improvement.\n-Participate in Business Continuity/Disaster Recovery infrastructure planning, building, and testing.\n-Ensure the integrity and security of enterprise data.\n-Manage end user accounts, permissions, access rights, and storage allocations in accordance with best-practices regarding privacy, security, and regulatory compliance.Perform and test routine system backups and restores.Anticipate, mitigate, identify, troubleshoot, and resolve hardware and software problems.\n-Support application development teams.\n-Analyze system, server, and application, and network, performance.\n-Recommend, schedule, and perform software and hardware improvements, upgrades, patches, reconfiguration, and/or purchases.\n-Conduct research on emerging products, services, protocols, and standards in support of systems software procurement and development efforts.\n-Develop, document, and maintain policies, procedures and associated training plans for system administration and appropriate use.Build and deploy physical and virtual servers.\nJob Type: Full-time\nSalary: $30,000.00 to $40,000.00 /year\nRequired education:\nAssociate\nRequired experience:\nSystem Administration: 6 years", 
        "location": "Piscataway, NJ 08854", 
        "date": "2017-04-20 23:20:48.534478", 
        "type": " Full-time"
    }, 
    "39": {
        "salary": 0, 
        "title": "IT Help Desk Support", 
        "url": "/company/Spring-Systems-Inc/jobs/IT-Help-Desk-Support-676f3a19b3d17260?fccid=ca0854fbd9aa927d", 
        "company": "Spring Systems Inc", 
        "summary": "Looking to join a growing company in \nValley Stream\n ?\nDo you want to join a family, not just find a job?\nDo you want to learn and grow?\nCome join our team as \nTechnical - Help Desk Coordinator\nOur company, located in \nValley Stream\n , provides Web EDI services to help retail, wholesale and fashion clients manage and process their orders with automated functionality and integration and reliability.\nWe pride ourselves on building strong business relationships with our customers, helping them deepen their relationships with the major retail players (Amazon.com, Bed Bath & Beyond, Bloomingdale's, Macy's, Neiman Marcus, Nordstrom, Saks Fifth Avenue, Target, Walmart, etc.)\nWe are looking for a detail-oriented, personable candidate with experience in \ncustomer service and technology.\nThe Technical Customer Service Coordinator supports printing and transaction processing. The role is 100% service via email and data entry.\nCandidates must have \nstrong Excel experience, some database or programming exposure,\n and be a self-starter, willing to take on new projects as needed.\nAll transactions will be EDI related, however prior EDI experience is not required, but appreciated.\nRESPONSIBILITIES INCLUDE: \nPrepare, run, and ship client print jobs (shipping labels, packing slips and other shipping documents)\nSupport client requests for transaction processing (data entry & configuration of shipping, invoicing transactions).\nAssign new UPC codes and load to online catalogs.\nExecute reports to match sent transactions with appropriate acknowledgements.\nMaintain trading partner address tables in excel and SQL database.\nMonitor and respond to email requests and alerts.\nMANDATORY SKILLS: \nHighly proficient with Excel.\nAbility to use formulas to analyze large amounts of data.\nDatabase/SQL or programming\n experience or training.\nAttention to detail.\nAbility to read, comprehend and follow detailed instructions.\nGood communication skills and problem solving skills.\nAbility to work on a computer for extended periods of time with limited supervision.\nPrevious \nEDI\n or shipping experience is a plus!\nE.O.E.\nJob Type: Full-time\nJob Location:\nValley Stream, NY\nJob Type: Full-time\nJob Location:\nValley Stream, NY\nRequired education:\nHigh school or equivalent\nRequired experience:\nIT Support: 2 years", 
        "location": "Valley Stream, NY 11580", 
        "date": "2017-04-23 23:17:53.212058", 
        "type": " Full-time"
    }, 
    "38": {
        "salary": 103000.0, 
        "title": "IT Support Manager / Senior IT Analyst", 
        "url": "/company/Alameda-County/jobs/IT-Support-Manager-7648d71b25c5fd95?fccid=8ec0524bc8e45185", 
        "company": "Alameda County", 
        "summary": "Position Summary\nUnder direction of Agency or Department executive management, to supervise, plan, and coordinate the work of technical and professional information systems staff involved in developing, evaluating, and implementing the most complex and varied management information, financial, and specialized information systems for the purpose of improving operations; to lead, coordinate, and participate in organizational or management analysis; and to do related work as required.\nPositions allocated to this class are responsible for supervising and coordinating the acquisition, implementation and maintenance of a department's information system capabilities. The Information Systems Manager has responsibility for supervising information systems staff, at least one of which is at a professional level\nThe IT Support Manager / Senior IT Analyst is responsible for planning, executing and finalizing solutions related to new and existing products, modules and services. The Technical Project Manager sets milestones for each project, coordinates efforts between operations and technology teams, in order to effectively and efficiently deliver projects according to plan. This position works with internal and external stakeholders to bring structure while implementing complex, project-based processes to bring increased efficiency in the delivery of all projects and services and in turn, enhanced client satisfaction. The IT Support Manager / Senior IT Analyst will perform needs analysis, write the requirements specification documentation for the software developer including interface designs.\nPosition Scope: \nSupervises subordinate technical and professional staff involved in the development and implementation of computer or information systems.\nOversees and coordinates the information systems section/function of the department.\nIdentifies potential solutions to information system problems and determines system feasibility, equipment requirements, personnel requirements, cost/benefits effectiveness, time requirements, and makes a recommendation on which solutions should be used.\nDefines the scope of information system problems and goals and identifies data collection processes and procedures.\nProactively manage changes in project scope, identify potential crises and devise contingency plans. Learns the business processes and how they interact with our systems.\nProject Management Scope: \nCreate and manage the project plan for moving technical solutions to the final go live date.\nAssemble and coordinate the internal and external teams to gain consensus on deliverables from each team.\nAssist with the development of reports, and the loading and configuration of demonstration data and systems.\nOwn the communication and execution of solution hand-over to client services, service delivery, technology and other team members at designated milestones.\nDevelop and deliver progress reports, requirements documentation and presentations.\nSome project duties may fall outside the areas of focus development.\nRequirements: \n4+ years of experience working as an IT manager managing IT software, hardware and desktop support.\nProficient in creating reports using SQL Server Reporting Services 2005/2008.\nExperience in scoping, timeline creation, project tracking, risk management, and process improvement. Good at managing expectations about risks, issues, resourcing and timeframes\nExperience in a technical environment, with an emphasis on working with end users required\nKnowledge and experience with Excel, Visio, relational database query, and data analysis\nProficient in SQL\nExperience with Business Objects (Crystal Reports) is desirable\nSelf-motivated, proactive and capable of managing multiple priorities.\nAbility to appreciate change management and stakeholder engagement needs.\nAbility to exercise independent judgment and effective time-management while balancing concurrent project workloads.\nDetailed knowledge of Windows Servers operating systems and utilities, as well as familiar with Windows domain file sharing environment and a basic understanding of networking infrastructure.\nAbility and aptitude for analyzing problems thru effective listening in order to provide solutions in a time sensitive environment.\nAbility to manage and work on cross functional projects involving multiple partners within the organization\nProven working knowledge of project methodology and success with delivering projects on time, on budget, and with high quality.\nStrong decision-making and leadership abilities.\nExpert in using office tools, Microsoft project, SharePoint, Visio and PowerPoint.\nSimilar industry experience preferred.\nResponsibilities: \nSupervises and coordinates the development and implementation of new computer systems and programs; serve as liaison with Information Technology Department staff in developing and implementing new computer systems/applications by providing input/output requirements, department standards, etc.; develops or revises existing programs for user application; develops specifications for obtaining software and/or hardware for departmental application.\nDevelops systems analysis methods and conducts systems analysis appropriate to the department's specific needs. Analyzes workflow and/or organizational structure and recommends improvements to systems or structures to increase productivity or efficiency.\nPlans and coordinates system testing to assure that related systems meet user's needs and are fully compatible in terms of program/system implementation and maintenance.\nCoordinates the training of department personnel in the use of computer software and hardware.\nMeets with hardware and software vendors to evaluate new products and programs.\nincluding security of the system, troubleshooting any software or hardware malfunctions, and creating and maintaining system manuals; develops and maintains procedure manuals.\nDirects and participates in long-term audits of computer systems and programs; analyzes results of these systems; identifies and implements changes to existing systems in order to bring them up to maximum efficiency.\nDevelops complex programs and applications for information systems. Strong business analysis skills as well as project management experience\nLead project teams to deliver multiple simultaneous cross functional projects\nBuild project plans. Track, and manage comprehensive project schedules and monitor/measure progress on an on-going basis\nClearly and concisely communicate project details. Set clear expectations and context, and communicate well across all levels of business\nLead project initiatives: including identifying and analyzing preliminary business needs, budget considerations, time and resource estimates, defining the project scope and objectives, and getting business user consent.\nJob Type: Full-time\nSalary: $44.00 to $59.00 /hour\nRequired education:\nBachelor's\nRequired experience:\nsystem analysis, application development, system evaluation: 4 years\nSQL: 1 year\ndirect supervision of technical IT Staff: 1 year\nProject Management: 1 year\nVendor Management: 1 year\nRequired language:\nEnglish", 
        "location": "Oakland, CA", 
        "date": "2017-04-10 23:17:49.222757", 
        "type": " Full-time"
    }, 
    "33": {
        "salary": 0, 
        "title": "IT Support Specialist", 
        "url": "/company/AEQUOR-Technologies,-Inc./jobs/IT-Support-Specialist-09cb64860b707fa0?fccid=91b44cea9fbac389", 
        "company": "Aequor Technologies", 
        "summary": "Location: Boston, MA\nDuration: 15+ Months\nDescription\n(Intermediate, 1 - 3 Years Experience).\nMaintains, analyzes, troubleshoots, and repairs computer systems, hardware and computer peripherals. Documents, maintains, upgrades or replaces hardware and software systems.\nSupports and maintains user account information including rights, security and systems groups.\nMay require an associate’s degree in a related area or 1 - 3 years of experience in the field or in a related area.\nFamiliar with a variety of the fields concepts, practices, and procedures.\nRelies on experience and judgment to plan and accomplish goals.\nPerforms a variety of complicated tasks.\nTypically reports to a project leader or manager.\nA wide degree of creativity and latitude is expected.\nPosition Description: \nField incoming help \nrequests\n from \nend users\n via both telephone and work orders in a courteous manner.\nDocument all pertinent end user\n identification information, including name, department, contact information, and nature of problem or issue.\nBuild rapport and elicit problem details from help desk customers.\nPrioritize and schedule problems.\nEscalate problems (when required) to the appropriately experienced technician.\nRecord, track, and \ndocument the help desk request\n problem-solving process, including all successful and unsuccessful decisions made, and actions taken, through to the final resolution.\nApply diagnostic utilities to aid in \ntroubleshooting\n .\nAccess software updates, drivers, knowledge bases, and frequently asked questions resources on the Internet to aid in problem resolution.\nIdentify and learn appropriate software and hardware used and supported by the organization.\nPerform \nhands-on fixes at the desktop level\n , including \ninstalling and upgrading software\n , implementing file \nbackups\n , and \nconfiguring systems and applications\n .\nTest fixes to ensure problem has been adequately resolved.\nPerform post-resolution \nfollow-ups\n to help requests.\nDevelop help sheets and knowledge base articles for end users.\nWork with end-users to ensure transition of all software and customized settings are complete\nFollow refresh process and documentation to ensure quality and accuracy\nAbility to follow technical process / documentation required\nSpecific knowledge of support practices on \nhardware desktop and laptop devices\nPerform related duties consistent with the scope and intent of the position\nJob Type: Contract\nRequired experience:\nIT Support: 2 years", 
        "location": "Cambridge, MA", 
        "date": "2017-04-11 23:17:15.287978", 
        "type": " Contract"
    }, 
    "32": {
        "salary": 57428.8, 
        "title": "Desktop Support Technician", 
        "url": "/company/Ohio-Department-of-Medicaid/jobs/Desktop-Support-Technician-0e3c35f0cc33a674?fccid=9dad9f0c42aa7c8e", 
        "company": "Ohio Department of Medicaid", 
        "summary": "POSITION DESCRIPTION: \nPrimary Technology: \n Desktop Support\nSecondary Technology: \n LAN/Printer Support\nInstalls/uninstalls, maintains, configures, upgrades tracks, &/or administers hardware &/or software independently in one or more of the following technologies: workstation support, application administration, network administration, server administration, business continuity, information security, telecommunications & network connectivity, &/or SAN administration (i.e., multiple technology domains) where technical work requires specific knowledge to evaluate, select, adapt & modify standard procedures; devises new approaches to problems encountered. Diagnoses, analyzes & resolves issues for customer(s) across assigned multiple technology domains.\nCreates, organizes, files & maintains documentation. Reviews & monitors enterprise security systems; takes appropriate action & responds to alarms/alerts per agency policy & procedure (e.g., network printer administration, SafeBoot, Computrace, anti-virus, spam, etc.).\nInterfaces with vendors &/or other platforms from a hardware &/or software perspective .Answers questions & presents informal mentorship opportunities to peers &/or lower-level staff via conversation, observation or technical documentation.Job duty, knowledge, skill, & ability statements at a lower-level are understood to be able to be performed at any higher level.\nRequired Qualifications:\nEducation\nCore associate program in Computer Science or Information Systems OR equivalent work experience.\nAND\n \nExperience\nMinimum 3 years combined work experience in any combination of the following: installing, monitoring/maintaining, configuring, upgrading, and/or administering/operating multiple technology domains as specified by the agency position description and vacancy/job posting (i.e. Desktop Support & LAN/Printer Support).\nJob Type: Full-time\nSalary: $57,428.80 /year\nRequired education:\nAssociate\nRequired experience:\nDesktop Support: 3 years", 
        "location": "Columbus, OH", 
        "date": "2017-04-12 23:17:14.690863", 
        "type": " Full-time"
    }, 
    "31": {
        "salary": 50000.0, 
        "title": "IT Field Service Technician", 
        "url": "/company/Norman-Alan-Company,-LLC/jobs/IT-Field-Service-Technician-7eab1ce886023de3?fccid=642b93c8608bd8a9", 
        "company": "Norman Alan Company LLC", 
        "summary": "Norman Alan Company is a diversified staff of information technology professionals working as a team to design, implement, and maintain IT systems for companies in Greensburg and surrounding areas. Our primary IT Services include: Network Design and Placement, Managed Services, Remote Support Services, and Cloud Services.\nAs a Network Administrator, you will be responsible for onsite support at the offices of our clients. This position is responsible for providing all aspects of ongoing network administration, server support and end-user support – from solving problems, to making changes, to proactive and preventative maintenance, to reactive support.\nPrimary Responsibilities: \nInstalling, managing, configuring and troubleshooting software on desktops and laptops.\nInstalling, managing, configuring and troubleshooting software on servers.\nManaging, configuring and troubleshooting firewall security appliance.\nUser account maintenance, including: adding new user accounts; setting-up new user desktop profiles and mail profiles; deleting user accounts; and resetting passwords.\nComputer setup, including: setting up and connecting new computers, installing software, setting-up user profiles, migrating profiles and data.\nNormal working hours are Mon – Fri, 8 AM – 5 PM however, candidate must be able to work after hours and weekends as scheduled.\nNorman Alan Company will only entertain individuals that have strong work ethic, professional appearance, sharp communication skills, and experience dealing with corporate clients.\nDesired Qualifications: \nAssociate or Bachelor’s degree in technical field\n3+ yrs. experience supporting multiple customers via phone or in the field\nMicrosoft-based Server environments, SonicWALL products, disk-based and cloud based backup solutions and related network infrastructure including PC’s and mobile devices.\nMicrosoft Server OS administration and configuration\nFunctional knowledge of core networking concepts including TCP/IP, DHCP, DNS\nExchange administration with migration and upgrade experience\nStrong troubleshooting skills\nLAN/WAN (VPN, VLAN, Firewalls, etc.)\nMicrosoft Certification a plus\nWork Environment Conditions: \nLocation: Daily local car travel in a 50-mile radius of Greensburg is required, using a personal vehicle. On most occasions, work for this position is performed in the field, onsite at the offices of our clients in the local area. A valid driver's license, a reliable personal vehicle, and a responsible driving record are required.\nPhysical Requirements: \nThe employee is frequently required to stand, walk and sit, and use hands to operate computer keyboard, mouse, telephone and basic office equipment. The employee is occasionally required to stoop, kneel, crouch or crawl. The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. While performing the duties of this job, the employee is regularly required to talk, see and hear. Ability to drive a vehicle.\nSalary & Compensation: \nExpense reimbursement for any travel  * Excellent Health/Vision/Dental plans - premium 100% paid by Norman Alan Company for employee, spouse and dependents\n401k Retirement Plan w/ 6% Company Match\nPaid Vacation, Sick Time & Holidays\nRequired experience: \nIT Support: 3 years+\nRequired education: \nAssociate\nJob Type: \nFull-Time Salary\nPlease include salary requirement when submitting your resume.\nNOTE: Resumes will NOT be considered from outside the Greensburg/Pittsburgh Metro Region. NOTE: Resumes will NOT be considered if you do not have 3+ years of relevant IT experience.\nJob Type: Full-time\nSalary: $40,000.00 to $60,000.00 /year", 
        "location": "Greensburg, PA 15601", 
        "date": "2017-04-17 23:17:13.223133", 
        "type": " Full-time"
    }, 
    "30": {
        "salary": 0, 
        "title": "IT Support Specialist", 
        "url": "/company/AEQUOR-Technologies,-Inc./jobs/IT-Support-Specialist-09cb64860b707fa0?fccid=91b44cea9fbac389", 
        "company": "Aequor Technologies", 
        "summary": "Location: Boston, MA\nDuration: 15+ Months\nDescription\n(Intermediate, 1 - 3 Years Experience).\nMaintains, analyzes, troubleshoots, and repairs computer systems, hardware and computer peripherals. Documents, maintains, upgrades or replaces hardware and software systems.\nSupports and maintains user account information including rights, security and systems groups.\nMay require an associate’s degree in a related area or 1 - 3 years of experience in the field or in a related area.\nFamiliar with a variety of the fields concepts, practices, and procedures.\nRelies on experience and judgment to plan and accomplish goals.\nPerforms a variety of complicated tasks.\nTypically reports to a project leader or manager.\nA wide degree of creativity and latitude is expected.\nPosition Description: \nField incoming help \nrequests\n from \nend users\n via both telephone and work orders in a courteous manner.\nDocument all pertinent end user\n identification information, including name, department, contact information, and nature of problem or issue.\nBuild rapport and elicit problem details from help desk customers.\nPrioritize and schedule problems.\nEscalate problems (when required) to the appropriately experienced technician.\nRecord, track, and \ndocument the help desk request\n problem-solving process, including all successful and unsuccessful decisions made, and actions taken, through to the final resolution.\nApply diagnostic utilities to aid in \ntroubleshooting\n .\nAccess software updates, drivers, knowledge bases, and frequently asked questions resources on the Internet to aid in problem resolution.\nIdentify and learn appropriate software and hardware used and supported by the organization.\nPerform \nhands-on fixes at the desktop level\n , including \ninstalling and upgrading software\n , implementing file \nbackups\n , and \nconfiguring systems and applications\n .\nTest fixes to ensure problem has been adequately resolved.\nPerform post-resolution \nfollow-ups\n to help requests.\nDevelop help sheets and knowledge base articles for end users.\nWork with end-users to ensure transition of all software and customized settings are complete\nFollow refresh process and documentation to ensure quality and accuracy\nAbility to follow technical process / documentation required\nSpecific knowledge of support practices on \nhardware desktop and laptop devices\nPerform related duties consistent with the scope and intent of the position\nJob Type: Contract\nRequired experience:\nIT Support: 2 years", 
        "location": "Cambridge, MA", 
        "date": "2017-04-11 23:17:07.967244", 
        "type": " Contract"
    }, 
    "37": {
        "salary": 0, 
        "title": "IT Helpdesk Administrator", 
        "url": "/company/Capital-Crossing-Servicing-Company/jobs/IT-Helpdesk-Administrator-fecc9e967fa44c86?fccid=b6acf32321ba192a", 
        "company": "Capital Crossing Servicing Company", 
        "summary": "COMPANY OVERVIEW\nCapital Crossing is an industry leading underwriter, investor and servicer of commercial real estate and small business loans. Since 1987, with a disciplined approach, the company has purchased and managed more than $5 billion in assets nationwide, both for its own account and for its strategic partners. It has built its business model and reputation on a strong central core – its people. Our culture is one of teamwork, trust, respect and commitment, and we are always looking for people who are highly motivated and stand out from their peers.\nJOB SUMMARY\nThe Help Desk Administrator is a member of Capital Crossing Servicing Company’s Information Systems team and provides a broad range of technical support for systems, with an emphasis on providing first and second level technical support for the day-to-day operation of employee computers, printers, and applications. The qualified candidate will also assist in monitoring the health of the IT infrastructure by reviewing system reports, monitoring system updates, and recording daily backup performance. In addition, the position will be asked to do various small projects and tasks such as maintaining inventory, imaging computers, setting up new employees, updating network diagrams, and verifying warranties.\nESSENTIAL JOB FUNCTIONS\nRespond to initial support requests via phone, email, or in person\nTrack reported support requests and follow up on unresolved requests\nResolve issues and provide support in the following areas:\nWorkstation and Laptop hardware\nPrinters and Multi-Function Copiers\nWindows 7 and MS Office\nMobile device hardware and connectivity (iPhone/iPad/Surface)\nUser Access\nCreate new accounts\nUpdate network and/or application access privileges\nReset passwords and unlock accounts * Application errors\nInternet and WAN connectivity issues\nRemote access issues\nWi-Fi connectivity issues\nWindows updates\nAnti-virus maintenance\nInventory and tagging of IT assets\nRegular log reviews\nBackups\nServer logs\nNetwork monitoring\nMINIMUM JOB REQUIREMENTS: \nAt least 1 year experience with hands-on support of Windows PC’s, preferably working with Dell computers\nBachelor’s degree in Computer Science, Information Systems, Engineering, Business or other technical area.\nMicrosoft Windows and Office experience\nBasic workstation/laptop/printer hardware knowledge\nSolid Interpersonal Skills (Customer service oriented)\nInterest in technology\nDetail oriented\nAble to work independently\nAbility to multitask\nTeam player\nBasic network security\nJob Type: Full-time\nJob Location:\nBoston, MA", 
        "location": "['Boston, MA 02110 ', '(Central area)']", 
        "date": "2017-04-17 23:17:36.596491", 
        "type": " Full-time"
    }, 
    "36": {
        "salary": 39000.0, 
        "title": "PC Support Specialist", 
        "url": "/company/Protalus/jobs/PC-Support-Specialist-9dd9fe7ac27f37c0?fccid=a987b1fadf510821", 
        "company": "Protalus", 
        "summary": "Come join our dynamic and rapidly growing team. At Protalus we work hard, have a lot of fun, and work together to create a unique and amazing culture.\nThe PC Support Specialist will assist the IT Manager to support client computers, printers, cell phones and other IT systems used by Protalus.\nDuties and Responsibilities: \nIT Support for dozens of Windows PC's and a small amount of Mac OS X systems.\nSupport for mobile phones (iOS and Android) and land line phones.\nIT ordering including computers, phones, monitors, and accessories.\nAssist with troubleshooting network and server platforms.\nCreate and maintain documentation for IT systems and policies.\nQualifications: \nEducation: Bachelors Degree in IT/IS or a Technology-related field or equivalent work experience.\nExperience: 2-5 years of experience supporting IT in a corporate environment.\nCertification: Certifications from Microsoft, CompTIA, Linux Foundation, etc. are highly desirable.\nDemonstrated Skills: \nExperience with managing multiple client computers including OS/drivers/BIOS installation, application installation and advance troubleshooting and should have a solid understanding of TCP/IP networking concepts.\nAdvanced/Specialized Knowledge: \nKnowledge of Active Directory/Group Policy as well as Google GSuite and Microsoft Office 365 is preferred.\nAbilities\n :\nPerform root cause analysis to identify and resolve problems and should have experience with command line tools for advance configuration and troubleshooting.\nThe good stuff\n :\nPTO/Sick Pay\n is awarded to eligible full time regular employees on their first day of employment following the calendar quarter as follows:\nHired in 1st quarter 4 weeks\nHired in 2nd quarter 3 weeks\nHired in 3rd quarter 2 weeks\nHired in 4th quarter 1 week\nHoliday Pay\nThe following are holidays that Protalus will observe:\nNew Year’s Day\nMemorial Day\nIndependence Day\nLabor Day\nThanksgiving\nDay after Thanksgiving\nChristmas Eve\nChristmas Day\nOne (1) Floating Holiday to use as you wish\nJob Type: Full-time\nSalary: $17.00 to $22.00 /hour\nRequired experience:\nIT Support: 2 years", 
        "location": "West Linn, OR 97068", 
        "date": "2017-04-11 23:17:36.334940", 
        "type": " Full-time"
    }, 
    "35": {
        "salary": 39000.0, 
        "title": "PC Support Specialist", 
        "url": "/company/Protalus/jobs/PC-Support-Specialist-9dd9fe7ac27f37c0?fccid=a987b1fadf510821", 
        "company": "Protalus", 
        "summary": "Come join our dynamic and rapidly growing team. At Protalus we work hard, have a lot of fun, and work together to create a unique and amazing culture.\nThe PC Support Specialist will assist the IT Manager to support client computers, printers, cell phones and other IT systems used by Protalus.\nDuties and Responsibilities: \nIT Support for dozens of Windows PC's and a small amount of Mac OS X systems.\nSupport for mobile phones (iOS and Android) and land line phones.\nIT ordering including computers, phones, monitors, and accessories.\nAssist with troubleshooting network and server platforms.\nCreate and maintain documentation for IT systems and policies.\nQualifications: \nEducation: Bachelors Degree in IT/IS or a Technology-related field or equivalent work experience.\nExperience: 2-5 years of experience supporting IT in a corporate environment.\nCertification: Certifications from Microsoft, CompTIA, Linux Foundation, etc. are highly desirable.\nDemonstrated Skills: \nExperience with managing multiple client computers including OS/drivers/BIOS installation, application installation and advance troubleshooting and should have a solid understanding of TCP/IP networking concepts.\nAdvanced/Specialized Knowledge: \nKnowledge of Active Directory/Group Policy as well as Google GSuite and Microsoft Office 365 is preferred.\nAbilities\n :\nPerform root cause analysis to identify and resolve problems and should have experience with command line tools for advance configuration and troubleshooting.\nThe good stuff\n :\nPTO/Sick Pay\n is awarded to eligible full time regular employees on their first day of employment following the calendar quarter as follows:\nHired in 1st quarter 4 weeks\nHired in 2nd quarter 3 weeks\nHired in 3rd quarter 2 weeks\nHired in 4th quarter 1 week\nHoliday Pay\nThe following are holidays that Protalus will observe:\nNew Year’s Day\nMemorial Day\nIndependence Day\nLabor Day\nThanksgiving\nDay after Thanksgiving\nChristmas Eve\nChristmas Day\nOne (1) Floating Holiday to use as you wish\nJob Type: Full-time\nSalary: $17.00 to $22.00 /hour\nRequired experience:\nIT Support: 2 years", 
        "location": "West Linn, OR 97068", 
        "date": "2017-04-11 23:17:27.761675", 
        "type": " Full-time"
    }, 
    "34": {
        "salary": 46945.0, 
        "title": "PC Technician/Hardware", 
        "url": "/company/IMRI-Technology-and-Engineering-Solutions/jobs/PC-Technician-Hardware-f3cc13429874a125?fccid=f2efc7f5fca69db6", 
        "company": "IMRI Technology and Engineering Solutions", 
        "summary": "IMRI has an opportunity for a PC Technician/Hardware in OMAHA, NE. This position requires 1-2 years of experience and \nmust have or be able to obtain an active security clearance. Must have an A+Ce cert.or obtain an equivalent cert.\n1. Installs, troubleshoots, services, and repairs personal computers, network equipment such as servers, modems, multiplexers, related PC software, telephones, cables, and connectors.2. Provides personal computer, hardware, and software support. Installs, services, and repairs personal computers. Connects personal computers and terminals to existing data networks.3. Instructs users in the use of personal computers and networks.4. Investigates information, network, and communications needs of users.5. Uses appropriate ticketing system to track work.\nMATERIAL & EQUIPMENT DIRECTLY USED\n : Computer, server, modems, multiplexers, telephones, cables and connectors.\nPHYSICAL ACTIVITIES\n : Sitting for extended periods of time. Occasional lifting of 25lbs or less.\nMINIMUM QUALIFICATIONS: \n Education/Certifications: One year related experience may be substituted for one year of education, if degree is required.\nEXPERIENCE: \nFull knowledge and understanding of PC computer software and hardware Installation Ability to operate standard computers and peripheral equipment; use analytical skills to diagnose and troubleshoot components such as hardware, software, networking, and applications; perform assigned tasks quickly and accurately; follow oral and written directions; use telephone; write or use a keyboard to communicate through written means; establish and maintain effective working relationships with managers, supervisors, and fellow employees.\nAny combination of education and/or experience that has provided the knowledge, skills, and abilities necessary for the position. Combination includes, but is not limited to graduation from an accredited college or university with an Associate’s degree in Information Technology, Computer Science or related field and at least 1 year related experience as a Technical Support or PC Technician.\nMust have an Active DoD Security Clearance\nJob Type: Full-time\nSalary: $46,945.00 /year\nRequired education:\nAssociate\nRequired experience:\nPC hardware and support: 2 years\nRequired licenses or certifications:\nActive DoD Security Clearance\nA+Ce cert.or obtain an equivalent cert.", 
        "location": "Omaha, NE", 
        "date": "2017-04-10 23:17:16.867262", 
        "type": " Full-time"
    }, 
    "60": {
        "salary": 0, 
        "title": "Information Technology Specialist", 
        "url": "/company/First-Community-Bank/jobs/Information-Technology-Specialist-ed539b136f323064?fccid=5c184a946b7a3505", 
        "company": "First Community Bank-Harbor Springs", 
        "summary": "The IT Support position is the first point of contact for First Community Bank staff seeking technical assistance for banking technology issues. Responsible for configuring and supporting computer related hardware and software to insure proper function of PC’s, thin clients, Internet Banking, Telephone Banking and other installed programs. Provide technical assistance for both local and remote users.\nThe ideal applicant would have an associates degree in computer systems or equivalent; CIS hands-on experience or equivalent in educational background. Experience troubleshooting computer, printer, and server issues. Computer programming and problem solving skills a plus.\nThis position requires a friendly presence and helpful attitude; good interpersonal skills and ability to work well with others. Ability to provide technical support over the phone; good phone skills, and professional demeanor are strongly desired. Good problem solving skills; ability to visualize a problem or situation and think abstractly to solve it. Ability to handle constantly changing work-flow; remain productive during slow times, be able to prioritize and multitask effectively during busy times, exercise patience and professionalism during stressful situations. Ability to work responsibly with or without direct supervision. Working knowledge of common operating systems and software applications. First Community Bank is an equal opportunity employer.\nJob Type: Full-time\nRequired education:\nAssociate", 
        "location": "Harbor Springs, MI", 
        "date": "2017-04-18 23:18:57.239543", 
        "type": " Full-time"
    }, 
    "61": {
        "salary": 0, 
        "title": "IT Assistant", 
        "url": "/company/Millbrook-School/jobs/IT-Assistant-d9b2e5a8eb2bcbf2?fccid=0b638113a67a98bf", 
        "company": "Millbrook School", 
        "summary": "Millbrook School\nIT Assistant\nSummary Position Description:\nReporting to the IT Director the IT Assistant provides help desk support and assists with school wide hardware, software, and network issues for employees and students. Also provides general office support to the IT Department.\nResponsibilities:\nHelp Desk Support\nRespond promptly and courteously to all call coming in to the Help Desk.\nProvide accurate technical assistance and resolve issues promptly.\nRefer any technical issues that cannot be resolved promptly to the It Director.\nLog calls and resolutions as directed and maintain accurate records of Help Desk activity.\nHardware\nAssist the IT Director in ordering, installing, updating, and repairing hardware.\nAssist with the Hardware Inventory process and maintain the inventory records.\nSoftware\nAssist the IT Director is upgrading software.\nMaintain technical expertise in all software used by the school.\nAssist the IT Director in training users on software.\nKeep current on safety and security issues affecting the software used by the school.\nNetwork\nAssist the IT Director is managing the network.\nMaintain and keep email users and groups current and accurate.\nProvides general office support.\nAnswers phones.\nGreets visitors.\nPrepares correspondence and reports.\nOrders supplies.\nMaintains office files.\nOther duties as assigned.\nQualifications \n: \nTechnical expertise on both PC and Apple products\nClear and effective oral and written communications with employees and students\nAble to multi-task and work with constant disruptions\nStrong organizational skills\nAble to maintain confidentiality\nKeen attention to detail\nPatience and a sense of humor Physical Requirements:\nRegularly required to:\n*\nSit, walk, kneel, bend, and stand\nTalk and hear both in person and by telephone\nUse hands repetitively to finger, handle, feel, or operate standard office equipment\nReach with hands and arms\nLift up to 50 pounds\nClose vision, distance vision, and ability to adjust focus\nWorking Conditions:\nTypical office conditions\nLikely to spend long periods of time sitting in front of a computer screen\nUnavoidable exposure to repetitive motion\nBursts of heavy student traffic, congestion, and teenage exuberance throughout the day\nCompensation:\nThis full-time, hourly position is scheduled to work approximately 40 hours per week year round. The starting rate of pay for this position will be based on experience.\nApplication Procedure:\nInterested candidates should submit a cover letter, resume, and completed application form (found on the school’s web site) to Virginia Connolly at:\n131 Millbrook School Road, Millbrook, NY 12545\n845-677-0339 (fax)\nJob Type: Full-time", 
        "location": "Millbrook, NY", 
        "date": "2017-04-20 23:19:02.304977", 
        "type": " Full-time"
    }, 
    "62": {
        "salary": 0, 
        "title": "IT Help Desk Support", 
        "url": "/company/Standard-Furniture/jobs/IT-Help-Desk-Support-438d21155588e64f?fccid=6668565b285d7a24", 
        "company": "STANDARD FURNITURE", 
        "summary": "Local candidates preferred as relocation expenses are not currently expected to be given. Any out-of-state candidates applying, please be sure to outline your experience and expectations of relocation to be considered.\nSubmit your cover letter and/or resume outlining your experience along with any salary or benefits requirements desired.\nOur company offers an outstanding benefits package that includes major medical, dental, vision, life and LTD insurance as well as vacation, holiday and 401K.\nThis position is primarily Mon-Fri 8:00 – 4:30; extended hours may be required as project loads and deadlines arise.\nPlease Note: \n \n This position is \nheavier on the programming/software troubleshooting\n and help desk support and \nnot utilized\n \nas much\n in the field of hardware issues, PC support, installation, networks, etc. \nWe are seeking to fill this position with programming/software \nsupport\n experience - this is not a\n \n_Programming_\n \nposition.\n________________________________________________________________\nGeneral Purpose\nProvide user support and customer service on company-supported computer applications and platforms. Troubleshoot problems, resolve problems, advise on the appropriate action, and escalate to management as needed.\nMain Job Tasks and Responsibilities\nrespond to requests for technical assistance in person, via phone, electronically\ndiagnose and resolve technical hardware and software issues\nAS400\nWindows SQL\nresearch questions using available information resources\nadvise user on appropriate action\nfollow standard help desk procedures\nlog all help desk interactions\nadminister help desk software\nredirect problems to correct resource\nidentify and escalate situations requiring urgent attention\ntrack and route problems and requests and document resolutions\nprepare activity reports\ninform management of recurring problems\nstay current with system information, changes and updates\nEducation and Experience\nBachelor’s degree in Computer Science or equivalent, preferred\nAt least 2 years' experience in IT Support / Help Desk / troubleshooting role\nworking knowledge of fundamental operations of relevant software, hardware and other equipment\nknowledge of relevant call tracking applications\nknowledge and experience of customer service practices\nrelated experience and training in troubleshooting and providing help desk support\nweb development experience strongly preferred\nKey Competencies\noral and written communication skills\nlearning skills\ncustomer service orientation as this will be the 'go to' position point of contact\nproblem analysis\nproblem-solving with a sense of urgency to 'fix it'\nadaptability\nteam interaction\nplanning and organizing\nattention to detail\nstress tolerance\nJob Type: Full-time\nJob Location:\nMobile, AL\nRequired education:\nAssociate\nRequired experience:\nIT Support: 2 years\nAs400: 1 year", 
        "location": "Mobile, AL", 
        "date": "2017-04-19 23:19:06.549267", 
        "type": " Full-time"
    }, 
    "63": {
        "salary": 0, 
        "title": "IT Support & Help Desk", 
        "url": "/company/Western-Products/jobs/IT-Support-Help-Desk-19a2011c641c1c30?fccid=b8d7409dd52b513d", 
        "company": "Western Products", 
        "summary": "The Western Products & Affiliates IT Department is looking for the right person to join our growing team. We are a family of companies in diverse industries, including property management, home improvement & manufacturing. This new IT position is an excellent opportunity for MIS graduates who enjoy the accounting side of the business.\nYour key responsibilities will include\n :\nIT Technician\nHelp Desk – configure & troubleshoot workstations, printing, user software & phones\nProvide user maintenance for onboarding & offboarding employees\nAccommodate users with telephone system & building security changes\nTelephone call tracking software & reporting\nConduct Microsoft Outlook user review & manager follow-up\nCreate ERP Reports with reports writer software – SSRS, Jasper, SQL\nProvide IT training/orientation for new employees\nAccounting Support\nReport & analyze job cost commission\nAssist accounting department with projects & ERP reporting\nYou'll love this job if: \nYou're a team player who likes to work in a diverse, fast-paced environment\nYou're attentive to detail\nYou’re organized & complete work accurately, professionally & on-time\nYou're able to work under pressure & meet deadlines\nYou enjoy learning new things & sharing new skills with others\nYou embrace multi-tasking & can handle multiple assignments simultaneously\nDesired Skills & Experience: \nDegree or related course work in MIS and/or Accounting\nShow initiative to investigate & problem solve\nExcellent communication skills & ability to work with a variety of departments\nUnderstanding of Windows configuration\nWorking knowledge of MS operating system & Office Suite\nWestern Products & Affiliates\nWestern Products westernproducts.com\nReechcraft reechcraft.com\nAll New Gutter Service allnewgutter.com\nCityscapes Development cityscapesdevelopment.com\nEastside Machine eastsidemachine.com\nAnd more!\nCandidates must submit the following: \nResume\nCover letter including availability & salary requirements\nApplication which can be found at:\nhttp://www.westernproducts.com/our-difference/employment/\nIf you have questions, please feel free to contract Human Resources at careers @westernproducts.com or mail to Western Products, Attn HR, PO Box 2426, Fargo, ND 58108\nJob Type: Full-time", 
        "location": "Fargo, ND", 
        "date": "2017-04-21 23:19:07.643831", 
        "type": " Full-time"
    }, 
    "64": {
        "salary": 0, 
        "title": "Helpdesk Technology Specialist", 
        "url": "/company/TechGen-Consulting,-Inc./jobs/Helpdesk-Technology-Specialist-686c9eb564c8e906?fccid=5c62d89a6297fda3", 
        "company": "TechGen Consulting Inc", 
        "summary": "We're looking for someone who loves working with technology in a team environment!\nTechGen Consulting, Inc\n . is a dynamic company specializing in providing a wide variety of IT support services for small to medium sized businesses in the Twin Cities area. Delivering exceptional service and solving complex problems for our clients is who we are. We are passionate about technology; our team members are knowledgeable, attentive, and most importantly, friendly. \nWe love what we do and we enjoy working together to accomplish our goals. If this sounds like you, we have an opportunity for you!\nWe are growing and are looking for a talented \nHelpdesk Technology\n \nSpecialist\n to join our team. Our technical team is responsible for supporting a wide range of systems and technologies with a continuous focus on learning and collaboration. The environment at the office is fun and fast paced, and we enjoy great relationships with our clients.\nWhat You’ll Do\nResolve inbound hardware, software, or network technical support requests via email, phone, and web\nDocument all customer interaction with high attention to detail and accuracy in the ConnectWise system\nRemotely manage client systems using tools such as LabTech, ScreenConnect, and LogMeIn\nRecognize and escalate more difficult problems\nCollaborate with other team members to solve IT problems\nYou Understand and Have Experience With\nMicrosoft Office 365 (Hosted Exchange, File Storage, Sharepoint)\nSonicWall and WatchGuard Firewalls\nTrend Micro / Symantec / Sophos Security Solutions\nVPN Clients\nActive Directory\nMicrosoft Windows, Windows Server\nApple OS, Android, iOS\nOur Ideal Candidate Profile\nAssociate’s degree in Information Technology, Computer Networking or related field\n1+ years providing technical support\nCompTIA Certification (i.e., A+, Network+, Security+, Server+, etc.)\nExperience with ConnectWise, LabTech, ScreenConnect, LogMeIn\nTenacious desire to solve complex technical problems\nExcellent written, verbal, and interpersonal communication skills\nExcellent time management skills; ability to multi-task and prioritize assignments\nDesire to learn new technologies\nPositive, friendly attitude\nWhat You Can Expect\nCompetitive Pay\nCompany 401k Match\nHealth + Dental + Vision Coverage\nPaid Time Off\nCertification Test Fee Reimbursement\nNo Required On-call Rotation\nPlease do not apply if you are not able to commute to the Minneapolis/St. Paul Area. This position requires daily attendance at our office in Minneapolis. Out of town candidates are not being considered at this time.\nJob Type: Full-time\nJob Location:\nMinneapolis, MN\nRequired education:\nAssociate\nRequired experience:\nPrevious IT Support / Helpdesk: 1 year", 
        "location": "['Minneapolis, MN 55413 ', '(Northeast Park area)']", 
        "date": "2017-04-17 23:19:09.301782", 
        "type": " Full-time"
    }, 
    "65": {
        "salary": 60000.0, 
        "title": "Network Administrator", 
        "url": "/company/Complete-Network-Management-Inc./jobs/Network-Administrator-1b1216af2c17676a?fccid=77d182e05b179fe9", 
        "company": "Complete Network Management Inc", 
        "summary": "Job Description\nWe are searching for a highly motivated individual looking for a system administrator /network engineer position in a fast paced, challenging environment with a rapidly growing solutions provider. This is an excellent opportunity with an above average compensation package for the right person who can be a multi-talented, dynamic, hard charging professional.\nOur company is headquartered in Houma, Louisiana one of the top 10 happiest cities to live in the US! We are looking for only the best network engineers and/or system administrators with proven track records and abilities who have the desire to work with other highly skilled, professional and motivated individuals in a team environment. If you aspire to work for a company where you can truly make a positive impact and be part of a growing organization, CNM welcomes your interest.\nRequired Skills: \nMust have a passion for the latest in technology\nExperience in LAN/WAN network design and support\nBachelor’s degree preferred but not required.\nMicrosoft, CISCO, SonicWall and other advanced Training and Certifications preferred\nExperience with most recent versions and past versions of Microsoft Server\nExperience with Active Directory and Group Policy\nExperience with Microsoft Exchange\nExperience with server virtualization including MS Hyper-V or VMware\nGood Working Knowledge of TCP/IP, routers, and switches\nExperience with ITIL Standards\nPossess excellent written and oral communications skills\nWell organized with excellent documentation skills\nProfessional, positive and pleasant disposition with clients and coworkers\nDuties and Responsibilities\n :\nPerform role of technical leader as assigned for customer projects\nInvestigate applications of new technologies and networking techniques\nOversee and assist in creating complete documentations including White Papers, Scopes of Work, and Project Designs and Proposals\nPerform repair and troubleshooting for customer service orders\nMaintain a high level of technical expertise\nProvide technical support and assistance to CNM team members\nCooperate with company leaders to meet corporate growth and financial goals.\nWho We Are\nCNM is a Microsoft Partner company as well as the leading Dell Reseller in Louisiana. We are led by vision, values, and integrity. Our business is built around serving our customers' needs and keeping their networks reliable, secure and innovative. CNM provides proactive desktop, LAN, and WAN support. We provide our clients with Business Intelligence, Disaster Recovery and Business Continuity Consulting and Project Management. Our focus is on small to medium sized companies.\nJob Type: Full-time\nSalary: $40,000.00 to $80,000.00 /year", 
        "location": "Houma, LA", 
        "date": "2017-04-19 23:19:09.587046", 
        "type": " Full-time"
    }, 
    "66": {
        "salary": 70000.0, 
        "title": "Desktop Support Specialist (497626)", 
        "url": "/company/NewSouth-Technologies,-Inc./jobs/Desktop-Support-Specialist-5bf0d07d247cc048?fccid=e7b398eeb89893db", 
        "company": "NewSouth Technologies Inc", 
        "summary": "Desktop Support Specialist (497626)\n12-month contract opportunity with the State of North Carolina\nPosition located in Raleigh, NC\n$30 - $40 / hour\nNCDOT - Customer Desktop Support\n - Uses technical expertise and understanding of business needs to evaluate assigned IT incident and problem service desk tickets to appropriately prioritize and evaluate business impact. Proactively promotes positive customer relationships and mentors others to ensure client satisfaction and organizational success.\nRole Responsibilities and Required Skills: \nTakes ownership of customer problems and works with a sense of urgency to resolve incidents and problems.\nProvides updates on work progress to Customer Support Specialists and the Service Desk using call tracking system.\nInstalls and images new computers and loads appropriate software for customers.\nDeploys new business applications as needed.\nInstalls local and network printers and other peripherals and configuration of same.\nResponsible for user data and migration of profiles as computers are replaced.\nWorks with Data Center Operations with user file server data storage, network reservations, data restores, various account creations and modifications (AD, email, NCID, CITRIX, etc.).\nWorks with application development teams to identify application issues at the customer level and provide technical detail in order for development teams to accurately identify problems within applications.\nWorks with network infrastructure teams to identify network issues at the customer level and provide significant technical detail to assist in network hardware resolutions.\nLeads team efforts and assesses and integrates the skills and strengths of individuals for project and organizational success.\nHas significant technical knowledge and serves as a resource for other technicians to help solve complex problems.\nSkilled in different types of computer hardware, software, peripherals and components, networking protocols and communications.\nNewSouth Technologies\n , Inc is an information technology services consulting company founded in 1998, specializing in helping its clients develop and maintain state-of-the-art information systems and business processes.\nJob Type: Contract\nSalary: $30.00 to $40.00 /hour\nRequired experience:\nInstalling/configuring local & network printers/peripherals: 7 years\nmigrating data and user profiles: 7 years\nInstalling and imaging new computers: 7 years\ndocumenting process/procedures for technical field support: 7 years", 
        "location": "Raleigh, NC", 
        "date": "2017-04-21 23:19:20.429220", 
        "type": " Contract"
    }, 
    "67": {
        "salary": 60000.0, 
        "title": "Network Administrator", 
        "url": "/company/Complete-Network-Management-Inc./jobs/Network-Administrator-1b1216af2c17676a?fccid=77d182e05b179fe9", 
        "company": "Complete Network Management Inc", 
        "summary": "Job Description\nWe are searching for a highly motivated individual looking for a system administrator /network engineer position in a fast paced, challenging environment with a rapidly growing solutions provider. This is an excellent opportunity with an above average compensation package for the right person who can be a multi-talented, dynamic, hard charging professional.\nOur company is headquartered in Houma, Louisiana one of the top 10 happiest cities to live in the US! We are looking for only the best network engineers and/or system administrators with proven track records and abilities who have the desire to work with other highly skilled, professional and motivated individuals in a team environment. If you aspire to work for a company where you can truly make a positive impact and be part of a growing organization, CNM welcomes your interest.\nRequired Skills: \nMust have a passion for the latest in technology\nExperience in LAN/WAN network design and support\nBachelor’s degree preferred but not required.\nMicrosoft, CISCO, SonicWall and other advanced Training and Certifications preferred\nExperience with most recent versions and past versions of Microsoft Server\nExperience with Active Directory and Group Policy\nExperience with Microsoft Exchange\nExperience with server virtualization including MS Hyper-V or VMware\nGood Working Knowledge of TCP/IP, routers, and switches\nExperience with ITIL Standards\nPossess excellent written and oral communications skills\nWell organized with excellent documentation skills\nProfessional, positive and pleasant disposition with clients and coworkers\nDuties and Responsibilities\n :\nPerform role of technical leader as assigned for customer projects\nInvestigate applications of new technologies and networking techniques\nOversee and assist in creating complete documentations including White Papers, Scopes of Work, and Project Designs and Proposals\nPerform repair and troubleshooting for customer service orders\nMaintain a high level of technical expertise\nProvide technical support and assistance to CNM team members\nCooperate with company leaders to meet corporate growth and financial goals.\nWho We Are\nCNM is a Microsoft Partner company as well as the leading Dell Reseller in Louisiana. We are led by vision, values, and integrity. Our business is built around serving our customers' needs and keeping their networks reliable, secure and innovative. CNM provides proactive desktop, LAN, and WAN support. We provide our clients with Business Intelligence, Disaster Recovery and Business Continuity Consulting and Project Management. Our focus is on small to medium sized companies.\nJob Type: Full-time\nSalary: $40,000.00 to $80,000.00 /year", 
        "location": "Houma, LA", 
        "date": "2017-04-19 23:19:22.895011", 
        "type": " Full-time"
    }, 
    "68": {
        "salary": 0, 
        "title": "Information Technology Specialist", 
        "url": "/company/Vancouver-Radiologists,-P.C./jobs/Information-Technology-Specialist-7b72f0203a30adee?fccid=117e5335c5fb390e", 
        "company": "Vancouver Radiologists PC", 
        "summary": "Vancouver Radiologists, PC has an excellent career opportunity for an entry level Information Technology Specialist. The IT Specialist responsibilities includes support of Active Directory, Exchange, Windows servers and clients to ensure a highly secure, reliable and available infrastructure.\nQualified candidates must have an Associate’s Degree in Information Technology or equivalent directly related work experience and a minimum of 1 year experience managing a MS Active Directory network infrastructure. MCSA, MCSE, MCIPT, or CCNA certification preferred.\nThis full time position offers competitive salary/benefits. Interested and qualified candidates please send resume and salary requirements to Human Resources, Vancouver Radiologists, 4201 NE 66th Avenue, Suite 104, Vancouver WA 98661, or send to our HR email listed below.\nJob Type: Full-time", 
        "location": "Vancouver, WA 98662", 
        "date": "2017-04-06 23:19:23.218967", 
        "type": " Full-time"
    }, 
    "69": {
        "salary": 0, 
        "title": "Helpdesk Technology Specialist", 
        "url": "/company/TechGen-Consulting,-Inc./jobs/Helpdesk-Technology-Specialist-686c9eb564c8e906?fccid=5c62d89a6297fda3", 
        "company": "TechGen Consulting Inc", 
        "summary": "We're looking for someone who loves working with technology in a team environment!\nTechGen Consulting, Inc\n . is a dynamic company specializing in providing a wide variety of IT support services for small to medium sized businesses in the Twin Cities area. Delivering exceptional service and solving complex problems for our clients is who we are. We are passionate about technology; our team members are knowledgeable, attentive, and most importantly, friendly. \nWe love what we do and we enjoy working together to accomplish our goals. If this sounds like you, we have an opportunity for you!\nWe are growing and are looking for a talented \nHelpdesk Technology\n \nSpecialist\n to join our team. Our technical team is responsible for supporting a wide range of systems and technologies with a continuous focus on learning and collaboration. The environment at the office is fun and fast paced, and we enjoy great relationships with our clients.\nWhat You’ll Do\nResolve inbound hardware, software, or network technical support requests via email, phone, and web\nDocument all customer interaction with high attention to detail and accuracy in the ConnectWise system\nRemotely manage client systems using tools such as LabTech, ScreenConnect, and LogMeIn\nRecognize and escalate more difficult problems\nCollaborate with other team members to solve IT problems\nYou Understand and Have Experience With\nMicrosoft Office 365 (Hosted Exchange, File Storage, Sharepoint)\nSonicWall and WatchGuard Firewalls\nTrend Micro / Symantec / Sophos Security Solutions\nVPN Clients\nActive Directory\nMicrosoft Windows, Windows Server\nApple OS, Android, iOS\nOur Ideal Candidate Profile\nAssociate’s degree in Information Technology, Computer Networking or related field\n1+ years providing technical support\nCompTIA Certification (i.e., A+, Network+, Security+, Server+, etc.)\nExperience with ConnectWise, LabTech, ScreenConnect, LogMeIn\nTenacious desire to solve complex technical problems\nExcellent written, verbal, and interpersonal communication skills\nExcellent time management skills; ability to multi-task and prioritize assignments\nDesire to learn new technologies\nPositive, friendly attitude\nWhat You Can Expect\nCompetitive Pay\nCompany 401k Match\nHealth + Dental + Vision Coverage\nPaid Time Off\nCertification Test Fee Reimbursement\nNo Required On-call Rotation\nPlease do not apply if you are not able to commute to the Minneapolis/St. Paul Area. This position requires daily attendance at our office in Minneapolis. Out of town candidates are not being considered at this time.\nJob Type: Full-time\nJob Location:\nMinneapolis, MN\nRequired education:\nAssociate\nRequired experience:\nPrevious IT Support / Helpdesk: 1 year", 
        "location": "['Minneapolis, MN 55413 ', '(Northeast Park area)']", 
        "date": "2017-04-17 23:19:24.130691", 
        "type": " Full-time"
    }, 
    "2": {
        "salary": 0, 
        "title": "Helpdesk / Systems Support Specialist", 
        "url": "/company/The-Jewish-Museum/jobs/Helpdesk-27b5beb65963914f?fccid=48692a4895eca541", 
        "company": "The Jewish Museum", 
        "summary": "The Position: \nThe Helpdesk / Systems Support Specialist will play a key role in the Museum’s IT Department. You will provide maintenance of the computer desktop environment by analyzing requirements, resolving problems, installing hardware and software solutions, and supporting the internal IT Helpdesk. Working with staff and vendors, you will support the Museum’s systems, performing upgrades and implementations. As a primary IT representative within the Museum, you will interface with different constituents to provide efficient and high quality IT assistance.\nResponsibilities Include: \nMonitor and respond quickly and effectively to requests received through the IT helpdesk tracking software\nModify configurations, utilities, software default settings, etc. for the local workstations; perform timely hardware, software maintenance and upgrades as required\nAssist with onboarding of new users and work independently to research, install, test and configure new workstations, peripheral equipment and software\nMaintain inventory of all equipment, software and software licenses and document internal procedures\nUse good judgment to determine which issues to report for escalation\nTrain staff in Desktop software use and best practices\nPerform systems upgrades and maintenance, including Retail Pro POS, ACME POS, Great Plains Financial, Salesforce, TMS (Gallery Systems), and Aleph Library cataloging\nManage all printer and copier hardware and liaise with vendors\nAssist with other Museum IT projects as needed\nRequirements: \nBachelor’s Degree in Information Systems, Business, Communications or related Field; MCP, A+ certification, or Microsoft Specialist training preferred\nA minimum of 2 years relevant technical experience\nA strong aptitude in both Windows and Apple (MAC) OS repairs, spy ware and virus removal, hardware, upgrades and troubleshooting; including an understanding of the following:\nWindows XP/7, MAC OS X\nMS Office 2010 products (Excel, Outlook, Word, PowerPoint and Access),\nNetworking (TCP/IP, DNS, DHCP, VPN and wireless configuration)\nIPhone, iPad, Android devices\nPC and MAC imaging software\nJAMFs MAC management environment\nAdobe creative suite\nExceptional verbal and written communication skills and an ability to think creatively to solve problems\nOutstanding interpersonal skills and the ability to train others in computer systems and software\nStrong planning and organizational skills with a high level attention to detail\nSchedule & Physical Requirements: \nAbility to work a flexible schedule – candidate will work Sundays and will have Wednesdays off during the week; Candidate will be expected to work holidays when the Museum is open but the offices are closed\nAbility to transport and carry equipment up to 50 lbs\nSend Resume with Cover Letter To: \nDirector of Human Resources\nThe Jewish Museum\n1109 Fifth Avenue\nNew York, NY 10128\nEmail: \nSee link in posting\nFax: 212.423.3232\nThe Jewish Museum is an Equal Opportunity Employer that is committed to building a culturally diverse staff and encourages applications from diverse candidates.\nJob Type: Full-time", 
        "location": "['New York, NY 10128 ', '(Upper East Side area)']", 
        "date": "2017-04-21 23:14:44.178732", 
        "type": " Full-time"
    }, 
    "6": {
        "salary": 57769.0, 
        "title": "Information Technology Specialist", 
        "url": "/company/FRANKLIN-TOWNSHIP/jobs/Information-Technology-Specialist-1e5cafce93d3cd6a?fccid=2ecb9fd02d327c0c", 
        "company": "Franklin Township", 
        "summary": "Department: \n Information Technology\nUnion\n \n: \n AFSCME 2859, White Collar Clerical\nThe following statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified\nGENERAL PURPOSE\nThe position is responsible for the maintenance and support of computer service requirements for the Township’s computer network, in addition to technical responsibilities of hardware and software applications including personal computers, trunked radio system, and township cable station.\nSUPERVISION RECEIVED\nWorks under the direct supervision of the Director of Information Technology.\nSUPERVISION EXERCISED\nNone.\nDUTIES AND RESPONSIBILITIES\nPerform daily troubleshooting and resolution of software/hardware issues. Assist staff in the identification and resolution of technical system software and/or hardware problems, and prepare appropriate reports.\nSet-up and install hardware equipment such as PC’s, monitors, printers, scanners, etc. Install and configure new PC software/hardware.\nPerform day-to-day operation and maintenance of the LAN/WAN system, including maintaining regular back-ups of all system data.\nImplement standard operating procedures for the day-to-day operation of the LAN/WAN system.\nMaintains LAN/WAN security and promptly reports any security breaches through the established chain-of-command.\nIdentifies and troubleshoots the resolution of connectivity and/or operational issues with all Township agencies connected to the LAN/WAN.\nCoordinates the training of departmental staff in the LAN/WAN system’s operation and use of standard software, including the preparation of training manuals and/or instructional guidelines and procedures.\nAssisting staff members in the development of databases, spreadsheets, documents, and/or report creation.\nTechnical assistance and maintenance of cable station hardware and software applications.\nMust be available for “after-hours” system emergencies. Assumes other duties and responsibilities as required.\nOther duties as assigned.\nJOB REQUIREMENTS\nMust have knowledge of Local/Wide Area Network (LAN/WAN) technology and topology including, but not limited to, Microsoft Windows networking, Ethernet connectivity, and TCP/IP protocols. Must have ability to learn and administer existing network and desktop computer and software systems.\nRequires experience installing, configuring, and troubleshooting Microsoft Windows 7/8/10, Microsoft Windows Server 2008/2012, Microsoft Office, and Intel-based PC hardware in a networked environment.\nRequires basic knowledge of the theory and application of network management, network operating systems, network topology and connectivity, and the ability to troubleshoot software and hardware problems.\nMust have/obtain, and maintain knowledge of the current practices in the areas of local and wide-area networking, business applications, Internet/Intranet operation, data communications, and telecommunications.\nMust have demonstrated ability to manage projects successfully; proven interpersonal skills; and excellent analytical and communication skills.\nExperience with UNIX systems preferred.\nMust possess valid N.J. driver’s license.\nDESIRED MINIMUM QUALIFICATIONS\nEducation:\nAssociates or Bachelors Degree in Computer Science, Management Information Systems, or a closely related field (or equivalent specific training).\nExperience:\nTwo (2) years of professional level experience in systems analysis and personal computer or mini-computer hardware and software operation and maintenance.\nMCP/MCSE training and/or certification and additional computer skills (e.g., database, GIS, HTML) and/or experience in a municipal information technology department a plus.\nPHYSICAL DEMANDS\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\nWhile performing the duties of this job the employee is frequently required to sit and talk or hear. The employee is occasionally required to walk; use hands to operate, handle, or feel objects, tools, or controls; and reach with hands and arms. The employee is occasionally required crawl and/or work in cramped spaces (e.g., under desks) during the installation or troubleshooting of PC's, printers, and associated equipment.\nThe employee must occasionally lift and/or move up to 75 pounds. Specific vision abilities required by this job include close vision and the ability to adjust focus.\nWORK ENVIRONMENT\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nThe noise level in the work environment is usually moderately quiet.\nTHE TOWNSHIP OF FRANKLIN DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, NATIONAL ORIGIN, RELIGION, SEX, SEXUAL PREFERENCE, AGE OR HANDICAP.\nTHE TOWNSHIP OF FRANKLIN IS A DRUG FREE WORK PLACE.\nEffective September 1, 2011, all employees of NJ State, County and Local government must reside in the State of New Jersey unless exempted under law.\nJob Type: Full-time\nSalary: $46,215.20 to $69,322.80 /year\nRequired education:\nAssociate\nRequired experience:\nsystem analysis and PC hardware/software: 2 years\nRequired license or certification:\nvalid NJ driver's license", 
        "location": "Somerset, NJ 08873", 
        "date": "2017-04-23 23:14:54.587690", 
        "type": " Full-time"
    }, 
    "99": {
        "salary": 0, 
        "title": "IT Service Desk Specialist (Tier 1)", 
        "url": "/company/Arraya-Solutions/jobs/IT-Service-Desk-Specialist-9a49454b44b22bde?fccid=8e131eee5da0bed7", 
        "company": "Arraya Solutions", 
        "summary": "Arraya Solutions, a leading Mid-Atlantic technology consulting firm and managed services provider located just outside Philadelphia is looking for a \nService Desk Specialist\n to join our team!\nWe are a culture that embraces change, values family and we are actively involved with the community. Our team consists of people with positive attitudes who have an interest in growing their knowledge around technology and leaders that are heavily involved in the day to day activities.\nIn this role, you will be responsible for supporting and growing our managed service offerings, which include cloud-based backup, and infrastructure monitoring and problem remediation. This individual will be asked to maintain our managed services infrastructure and field service calls from customers regarding requests and issues. Additionally, this position will be expected to monitor and service our internal infrastructure and staff.\nResponsibilities: \nField Support Call\nHardware and Software incident remediation\nAccount provisioning/administration\nOn-site and remote technical support\nScheduling updates\nEmployee account creation and management\nLaptop provisioning/repair\nNetwork print services\nManaging multiple client ticket systems\nMonitoring of client networks/infrastructure and following a notification and escalation process\nDesired Attributes: \nStrong customer service skills\nExperience with \nWindows Operating Systems\n , with an understanding of security permissions for Active Directory.\nExperience with Microsoft’s System Center Configuration Manager (SCCM)\nExperience with Microsoft Office 365\nExperience with monitoring solutions, such as \nMicrosoft System Center Operations Manager\n , Nagios XI.\nFamiliarity with SharePoint, Exchange and SQL\nExperience supporting laptop/desktop workstations and troubleshooting problems related to end-user applications.\nMicrosoft certifications are a plus\nPosition Type and Expected Hours of Work: \nThis is a full-time position, (40) hours/week. Please note there are two shifts available for the Service Desk. Days and hours of work for the \nsecond shift is between 3:00pm – 11:30pm\n , \nSaturday through Wednesday\n and \nthird shift is between 11:00pm – 7:30am, Saturday through Wednesday\n .\nA possibility of off-hours support work.\nJob Type: Full-time", 
        "location": "Plymouth Meeting, PA 19462", 
        "date": "2017-04-11 23:20:45.531004", 
        "type": " Full-time"
    }, 
    "98": {
        "salary": 43000.0, 
        "title": "Desktop Support Technician", 
        "url": "/company/krg-technologies-Inc./jobs/Desktop-Support-Technician-467a400433ac78da?fccid=85e326bd50e78c08", 
        "company": "KRG Technologeis  HCL America", 
        "summary": "Job Title : \nDeskside Engineer\nLocation : \nQuincy, IL\nDuration : \n6 - 12 months\n .\nJob Description: \nMinimum of 2 years’ technical experience in providing Field Support which includes:\nPC hardware repair (Dell/HP)\nWindows system support\nOS X Support (10% of techs should have this skill)\nSoftware installation/troubleshooting\nPerforming Tech Refresh\nMobile device support (iOS/iPhone/iPads) – excluding warranty hardware repair\nNetworking\nAsset tracking\nStock room management\nBasic support in Video conferencing equipment\nGeneral Core Competencies to be considered when hiring:\nCustomer focused – Customer is #1 Attitude\nPersonal accountability for results\nDetail oriented\nStrong analytical and troubleshooting skills\nHigh integrity\nA minimum of two confirmed references is preferred.\nThe following educational/technical certifications are preferred:\nTechnical degree (i.e. Associates, Bachelors, etc.) or equivalent in years of experience in Field Support\nDell/HP hardware certifications\nTechnical certifications (e.g. A+, MCDST, MCP, MCSA, etc.).\nCandidate has a professional appearance (i.e. grooming, clothing, etc.).\nRoles and Responsibilities: \nDesk Side Engineer\nAccurately test, identify, repair, resolve and document end user technical issues for basic desktop/laptop/workstation support, basic connectivity support (wired and wireless), PDAs, BlackBerrys and basic printer support.\nAnthem owned equipment\nApple support – Smart hands and feet, also coordination w Anthem Apple team.\nQuestions about nonstandard equipment should be brought to HCL management’s attention\nTroubleshoot and resolve software issues. Ability to install, configure, reconfigure or reinstall software including remote support\nUpdate the tickets in ITSM & work on tickets within the defined service levels\nAppropriate notes required\nHOLD reason notes required\nMissed schedule date notes required\nTicket transfer reason notes required\nIdentify tickets that should be project and provide info to the Project Management team\nUpdate TAMIT (SNOW) Asset Database for each hardware interaction.\nWhile at an associates desk, check other assets at the desk and update asset database\n100% compliance required\nAsset salvage runs scheduled by the Stockroom Tech/FST.\nReimaging computers/hard drives in accordance with customer standards\nIMACD function including installation and decommission.\nBacking up and restoring settings and associated systems administration activities\nDrive end to end ownership of issues to provide a resolution for all requests and incidents.\nCategorize and prioritize end user support requests and service requests by utilizing ticketing system to track tickets and provide up-to-date status and information.\nMove equipment associated with escalated help desk incidents and service requests\nPerform asset inventory activities to maintain accuracy.\nTrains and orients staff on use of hardware and software.\nRecommends and / or performs upgrades on systems to ensure longevity.\nOther tasks as assigned by Site Lead/Regional Lead.\nWork w the team/partner w HCL SD/ATS/FSS teams to improve service.\nMaintain a clean work environment.\nJob Type: Contract\nSalary: $20.00 to $23.00 /hour\nRequired experience:\nDesktop Support: 3 years", 
        "location": "Quincy, IL", 
        "date": "2017-04-12 23:20:35.722793", 
        "type": " Contract"
    }, 
    "91": {
        "salary": 0, 
        "title": "ENTRY LEVEL* Network Center Technician – Overland Park, KS (Help Desk/ IT)", 
        "url": "/company/NextGen-Global-Resources-LLC/jobs/Entry-Level-Network-Center-Technician-80a8d627ffe90de9?fccid=80d7dbbe923ac254", 
        "company": "NextGen Global Resources LLC", 
        "summary": "Entry Level Core Network Operations Technicians needed\nIdeal candidates have IT background with help desk experience (use of ticketing system)\nStart date: Early May 2017\nEligibility: \nUS CITIZENS ONLY\nThis role requires24x7x365support so candidates must be able to support flexible hours and schedules to ensure all shifts are covered. Tech background of some sort is preferred.\nDaily tasks:\nRun testing procedures using various tools\nPerform Check In/Check Out process\nAbility to quickly learn new tools and systems\nWillingness to work on any assigned shift\nProficient in using Microsoft office application such as Outlook, Excel, Word\nPerform routine ticket management and escalations to drive problems to final resolution\nTraining will be provided upon hire(previous NOC experience is not required)\nJob Type: Contract\nRequired license or certification:\nUS CITIZEN", 
        "location": "Overland Park, KS", 
        "date": "2017-04-14 23:20:30.559108", 
        "type": " Contract"
    }, 
    "90": {
        "salary": 70000.0, 
        "title": "Network Administrator", 
        "url": "/company/Tesoro/jobs/Network-Administrator-d66bb8704ce9ac25?fccid=ff62654a2c336cb1", 
        "company": "Tesoro", 
        "summary": "There is an immediate need for a Network Administrator. Below are the details of the position:\n1. CCNA\n2. 3-5 years in a small to mid-sized company with hands on experience setting up and configuring routers and switches.\n3. Primary experience with Cisco equipment.\n4. Wireless experience in a managed environment.\n5. ASA firewalls, F5 load balances, mapping, and net management are bonuses.\nThis position is looking to start ASAP.\nSalary: $70,000.00 /year\nRequired experience:\nNetwork Administration: 4 years", 
        "location": "['San Antonio, TX 78259 ', '(Encino Park area)']", 
        "date": "2017-04-20 23:20:23.391432", 
        "type": ""
    }, 
    "93": {
        "salary": 55000.0, 
        "title": "Network Administrator", 
        "url": "/company/iforce-professionals/jobs/Network-Administrator-3986519f6c9cdf47?fccid=ef4ba4863ef5010a", 
        "company": "iforce professionals", 
        "summary": "Essential Duties and Responsibilities\nDesigns, specifies, configures, installs, and maintains network hardware and software.\nDevelops and implements policies and procedures related to network hardware and software acquisition, use, support, security, and backup.\nEstablishes and maintains network users, user environment, directories, and security.\nFollows procedures to identify and validate trouble conditions and takes the appropriate course of action to minimize service interruption.\nPerforms proactive network status checks as part of normal surveillance activities, ensuring optimum performance.\nWorks closely with various engineering groups and network control technicians to develop and implement tools and processes to improve capabilities and assure quality service levels.\nWorks under general supervision with latitude for independent judgment.\nConsults with senior peers on certain projects.\nDisplays moderate skills with high level of proficiency.\nOther duties may be assigned.\nQualifications\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nStrong experience across Server 2008/2012, Active Directory, DNS/DHCP\nStrong experience with Cisco routers and switches in an Enterprise environment\nStrong experience with Cisco Wireless Access Point & Wireless LAN Controller\nStrong experience with VMware\nExperience with EMC Backup and SAN technologies\nExperience with Cisco Unified Communication\nCisco and Microsoft Certifications\nEducation and/or Experience\nBachelor's degree from four-year college or university; or one to two years related experience and/or training; or equivalent combination of education and experience.\nJob Type: Full-time\nSalary: $55,000.00 /year\nRequired education:\nBachelor's\nRequired experience:\nNetwork Administration: 3 years\nTraining: 3 years\nCISCO: 3 years", 
        "location": "West Chester, OH", 
        "date": "2017-04-18 23:20:33.278300", 
        "type": " Full-time"
    }, 
    "92": {
        "salary": 0, 
        "title": "IT Service Desk Specialist (Tier 1)", 
        "url": "/company/Arraya-Solutions/jobs/IT-Service-Desk-Specialist-9a49454b44b22bde?fccid=8e131eee5da0bed7", 
        "company": "Arraya Solutions", 
        "summary": "Arraya Solutions, a leading Mid-Atlantic technology consulting firm and managed services provider located just outside Philadelphia is looking for a \nService Desk Specialist\n to join our team!\nWe are a culture that embraces change, values family and we are actively involved with the community. Our team consists of people with positive attitudes who have an interest in growing their knowledge around technology and leaders that are heavily involved in the day to day activities.\nIn this role, you will be responsible for supporting and growing our managed service offerings, which include cloud-based backup, and infrastructure monitoring and problem remediation. This individual will be asked to maintain our managed services infrastructure and field service calls from customers regarding requests and issues. Additionally, this position will be expected to monitor and service our internal infrastructure and staff.\nResponsibilities: \nField Support Call\nHardware and Software incident remediation\nAccount provisioning/administration\nOn-site and remote technical support\nScheduling updates\nEmployee account creation and management\nLaptop provisioning/repair\nNetwork print services\nManaging multiple client ticket systems\nMonitoring of client networks/infrastructure and following a notification and escalation process\nDesired Attributes: \nStrong customer service skills\nExperience with \nWindows Operating Systems\n , with an understanding of security permissions for Active Directory.\nExperience with Microsoft’s System Center Configuration Manager (SCCM)\nExperience with Microsoft Office 365\nExperience with monitoring solutions, such as \nMicrosoft System Center Operations Manager\n , Nagios XI.\nFamiliarity with SharePoint, Exchange and SQL\nExperience supporting laptop/desktop workstations and troubleshooting problems related to end-user applications.\nMicrosoft certifications are a plus\nPosition Type and Expected Hours of Work: \nThis is a full-time position, (40) hours/week. Please note there are two shifts available for the Service Desk. Days and hours of work for the \nsecond shift is between 3:00pm – 11:30pm\n , \nSaturday through Wednesday\n and \nthird shift is between 11:00pm – 7:30am, Saturday through Wednesday\n .\nA possibility of off-hours support work.\nJob Type: Full-time", 
        "location": "Plymouth Meeting, PA 19462", 
        "date": "2017-04-11 23:20:31.244608", 
        "type": " Full-time"
    }, 
    "95": {
        "salary": 37500.0, 
        "title": "IT Service Technician", 
        "url": "/company/Darkhorse-Technologies/jobs/IT-Service-Technician-a86d123c4abf467d?fccid=2444c534cf49aee3", 
        "company": "Darkhorse Technologies", 
        "summary": "Description:\nPerform phone and desk-side support, installs, maintenance, troubleshooting and upgrades to computer hardware, software and peripheral equipment.\nTravel to offices typically within a 1 hour radius.\nInteract with customers on a daily basis to troubleshoot and resolve network, computer, printer, and software related problems.\nComfort working in close quarters environments - majority of customers are dental/medical offices.\nApplicant must live in the Albany/Saratoga area.\nDuties and Responsibilities:\nInstall, configure and upgrade operating systems and software.\nInstall, assemble and configure computers, servers, monitors, printers and related hardware.\nTroubleshoots problems with computer systems, including hardware and software, e-mail, network and printer equipment problems; makes repairs and corrections where required.\nActs as a technical resource in assisting users to resolve problems with equipment and data; staffs a centralized help desk to facilitate exchange of information and advice; implements solutions or notifies upper management as required.\nPerforms other duties of a similar nature or level.\nMaintains a comprehensive knowledge of PC hardware installation, repair, testing, and troubleshooting.\n50/50 split – local travel and remote support from home.\nSkills and Qualifications:\nIdeally a Bachelor's degree in related field or equivalent experience.\nPrior experience working face to face with customers in an office setting\nAbility to think on your feet and troubleshoot tough problems, sometimes without assistance from others.\nExcellent customer service skills.\nFamiliarity with a variety of the IT concepts, practices, and procedures related to technology operations.\nFamiliarity with MS Windows and Office applications.\nComfortable with working one-on-one with clients.\nExcellent verbal and written communication skills in a business environment.\nExcellent organizational skills and teamwork capabilities.\nAbility to learn quickly and adapt.\nWillingness to stay overnight near jobsites when necessary.\nMust have access to reliable transportation.\nAccess to a home office or quiet space where you can be on the phone during working hours.\nValid Driver’s License.\nPosition Overview:\nThe IT Service Technician’s primary responsibility is customer service. Whether over the phone speaking with customers and helping them troubleshoot problems, or on-site in an office, being able to work with and communicate effectively with people is key. The ability to think on your feet and troubleshoot tough problems in a variety of environments is a must.\nCompany Overview:\nDarkhorse Technologies considers itself the premier IT solution provider for all businesses. We specialize in dental and medical IT support and digital imaging devices. As a young company, we are looking for a team to help us grow while servicing our existing customer base. We offer flexibility, medical benefits, and paid vacations. We are devoted to building strong business relationships with our clients and are looking for someone who values customer service and who can work independently much of the time. Knowing dental and medical specialized software and hardware is not necessary will provide training.\nAbout Darkhorse Tech\nDarkhorse Tech provides customized installation and support for maintaining and servicing small to medium business networks of any kind. We can create digital networks for almost any type of business and have many satisfied medical, dental, legal, finance, manufacturing and food & beverage clients.\nJob Type: Full-time\nSalary: $35,000.00 to $40,000.00 /year\nJob Location:\nAlbany, NY\nRequired education:\nBachelor's\nRequired experience:\nInformation Technology: 1 year", 
        "location": "Albany, NY", 
        "date": "2017-04-19 23:20:34.855003", 
        "type": " Full-time"
    }, 
    "94": {
        "salary": 0, 
        "title": "IT Business Process Administrator-Entry Level Analyst", 
        "url": "/company/Ascend-Federal-Credit-Union/jobs/IT-Business-Process-Administrator-Entry-Level-Analyst-4cac3ba837e8d6b3?fccid=45d23d29701c8592", 
        "company": "Ascend Federal Credit Union", 
        "summary": "IT Business Process Administrator\n***Must apply online at www.ascendfcu.org/apply-now to be considered. Must also complete three pre-employment tests located at the end of the application.***\nLocation: \n 520 Airpark Drive, Tullahoma, TN\nHours: \n Monday — Friday 8:15 a.m. to 5:00 p.m.\nGeneral Summary: \n Responsible for installing, configuring and maintaining software. Coordinate the use of interfaces (APIs) between third-party software and the core database. Responsible for hardware and software installation, maintenance and providing ongoing support between credit union and the vendor. Responsible for daily data processing functions.\nEssential Functions\nHardware Support – Assist with new hardware planning, install and test new hardware, coordinate problems with appropriate vendors, and maintain updated hardware diagrams, office layouts and hardware placement.\nTroubleshoot hardware, i.e. terminal and printer setups and cabling, as required.\nResponsible for installing, configuring and maintaining software. Upgrades of software are often required to be accomplished over weekends and nonscheduled hours.\nCoordinate the use of interfaces (APIs) between third-party software and the core database. Document the relationships between the programs to each other and the core database. Troubleshoot software problems and coordinate resolution with third party vendors as necessary. Must respond at any hour to resolve system problems.\nParticipate and lead in certification windows with third party vendors.\nAssist other team members with testing software.\nMaintain documented Service Level Agreements for all items within the Service Catalog that you are identified as the Primary person.\nServe as primary contact person for front office personnel on general operation questions and relay reported problems or errors to the appropriate vendor and the Host Operations Manager.\nEdit and Post Federal Reserve MICR File - Coordinate totals with Share Draft Department and process return draft notices.\nProcess and transmit outgoing Check21 cash letter file to Vol Corp – 3 times daily.\nCredit Card Processing - Receive CTF from card processor, edit CIF File, checking for double posting entries, post CIF and distribute reports to Card Services Department, and generate positive balance file and transmit to card processor.\nProcess credit card order and transmit order to processor.\nProcess ATM card order and transmit card order.\nE-Branch Processing - Run real-time reports and distribute to appropriate departments, and test new applications, as required.\nAudio Response Processing - Run real-time reports and distribute to appropriate departments, assist members, as required, and test new applications, as required.\nProcess In-house Transmissions - Receive in-house share draft, lock box, and bank reconciliation files, edit files and coordinate totals with Share Draft Department, post files, and distribute reports.\nOptical Report Maintenance - Send reports from spool to RMS file, download from RMS file to optical server, extract reports to optical disk and verify reports, and delete processed files from the spool.\nProcess Payroll Files - Receive/Edit payroll file, coordinate totals with accounting, and post payroll files.\nProcess auto renewals and transfers for share certificates.\nRun all day-end jobs for current date.\nPerform daily backup procedures, including backup of network directories, optical servers, and the host system.\nMonth End and Quarter End processing – Assist with job scheduling, reviewing processing for errors/problems, and coordinate statement processing with processor.\nYearly Processing – Process all tax reporting jobs, order all necessary supplies and forms, and transmit tax reporting information to Internal Revenue Service, as scheduled. Process special credit cards, holiday club, and safe deposit box functions.\nTrain Night Information Systems Operator as required, under the direction of the Host Operations Manager.\nSpecial projects, as required.\nRead all internal credit union publications, including Source and Possibilities.\nMarginal Functions\nOther duties as required or assigned.\nMinimum Qualifications/Skills/Abilities Required\nTwo years college or equivalent experience, emphasis on information systems desired.\nCredit union experience desired.\nMust be able to communicate in a positive manner with outside vendors and coworkers. Working knowledge of computer programs including Microsoft Word, Outlook, Excel, SQL and the internet.\nMust be able to carry lift and carry boxes containing computers components, printer paper, etc.\nHours may be unpredictable because of unforeseen problems arising, updates, etc.\nRegular and reliable attendance is required.\nMust possess a valid, unrestricted driver's license.\nMust be able to operate or have the ability to be trained to operate related office equipment, including computer room equipment, calculator, check and receipt printers, computer terminal (PC), multifunction copier, telephone and typewriter.\nJob Type: Full-time\nJob Location:\nTullahoma, TN\nRequired education:\nAssociate\nRequired experience:\nInformation Technology: 1 year", 
        "location": "Tullahoma, TN", 
        "date": "2017-04-12 23:20:34.583300", 
        "type": " Full-time"
    }, 
    "97": {
        "salary": 35000.0, 
        "title": "System Administrator", 
        "url": "/company/Red-Paladin/jobs/System-Administrator-7ac13c94bddaea7e?fccid=e90d309547f42799", 
        "company": "Red Paladin", 
        "summary": "SUMMARY\n-Manage and tune client computer software systems, servers, virtual machines, and network connections to ensure high levels of availability and security of the supported business applications. -Participate in the planning and implementation of policies and procedures to ensure system provisioning and maintenance that is consistent with company's goals, industry best practices, and regulatory requirements\nSKILLS\n .\n-Experience with Windows Server (2003, 2008, and 2012) platforms.\n-Experience with Windows Security Configuration and Analysis.Experience with Windows security tools/appliances (Firewalls, IPS).Experience with Local Area Network technologies (Switches, Hubs, Routers, VPN, etc).Working knowledge how to provide support for MS Active Directory including Windows domain group policies and administration.\n-Experience with VMware, Segregated Storage, NAS, SAN, and Backups.Experience with backup and recovery tools/software.\nESSENTIAL DUTIES & JOB RESPONSIBILITIES\n-Troubleshoot network systems and respond to issues and or problems.\n-Provides documentation and management reporting.\n-Provide tactical and strategic input on overall network planning and related projects.\n-Review, analyze and evaluate business systems and user needs.Install new software releases, system upgrades, evaluate and install patches and resolve software and OS related problems.\n-Perform system backups and recovery. Maintain data files and monitors system configuration to ensure data integrity.\n-Provide user support as required.Investigate network and security issues and provide recommendations for improvement.\n-Participate in Business Continuity/Disaster Recovery infrastructure planning, building, and testing.\n-Ensure the integrity and security of enterprise data.\n-Manage end user accounts, permissions, access rights, and storage allocations in accordance with best-practices regarding privacy, security, and regulatory compliance.Perform and test routine system backups and restores.Anticipate, mitigate, identify, troubleshoot, and resolve hardware and software problems.\n-Support application development teams.\n-Analyze system, server, and application, and network, performance.\n-Recommend, schedule, and perform software and hardware improvements, upgrades, patches, reconfiguration, and/or purchases.\n-Conduct research on emerging products, services, protocols, and standards in support of systems software procurement and development efforts.\n-Develop, document, and maintain policies, procedures and associated training plans for system administration and appropriate use.Build and deploy physical and virtual servers.\nJob Type: Full-time\nSalary: $30,000.00 to $40,000.00 /year\nRequired education:\nAssociate\nRequired experience:\nSystem Administration: 6 years", 
        "location": "Piscataway, NJ 08854", 
        "date": "2017-04-20 23:20:35.433502", 
        "type": " Full-time"
    }, 
    "96": {
        "salary": 30000.0, 
        "title": "Technical Support Dispatch", 
        "url": "/company/Avidian/jobs/Technical-Support-Dispatch-7177eec47198faf9?fccid=08c705392c8755e3", 
        "company": "Avidian", 
        "summary": "Technical Support Dispatch\nAt Avidian the Technical Support Dispatch is a vital role that helps keep the support team working together smoothly and ensures that our clients have an optimal experience every time they call in for assistance. This requires someone who can organize chaos, keep a friendly disposition at all times, and provide triage for technical support when needed.\nCan you calm down an irate person? Make the client’s experience a priority? Work with a client to triage their issue? Handle input from multiple sources at once?\nIf you can handle all of these things AND have experience (or are willing to get experience) with technical support?\nThan Avidian Technologies is looking for someone just like you to join our amazing Technical Support Team!\nAs a member of our Technical Support Team you will be helping our customers dramatically improve their businesses processes with our flagship product — Prophet. Prophet is a Customer Relationship Management (CRM) tool that helps companies easily track and report on customers and related activities. Prophet is unique in today’s market as it is embedded inside on Microsoft Outlook — the most popular contact management tool on the planet. Since Prophet is embedded in Outlook, it can automatically track contact related activities which are already part of Outlook as well as additional activities added by Prophet.\nWorking with other dedicated individuals you will triage both cloud based and on-site server installations for both PC and Mac clients. You will help our customers by answering general questions regarding our products features and functions and by gathering important information our technicians will need to provide the best care for our client.\nAll our Technical Support team are passionate about helping people and are empowered to assist our clients in any way they can. We foster a strong sense of team and cooperation, building on each other’s strengths and filling in with different areas of expertise. We also promote a “client first” mentality which helps us to provide an excellent experience for our clients that makes us different from other CRM companies. We are adamant about setting proper client expectations; then meeting or exceeding those expectations at every opportunity.\nTechnical Support Dispatch Specifics\nReport to the Support Director, the Technical Support Dispatch plays a key role in Avidian’s success by assuring clients are cared for and assisted in a timely manner.\nJob Description:\nBe the first point of contact for all client interaction, providing quick and accurate triage of technical issues.\nProvide excellent client support for general questions, easy resolutions, and common problems.\nFollow through on ALL customer commitments.\nUnderstand each services level provided to our clients and the expectations those service levels require.\nAssure timely response based on service levels by working closely with our technical support engineers to meet these deadlines.\nProperly log all related client activities.\nWork closely and collaboratively with other team members to efficiently resolve client issue.\nActively participate in the creation of strategies and goals for Avidian to continually make our company and our products better.\nBe a good Avidian team member! The means fostering an open environment of trust and respect for one another and our clients and working toward the greater good of our company and clients. We succeed together!!\nTechnical Requirements:\nExperience with Microsoft Outlook.\nBasic desktop support experience.\nBasic software experience.\nGeneral Competencies:\nExcellent phone and writing skills.\nPossess an unyielding desire to help people.\nExcellent aptitude to learn new technologies and/or technical concepts quickly.\nProperly set expectations with customers then follow through regarding those expectations.\nEngage and de-escalate client frustration by providing remarkable customer support.\nEducation Desirable:\nCollege degree or similar experience.\nWe are located in an office park in Factoria (near the T-Mobile campus). We are currently a small company (about 30 employees) with a tremendous opportunity ahead of us.\nCompensation:\nUp to $30K annually, DOE.\nMedical benefits after a wait period of 30 days.\n3 weeks PTO/year.\nIf you believe you meet these qualifications and want to become part of the Avidian team, please respond to this ad with your resume and brief cover letter.\nPlease note a cover letter is required. Resumes submitted without a cover letter will NOT be considered.\nSelected applicants for the interview process will be notified by 5/20/17.\nJob Type: Full-time\nSalary: $30,000.00 /year", 
        "location": "Bellevue, WA", 
        "date": "2017-04-17 23:20:35.168321", 
        "type": " Full-time"
    }, 
    "11": {
        "salary": 0, 
        "title": "Help Desk Technician", 
        "url": "/company/Veterans-Transportation-Services/jobs/Help-Desk-Technician-0309ad9157100b48?fccid=f36619651fb3cb14", 
        "company": "Veterans Transportation Services", 
        "summary": "The Help Desk Technician maintains and monitors end-user workstations and productivity on local area network using SysAid Help Desk. Perform a variety of maintenance, software installation, end-user support and training tasks to ensure end-user workstations and network performance meet company and user requirements. Provide support to staff on all company-supported applications. Troubleshoot computer problems, determine source and advise on appropriate action. Complete application project-based work. Perform responsibilities in accordance with all company standards, policies and procedures.\nResponsibilities: \nAdministers end-user workstations and supports end-user activities utilizing TCP/IP on a primarily Microsoft Windows-based local area network (LAN).\nInvestigates user problems and identifies their source; determines possible solutions; tests and implements solutions.\nInstalls, configures and maintains personal computers, Windows networks, workstations, file servers, network cabling, and other related equipment, devices and systems; adds or upgrades and configures disk drives, printers and related equipment.\nPerforms and/or oversees software and application installation and upgrades.\nMaintains site licenses for department/organization.\nPlans and implements network security, including maintaining firewalls, configuring VPN, managing host security, file permissions, file system integrity, and adding and deleting users.\nTroubleshoots networks, systems and applications to identify and correct malfunctions and other operational difficulties.\nDevelops and conducts various training and instruction for system users on operating systems and other applications; assists users in maximizing use of networks and computing systems.\nMaintains confidentiality with regard to the information being processed, stored or accessed by the end-users on the network.\nAssists personnel of other departments as a computer resource.\nProvides computer orientation to new and existing company staff.\nMange and install Symantec end user workstation and updates.\nMinimum Qualifications: \nDegree in related field and 3-5 years of networking experience, or equivalent applicable work experience.\n1-2 years help desk experience.\nAbility to communicate technical information to nontechnical personnel.\nAbility to install, configure and maintain personal computers, networks and related hardware and software.\nKnowledge of computer and/or network security systems, applications, procedures and techniques.\nAbility to identify and resolve computer system malfunctions and operations problems.\nSkill in organizing resources and establishing priorities.\nExcellent verbal and written communication skills.\nAbility to learn and support new systems and applications.\nJob Type: Full-time\nRequired experience:\nhelp desk: 3 years", 
        "location": "Waltham, MA", 
        "date": "2017-04-10 23:15:24.537848", 
        "type": " Full-time"
    }, 
    "10": {
        "salary": 40000.0, 
        "title": "Help Desk Support Specialist", 
        "url": "/company/DISYS/jobs/Help-Desk-Support-Specialist-41da7579c4b575ba?fccid=2ac1f406582acd9b", 
        "company": "DISYS", 
        "summary": "Ideal candidate will be proficient in matter management and document management applications\n .\nHard worker with a strong drive to succeed/excel.\nSoftware skills\n :\nproficient in Microsoft applications including Outlook, Word, Excel, PowerPoint and Visio.\nAbility to train others on how to perform tasks/skills.\nStrong problem solving ability.\nMust be Proficient in SharePoint\n1+ year of experience providing technical support\nstrong customer service skills/background\nProvides routine to moderately complex technical support for a business unit.\nIs the first point of contact for technical issues and initiatives related to all systems, tools and applications used by the work group.\nDuties are varied and include user access and other security administration issues, production support and troubleshooting, application maintenance, monitoring and/or balancing.\nSupports application installations and upgrades.\nCoordinates and executes User Acceptance Testing, assisting in writing test scripts.\nDocuments user application procedures, updating as changes occur.\nConducts and may develop user training.\nParticipates in user needs assessment and works with technology partners on business requirements and specifications.\nMonitors and coordinates proper maintenance and/or replacement of user equipment.\nSalary: $20.00 /hour\nRequired experience:\nHelp Desk: 2 years\nShare: 1 year", 
        "location": "Des Moines, IA", 
        "date": "2017-04-20 23:15:15.644335", 
        "type": ""
    }, 
    "13": {
        "salary": 25000.0, 
        "title": "Desktop Support Technician", 
        "url": "/company/Private-Green-Bay-Manufacturing-Company/jobs/Desktop-Support-Technician-db8f27cc0da0fa24?fccid=466834f54eb85fb7", 
        "company": "Alwin Manufacturing", 
        "summary": "Essential Duties and Responsibilities:\nField IT Support calls and tickets related to end user issues\nEnd user orientation and training related to IT\nSoftware installs and software troubleshooting\nPC troubleshooting, repairs and set up of new desktops and laptops\nrun, terminate and test network cabling\nSet up and troubleshoot mobile devices (cell phones, tablets, etc.)\nAbility to set up Network printers\nPart time position 10-15 hours per week during 1st shift.\nJob Type: Part-time\nSalary: $12.50 /hour\nRequired experience:\nDesktop Support: 1 year", 
        "location": "Clintonville, WI", 
        "date": "2017-04-21 23:15:29.099716", 
        "type": " Part-time"
    }, 
    "12": {
        "salary": 40000.0, 
        "title": "IT Support Specialist", 
        "url": "/company/Harness-Technology/jobs/IT-Support-Specialist-45005623cfffbfd4?fccid=48159e3c082dcf6b", 
        "company": "Harness Technology", 
        "summary": "Harness Technology provides IT support services to small business in the Boston area. We seek an IT professional with a background in system administration and support who is looking to bring his/her technical skills and experience to a consulting environment. This position offers a chance to work independently while learning a flexible, supportive team environment. Above all, it is an opportunity to help shape a premier IT support organization.\nRESPONSIBILITIES:\nAssist in optimizing our managed services platform and through monitoring, alerts, and reports in order to offer our clients the best-of-breed in proactive support.\nProvide first tier remote administration and support\nDevelop and foster relationships with key client contacts.\nProvide onsite support for emergency situations and special projects\nExpected duties involve\n- 50% helpdesk / remote support & maintenance- 25% Onsite client support- 25% Projects , technology planning, documentation.\nRequirements:\n2+ years in IT support, system administration, and/or helpdesk\nFirst-rate verbal and written communication skills\nSolid, hands-on knowledge of the following technologies:\n- Windows Server, SBS, Active Directory administration and maintenance\n- Microsoft Exchange (2003-2010) administration\n- Corporate laptop/desktop support\n- Mobile device/tablet integration\n- Firewall (SonicWALL preferred) / VPN\n- Managed services experience strongly desired\nJob Type: Full-time\nSalary: $40,000.00 /year\nRequired experience:\nIT Support: 2 years", 
        "location": "Framingham, MA 01701", 
        "date": "2017-04-04 23:15:28.824681", 
        "type": " Full-time"
    }, 
    "15": {
        "salary": 0, 
        "title": "Manager, IT Service Desk Operations (5 yrs. exp.)", 
        "url": "/company/Hahn-Automotive-Warehouse,-Inc./jobs/Manager-866afed523b5ea7c?fccid=ebc24aa682c557fd", 
        "company": "Hahn Automotive Warehouse Inc", 
        "summary": "POSITION SUMMARY (5 yrs. exp.)\nResponsible for the effective operation of enterprise wide IS/IT Service Desk/Management Operations; successfully achieving the defined service levels and client satisfaction. Responsible for developing, implementing, maintaining and governing standard IS/IT policies, processes and procedures within service management operations. Enable collaboration, partnering and knowledge across the business and IS/IT teams to ensure continuous improvement of the IS/IT service quality. Accountable for selection, implementation and administration of service management automation solutions.\nGENERAL JOB DUTIES\nOversees the operations of Tier 1- Service Desk including warehouse and store operations support team.\nResponsible for all aspects of IT service management operations, including, but not limited to, change, problem, incident, critical incident, asset, and service request.\nResponsible for Point of Sale managed service offering for independent store customers including P&L, quoting, implementation coordination, customer training and ongoing support.\nMaintains all policies and procedures, initiating appropriate strategies, to improve the efficiency and effectiveness of our service management processes.\nAnalyzes Service Desk activity, prepares performance metrics, and makes recommendations for changes in Service Desk procedures and systems to improve service levels and customer satisfaction.\nAssists Service Desk analysts in prioritizing and solving non-routine or complex incidents and requests.\nFacilitate Change Advisory Board (CAB) meetings to review upcoming application and infrastructure changes.\nManages the service management operations tools and associated automation solutions; accountable for strategic roadmap, licensing, enhancements, upgrades and new modules.\nManages projects specific to service management operations and store operations initiatives from initiation, requirements and delivery: gathering, planning, consultation, collaboration, training, and delivery.\nNegotiates and maintains SLA’s with the customers and OLA’s with IS/IT support teams.\nHiring, mentoring and managing the performance of staff members including providing specific and constructive feedback to team members and completing annual performance reviews.\nMaintains the communication process between IS/IT and business customers, ensures accuracy and understanding of mass communications.\nCreates long-term strategies for growth and maintenance of service desk team and provides budgetary recommendations to senior management.\nTrains service desk staff to utilize service desk system, field, respond and resolve incoming incidents.\nKNOWLEDGE, SKILLS AND ABILITIES\nExcellent written, oral, and interpersonal communication and presentation skills.\nMature and self-motivated professional able to work in a fast-paced and constantly changing environment.\nAbility to relate the goals of IS/IT service support to business goals\nA focus on customer satisfaction, with strong interpersonal skills and responsiveness\nAdherence to IS/IT policies and processes to ensure consistent quality of service and industry compliance.\nAbility to manage complex cross functional projects throughout the organization.\nProven track record of managing projects on time and within budget.\nStrong reporting experience and ability to provide accurate metrics both according to schedule and ad hoc.\nAbility to drive process improvement to continually improve service and reduce costs\nUnderstanding of business priorities and their impact on IS/IT as well as understanding the impact of IS/IT on the business\nStrong focus on deadlines and highly developed time and project management skills.\nAbility to make decisions based on consensus and the information at hand.\nProfessional manner, demonstrating discretion and confidentiality\nAbility to translate and present complex information into simple terms and articulate this information to the customer community.\nAbility to relate to and work with people at all levels within the organization and collaborate on a basis of mutual respect and understanding.\nAble to drive the ideal of IS/IT as a partner of the business with both IS/IT colleagues and business partners.\n*\nEXPERIENCE (5 yrs. exp.)\nMinimum 5 years’ experience of working in a customer services IS/IT support environment.\nProven track record of transforming and building high performance service management operations & support teams.\nExperience in managing information technology infrastructure Library (ITIL) processes preferred\nProven track record in customer relationship management.\nStrong experience in developing and maintaining accurate Management Information and metrics.\n*\nEDUCATION\nBachelor’s degree in Computer Science or a related field; or an equivalent combination of education and experience resulting in a solid understanding of job responsibilities is required.\nAdvanced ITIL qualifications are preferred (beyond ITIL foundation).\nWORK ENVIRONMENT\nGeneral Office environment\nSitting for extended periods of time\nOccasional onsite travel to remote sites as needed.\nDexterity of hands and fingers to operate a computer keyboard, mouse, hand and power tools, and to handle other computer components.\nOccasional lifting and transporting of heavy to moderately heavy objects up to 50Lbs., with or without material handling equipment.\nSome after-hours work required.\nJob Type: Full-time\nRequired education:\nBachelor's\nRequired experience:\n * experience in managing IT Service Desk operations: 5 years", 
        "location": "['Rochester, NY 14608 ', '(Susan B Anthony area)']", 
        "date": "2017-04-14 23:15:37.943793", 
        "type": " Full-time"
    }, 
    "14": {
        "salary": 30000.0, 
        "title": "IT Assistant", 
        "url": "/company/Goodwill-Hawaii/jobs/IT-Assistant-2d4b2f799d7d2cb1?fccid=9a0835c3062a104f", 
        "company": "Goodwill Industries of Hawaii Inc", 
        "summary": "Job Title: \n IT Assistant\nLocation: \n Honolulu, Hawaii\nSchedule: Full Time.\n Core hours are between 7:30am – 4:30pm, Monday through Friday. After hours support as needed for system maintenance and outage. Occasional travel may be required.\nCompensation: \n Based on experience with competitive benefits package\nSummary: \n As an IT Assistant for Goodwill Hawaii, you will provide customer service and IT support to end-users. You will troubleshoot basic computer hardware and software problems. You will configure hardware and software, and set up new computer equipment. You will also assist the Director of IT with various projects and tasks as deemed necessary. We are looking for someone who is computer savvy, detail oriented, customer service focused, and can work independently.\nEssential Duties: \nProvide daily support for GIH computer users. Performs duties in a timely manner while exhibiting strong customer service ethics. Manage the helpdesk ticket system and to ensure that all tickets are properly assigned and updated.\nInstall and test installation of hardware and software peripherals. Installs software packages as requested and within licensing regulations. Repair equipment as needed.\nMaintains user accounts and permissions to shares, folders and network printers via Active Directory. Assist with password resets for POS and network accounts.\nProvides status update and completion notice of projects to the requester and the Director of IT.\nMinimum Qualifications: \nHigh School Diploma/GED or equivalent\nMinimum of 6 months' experience in desktop support\nKnowledge in Windows environment version 8.1, 10\nBasic troubleshooting skills, including computer and laptop assembly, OS installation, installing patches and updates\nSkills in MS Office, Exchange/Outlook, Mobile devices (IOS and Android)\nValid drivers’ license\nAccess to an insured vehicle\nPreferred Qualifications: \nAssociate’s degree in Computer Science\nComptia A+\nTO APPLY: \n Visit www.higoodwill.org/jobs to complete the online application form.\nAt Goodwill Hawaii our mission is simple, yet powerful, we help people with employment barriers reach their full potential and become self-sufficient. We are the third largest non-profit agency in Hawaii and our motivation is sustaining Hawaii’s community through the power of work. Last year we placed nearly 1,500 people into employment, resulting in $22 million in annual wages earned as a result of these job placements. Join the Goodwill Hawaii family and help strengthen our Hawaii community, one job at a time.\nGoodwill Hawaii is committed to fully complying with all Equal Opportunity Employment and Affirmative Action laws and regulations. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, including gender identity or expression, sexual orientation, national origin, citizenship, ancestry, age, marital status, genetic information, domestic or sexual violence victim status, disability, protected veteran status or any other status protected by federal, state or local law. We also foster a drug-free work environment.\nJob Type: Full-time\nSalary: $15.00 /hour", 
        "location": "Honolulu, HI", 
        "date": "2017-04-17 23:15:37.599319", 
        "type": " Full-time"
    }, 
    "17": {
        "salary": 40000.0, 
        "title": "IT Field Service Technician", 
        "url": "/company/CompuCom/jobs/IT-Field-Service-Technician-6f7768e3de1c8f56?fccid=37a1bf601ebbfd51", 
        "company": "CompuCom", 
        "summary": "IT Field Service Technician\nThe candidate shall be a self-starter, have exceptional customer service proficiencies and uses communication as an expansive tool to achieve an excellent customer experience. The candidate must conduct their efforts in a professional, businesslike manner and effectively communicate, as well as provide continuous quality in their daily task achievements. The candidate will be self-motivated with excellent time management skills with the ability to complete projects ahead of schedule.\nCandidate will support clients IT/Data needs, provide prompt action, support and resolution for daily technical requirements. The candidate will be consistent with documentation, tracking and monitoring issues, providing notes and feedback as well as make in-field decisions for a positive result.\nPerformance Responsibilities\nExceptional Customer Service and relationship building competence\nTravel within a radius of 75 to 100+ miles daily in a specific route.\nUnderstand AC/DC and backup power concepts\nExcellent time management and reporting skill\nFamiliar with various operating systems (e.g. - Windows OS, OSX, Linux/Unix)\nManage triage, troubleshooting and resolution to scope IT equipment\nOccasionally works at heights of 20’ to 25’, lift equipment training provided\nDocument efforts, issues and resolutions, close cases/tickets daily\nExperience desired in copper and fiber cabling and various terminating connectors\nProficient communicator with emotional intelligence insight for explaining IT terminologies at the client’s level of understanding\nInsight to POS, PC, Printers, Thin Clients, AP’s, Servers, Network switch equipment\nJob Type: Full-time\nSalary: $35,000.00 to $45,000.00 /year\nJob Location:\nNew York, NY\nRequired education:\nHigh school or equivalent\nRequired experience:\nIT Technical Support: 1 year\nRequired license or certification:\nCompTIA A+", 
        "location": "['New York, NY 10018 ', '(Clinton area)']", 
        "date": "2017-04-20 23:15:49.942739", 
        "type": " Full-time"
    }, 
    "16": {
        "salary": 0, 
        "title": "IT Support Technician", 
        "url": "/company/Beavers-Inc./jobs/IT-Support-Technician-fefa36179b83af19?fccid=0050b7b3659e3996", 
        "company": "Beavers Inc", 
        "summary": "The IT Support personnel serve as an integral part of the Information Technology (\"IT\") department for the entire organization. The primary responsibilities include but are not limited to examining existing IT Infrastructure, Point of Sale, and Kitchen Video Monitor Systems. This position may be onsite or connect remotely to vary locations, which may include installing, configuring, troubleshooting, upgrading, training, monitoring or diagnosing system and application problems.\nSpecific requirements for the position include, but are not limited to, a well-organized, detail oriented individual whose greatest asset is efficiency, teamwork, and who demonstrates professional personal, spoken and written communication skills.\nEssential Responsibilities\nImplement systems, but also support, administration, and maintenance of software and computer systems.Provide documentation and training to staff in existing business information application, test system upgrades and business reports relevant to the company.Ensure better usability of the systems, by enhancing it. Ability to administer systems and computers, with advanced skills in Microsoft Office Suite.Assist IT Support Specialist, either in their absence or working hand-in-hand with them.\nInstall/upgrade network infrastructure, and cable installation at store locations, and at corporate offices. Maintain POS/KVM systems through remote/onsite troubleshooting and repair using email and phone calls.Maintain computer/network security through anti-virus software monitoring.Maintain remote access software to store and office computers, delegating access to required personnel only.Perform periodic maintenance on all store and office desktop computers - includes monitoring for performance.Perform periodic maintenance on all servers, this includes email, domain servers, Webserver, and gateways.Install and maintain software on all desktop computers, includes Adobe products, MS Office, LibreOffice, and other programs that may be required during the course of business.Troubleshoot desktop computers at remote locations through a mixture of remote access technologies as well as phone calls with store/supervisory personnel.Install/maintain/troubleshoot DVR's at remote locations.Email server administration - account creation, distribution lists maintenance, shared resource maintenance.Company website development/maintenance and administration.\nRequired Education/Experience/Skills\n1+ years IT work experience with a minimum of an Associate Degree or higher education in Information Technology, Computer Science or similar field.Application support experience with Microsoft Office and Adobe products.Working knowledge of databases, and tools. (i.e. SQL, SQL express).Previous relevant computing, software or training experience essential.Must be team player and able to work with minimal supervision.Must have professional demeanor, positive attitude, patience, flexibility and customer-service attitude; work with top management, remain cool under pressure.Strong critical thinking skills. Keep up to date with technical and industry developments.Must be able to pass pre-employment drug screening, and background check.\nDrug-free work environment.\n$10.00 to $15.00 per hour\nJob Type: Full-time\nRequired experience:\nInformation Technology: 1 year\nRequired license or certification:\nDriver's License", 
        "location": "Fort Walton Beach, FL 32548", 
        "date": "2017-04-23 23:15:48.802075", 
        "type": " Full-time"
    }, 
    "19": {
        "salary": 0, 
        "title": "IT Support", 
        "url": "/company/Cavalier-IT-Solutions/jobs/IT-Support-33162e5f6d73ec4d?fccid=232dda64bad8b565", 
        "company": "Cavalier  IT  Solutions", 
        "summary": "Position: IT Support\nLocation: Philly, PA\nDuration: 3 months\nJob Description: \nThis Analyst will work closely with Business Analyst, Project Leads, and Management to develop and maintain POS Menu Data and Implementation information, its supporting systems, and processes and users who consume it.\nAs such, this position will work primarily, but not exclusively, with Micros Simphony 1.x, 2.x and other interfaced systems in support of client critical POS mission.\nIdeal candidates will have the opportunity to configure these systems and support our users of afore mentioned systems, while working within teams and independently.\nTake information provided from Business Readiness and Project Management team and configure the POS Software utilizing that information\nFollow business processes and standards when configuring POS system for new implementations Work out of a menu change support queue to continuously update POS item's and menu's Provide pre and post deployment POS menu support\nJob Type: Contract", 
        "location": "['Boston, MA 02210 ', '(South Boston area)']", 
        "date": "2017-04-10 23:15:50.842581", 
        "type": " Contract"
    }, 
    "18": {
        "salary": 40000.0, 
        "title": "Technical Support Engineer Level I", 
        "url": "/company/Cattura-Video/jobs/Technical-Support-Engineer-Level-ddcd2e7202090d4b?fccid=ccf2b6a4a91423b1", 
        "company": "Cattura Video", 
        "summary": "General Overview: \nCattura Video is a rapidly growing education technology startup company based in San Antonio, Texas. We offer a range of lecture capture solutions for Educational, Government, and Enterprise environments. Our advanced hardware and software solutions handle the most critical capture and streaming needs. CaptureCast Pro Hardware solutions provide some of our nation’s most prestigious schools and businesses with unmatched reliability, powerful automation features, and much more.\nTechnical Support Engineer\nCattura Video is seeking a Technical Support Engineer, as an entry level position, to provide support to our North American and European customers.\nProviding effective customer support is the key role and responsibility of this position. You will be responsible for direct support issues over the phone or email, troubleshooting from the software stack down to Linux and/or hardware, documenting and tracking the complete customer support progress, and providing fantastic account management to build relationships with our customers. This position will also include assisting the Lead Hardware Engineer in building, repairing, and testing of hardware.\nWe will train the right person for this role. It is preferred you know Ubuntu Linux and have knowledge of building computers. Position will pay $40,000 to $45,000 depending on experience. Some travel may be required.\nResponsibilities\n :\nAnswer all support calls/ emails from 8-5 as Tier 1 support\nWork with Tier 2 support on complex technical calls\nManage and track open customer issues\nDocument customer issues and track it until closed\nSend customer follow ups to ensure issue is resolved\nCreate internal support tickets for product or customer usage failures\nAct as technical support liaison between customers and development team\nTrack and report quality assurance testing on our hardware for bugs and failures\nAssist in building or repairing recording hardware\nKey Skills\n :\nCustomer service\nTroubleshooting in a Linux environment\nBuilding / repairing computer hardware\nDocumentation & management of troubleshooting records\nTier 1 & Tier 2 support Knowledge\nBug tracking\nEmail & phone etiquette\nJob Type: Full-time\nSalary: $40,000.00 /year\nJob Location:\nSan Antonio, TX 78249\nRequired experience:\nUbuntu Linux and have knowledge of building computers.: 1 year", 
        "location": "San Antonio, TX 78249", 
        "date": "2017-04-13 23:15:50.150439", 
        "type": " Full-time"
    }, 
    "48": {
        "salary": 0, 
        "title": "IT Help Desk Technician", 
        "url": "/company/Bekins-Northwest/jobs/IT-Help-Desk-Technician-b27be1745dad37c7?fccid=38eb88871c30c57e", 
        "company": "Bekins Northwest  Olympic Moving & Storage Group", 
        "summary": "Bekins Northwest/Olympic Moving Group seeks a dynamic IT Help Desk Technician that is self-motivated and highly organized. In addition to providing exceptional customer service, the successful candidate will have a keen eye for recognizing inefficiency and take initiative to simplify processes. The Helpdesk Technician will assist with administrative duties and technical support.\nEssential Job Responsibilities (include but not limited to): \nAssist staff in resolving equipment and software problems through discussion and diagnosis.\nTrain staff on equipment and software use.\nConduct remote troubleshooting of computer problems.\nRemove and add permissions for staff.\nServe as a liaison between staff and Vice President to resolve issues.\nDocument resolutions for future reference.\nTroubleshoot software and hardware failures and take necessary steps to remedy problem(s).\nProvide user and technical support for software and hardware.\nsetup, repair and maintain workstation computers and related equipment (Setup new users, maintain security, software and hardware updates, etc.)\nManage printer repairs.\nSupport the Vice President with user setup, management and support for the phone system.\nInstallation of upgrade and software applications.\nMaintain data backups.\nSupport Vice President with database management.\nAdministrative assistant duties as assigned.\nOther duties as assigned.\nEducation/Experience: \nAA in Computer Science, Bachelor's Degree in Computer Science, or equivalent\nA minimum of 2+ years experience as a successful IT Helpdesk Technician.\nComputer science, information systems and database experience.\nSkills/Knowledge/Abilities Required: \nAdvanced/Expert user of Microsoft Office Suite.\nExcellent oral and written comprehension and communication skills.\nExcellent organizational, attention to detail and time management skills.\nProactive, Reliable and Consistent\nUnderstanding of and commitment to customer service and Bekins Northwest's core values.\nWorking Conditions: \nWork is generally performed in an office setting with no unusual hazards. However, occasionally lifting of up to 100 pounds may be necessary. Travel is minimal, but may be required for training purposes.\nBenefits: \nOur competitive benefit package includes: paid vacation and holidays, medical/dental/vision coverage.\nBekins Northwest takes pride in having a dynamic, diverse workforce. The possibilities for our Company are limitless and so are the careers of the bright, ambitious team players behind our innovations. We strive to attract and train the very best employees and provide them with ongoing career development, benefits, and a path for advancement.\nWe are an Equal Employment Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.\nPassage of a drug test and criminal background check are required at the time of employment. Bekins Northwest is a Drug Free Work Environment. Any candidate that tests positive for marijuana or ANY controlled substance and/or alcohol during a pre-employment drug/alcohol screening will not be eligible for hire.\nAbout our Company: \nEstablished in 1903, Bekins Northwest has more than 100 years of experience in the moving industry. We continually strive to raise the standard to provide our customers with the best possible service in the moving industry. Our highly-qualified staff of account managers, movers, packers and drivers are considered experts in the industry. We proudly employ a professional staff of experts in residential moving, office moving, systems furniture installations, International crating, special products and corporate relocations. Many of Washington's largest employers, including the Seattle Seahawks, Seattle Mariners, University of Washington, Providence, Burke Museum and the State of Washington, have relied on our expertise and quality services. We are proud to be an Agent for Bekins Van Lines and their \"customer first\" philosophy.\nJob Type: Full-time\nRequired education:\nBachelor's\nRequired experience:\nHelp Desk: 1 year", 
        "location": "Lakewood, WA", 
        "date": "2017-04-14 23:18:43.922533", 
        "type": " Full-time"
    }, 
    "49": {
        "salary": 70000.0, 
        "title": "Systems Administrator", 
        "url": "/company/Backyardcomputech/jobs/System-Administrator-9241a6c7249c7a6a?fccid=5405169e58195a99", 
        "company": "Backyardcomputech", 
        "summary": "Sent me your resume no need to add more description I will be looking into your resume if you fit the criteria\nJob Type: Full-time\nSalary: $35.00 /hour", 
        "location": "Raleigh-Durham, NC", 
        "date": "2017-04-17 23:18:44.685418", 
        "type": " Full-time"
    }, 
    "46": {
        "salary": 40000.0, 
        "title": "Desktop Support Engineer", 
        "url": "/company/Mainstreethost/jobs/Desktop-Support-Engineer-1b5b669321f2db37?fccid=92a1aa1c5ff6cf7d", 
        "company": "Mainstreethost", 
        "summary": "Mainstreethost is a digital marketing agency based in Buffalo, NY that offers everything you need to have a successful online presence. Increase traffic to your website. Attract new customers. Improve your search engine rankings. Publish content and videos on social networking sites.We are looking to add an experienced sales professional to our growing Sales team.Mainstreethost offers exciting benefits which include:\nHealth Insurance\nPaid Time Off\n401(k)\nEssential Duties and Responsibilities: \nAddress user tickets regarding hardware, software and networking\nInstalling applications and computer peripherals\nAsk targeted questions to diagnose problems\nGuide users with simple, step-by-step instructions\nConduct remote troubleshooting\nTest alternative pathways until you resolve an issue\nCustomize desktop applications to meet user needs\nRecord technical issues and solutions in logs\nDirect unresolved issues to the next level of support personnel\nFollow up with employees to ensure their systems are functional\nReport employee feedback and potential product requests\nHelp create technical documentation and manuals\nWork Requirements: \nProven work experience as a Desktop Support Engineer, Technical Support Engineer or similar role\nHands-on experience with Windows/Linux environments\nHands-on experience with Active Directory\nWorking knowledge of office automation products and computer peripherals, like printers and scanners\nKnowledge of network security practices and anti-virus programs\nAbility to perform remote troubleshooting and provide clear instructions\nExcellent problem-solving and multitasking skills\nJob Type: Full-time\nSalary: $30,000.00 to $50,000.00 /year", 
        "location": "Amherst, NY", 
        "date": "2017-04-13 23:18:34.909023", 
        "type": " Full-time"
    }, 
    "47": {
        "salary": 65000.0, 
        "title": "I.T. Specialist", 
        "url": "/company/GL-VENEER-CO-INC./jobs/T-Specialist-dc60876d35cea079?fccid=cc473eadb2d9d438", 
        "company": "GL VENEER CO INC", 
        "summary": "A Los Angeles based company with 40 years in the wood-working industry is currently seeking I.T. Candidates w/ 1-3 years of Syspro experience. The ideal candidate will have the following skill-set:\nExperience in deployment and configuration of ERP Solution, Syspro\nExperience in configuring and customizing Syspro Modules.\nAssist with and follow the software development lifecycle and lead projects. Analyze document business requirements, developing project plans and managing projects to deadlines.\nAssist with the design and development of application modules & database structures\nEnsure that all applications conform to system and programming standards and are appropriately documented.\nAssist with project communication amongst team and with other project participants using methods appropriate to audience and type of communication.\nLiaison between the IT team and internal stakeholder(s) and external customer(s)\nProject Management experience to plan and execute projects with internal and external resources including vendor management.\nAssists managing hardware, software, and networking\nMaintain, manage, troubleshoot and upgrade computer systems and servers for performance and security related issues\nProvide end user support for IT related issues, hardware and software.\nSQL, MS Access, and Crystal Reports experience a plus.\nBi-lingual English/Spanish helpful\nOther duties may be assigned.\nBENEFITS:\nMEDICAL\nDENTAL\nVISION\n401(k)\nSUPPLEMENTARY BENEFITS\nPAID HOLIDAYS\nJob Type: Full-time\nSalary: $50,000.00 to $80,000.00 /year\nJob Location:\nLos Angeles, CA\nRequired education:\nBachelor's\nRequired experience:\nSyspro: 2 years\nRequired language:\nSpanish", 
        "location": "Los Angeles, CA", 
        "date": "2017-04-21 23:18:35.099825", 
        "type": " Full-time"
    }, 
    "44": {
        "salary": 48000.0, 
        "title": "OFFICE MOVE - IT TECHS NEEDED", 
        "url": "/company/SmartSource,-Inc./jobs/Office-Move-bc0d5602c89ce137?fccid=ef6e70a8609c4775", 
        "company": "SmartSource Inc", 
        "summary": "SmartSource is in need of (3) IT Techs for an office move at a client site in the Boston area.\nLocation change: Moving from \nMalden, MA\n office to \nMedford, MA\n office.\nDates: April 26th to May 3rd\nPay Rate: $24.00 per hour\nScope of work: \n· Unmount of Server/Network equipment and remount at new location.\n· Network LAN/Wi-Fi check at new location.\n· Post move checks.\nIf you or anyone you know is qualified and would be interested in this job opportunity, please send WORD Resume ASAP!\nJob Type: Temporary\nSalary: $24.00 /hour\nJob Location:\nMalden, MA", 
        "location": "Malden, MA", 
        "date": "2017-04-19 23:18:10.311946", 
        "type": " Temporary"
    }, 
    "45": {
        "salary": 0, 
        "title": "Information Technology Specialist", 
        "url": "/company/Mercury-Technology-Development/jobs/Information-Technology-Specialist-829ceb1b40f33e9e?fccid=0e73008820d457d5", 
        "company": "Mercury Technology Development", 
        "summary": "Stravinski\n are looking for an \nInformation Technology Specialist\n who is motivated to balance professional customer service with IT technical knowledge.\nThis exciting position will be within \nMercury Technology Development (MTD), a Stravinski Company (American Canyon, CA),\n an innovative software development and technical support organization. \nMTD\n specializes in maintaining, deploying, and developing software for managing, tracking and reporting warehouse-logistics along with business-as-usual support for \nStravinski Companies\n , performing a wide range of duties from installing, configuring, and maintaining enterprise hardware and software that supports all \nStravinski\n operations to developing custom applications to suit business needs.\nUnder the direction of the IT and Software Development Managers, the ideal candidate will be responsible for:\nIT Support Activities\nProvide timely support for a team on energetic non-technical operations team\nResolve user and system issues\nDesign procure and deploy hardware and software solutions to support growing business needs\nResolve trivial user issues with professionalism\nMaintain a record of Moves, Adds and Changes within the companies\nDocument tasks performed and create user tutorials\nOther duties as assigned by management\nSoftware Development Support Activities\nMaintaining and deploying applications and resources to cloud based development and production environments\nCreating and maintaining development and production environments\nDocumenting processes and procedures and changes\nTroubleshooting connectivity and performance issues\nResearch and implement solutions to problems that arise as part of day to day operations\nOther duties as assigned by management\nDesired Experience\nHands on experience with network routing and switching protocols\nExperience with Windows, Linux, Android and Apple operating systems on both Desktop and server environments\nManage and purchase hardware and software procurement as mandated by business case\nManage Internet, Telephony, and WAN connectivity services\nTroubleshoot network issues\nExperience with Azure, Office 365, Exchange server (2013 and above), Amazon Web Services, and Remote Monitoring and Management platforms\nUnderstanding of Enterprise Information policies and procedures\nIT Security Best Practices\nDesired Soft Skills\nUnderstand challenges posed by provider of white glove customer service\nDemonstrate professionalism and courtesy with customers at all times\nResolve issues in a clear, courteous, and straight-forward manner\nStrong analytical, research and problem solving skills\nStrong team player with a can-do attitude\nTravel\nThere will be an intermittent need to travel to the Headquarters in Madera, California to attend meetings or resolve technical issues. Any urgent situation may mandate such travel at short notice.\nAbout Stravinski Companies\nStravinski\n began as a general contractor in 1986. Since that time, \nStravinski\n has constructed manufacturing plants, warehouses and distribution facilities, industrial facilities, shopping centers, medical complexes, office complexes, schools, and heavy concrete foundations to name just a few.\nStravinski\n offers a competitive compensation package commensurate with experience, along with comprehensive benefits including medical, dental and vision insurance, 401K, vacation, and paid holidays.\nJob Type: Full-time", 
        "location": "American Canyon, CA", 
        "date": "2017-04-20 23:18:16.877854", 
        "type": " Full-time"
    }, 
    "42": {
        "salary": 60000.0, 
        "title": "IT Service Desk Manager", 
        "url": "/company/Intrinium/jobs/IT-Service-Desk-Manager-92699ac4d5abddc9?fccid=dc5315c7e6935822", 
        "company": "Intrinium", 
        "summary": "An exciting position has opened up on our IT Help Desk.\nWe're looking for a high functioning individual who can:\nManage people\nManage IT infrastructure\nManage systems that help manage the people and IT infrastructures we manage\nAn understanding of Window's networks, the OSI model for networking and the ability to leverage best of class tools for network management to make decisions, troubleshoot and predict potential issues in advance is necessary. Please include your experience in these areas in your response back.\nWe are a forward thinking MSP located in the CIty of Spokane that is looking for additional leadership, management and supervisory potential to add to the team. We have awesome benefits including 100% company paid healthcare, unlimited PTO, 401k with company match and most importantly a great start-up culture that is fast paced and fun.\nPlease email your resume and a short cover letter in PDF format.\nJob Type: Full-time\nSalary: $60,000.00 /year\nRequired experience:\nIT or Help Desk: 4 years", 
        "location": "Spokane, WA 99212", 
        "date": "2017-04-17 23:18:04.485341", 
        "type": " Full-time"
    }, 
    "43": {
        "salary": 0, 
        "title": "Desktop Support Technician", 
        "url": "/company/Prometheus--LLC/jobs/Desktop-Support-Technician-1b471ad5cfa71048?fccid=b876c8eb811045ed", 
        "company": "Prometheus LLC", 
        "summary": "Security Clearance: \n DOD Interim Secret as a minimum\nCitizenship: \n US\nExperience: \n3 years of experience supporting desktops, laptops, thin client, and zero client hardware as well\nas Windows 7 and Server 2008r2 / 2012r2\nRequired Certifications: \n1. CompTIA Security+\n2. Computing Environment (CE) Certification (i.e., MCSE, Server+, etc.) – can be waived for 30 days after project join date.\nPosition Requirements: \nThis position is for a Systems Administrator for a mixed and growing environment of VMWare View, Windows 7, Windows 10, Windows Server 2008, Windows Server 2012, Solaris and Red Hat. This position will work with the existing Service Operations Branch administrative teams (Windows and Unix Administration) to design, implement, manage, maintain, deploy, troubleshoot and support customer environments. This position will require implementing new system hardware and software, and developing local operating procedures and policies as needed or requested. This position will need to be adept at monitoring the ongoing operation of the desktops and servers while providing utilization reports to identify problems and corrective actions as needed.\nRequired skills: \nMinimum 3 years of experience supporting desktops, laptops, thin client, and zero client hardware as well as Windows 7 and Server 2008r2 / 2012r2\nBase knowledge of support of VMWare View and Citrix Presentation Server required\nJob Type: Full-time\nRequired experience:\nDesktop Support: 3 years\nRequired licenses or certifications:\nSecret Security Clearance\nUS Citizenship\nSecondary Computing Environment (CE) Certification\nCompTIA Security+", 
        "location": "Radford, VA", 
        "date": "2017-04-23 11:18:06.783775", 
        "type": " Full-time"
    }, 
    "40": {
        "salary": 0, 
        "title": "Information Technology Specialist", 
        "url": "/company/Scenic-Community-Credit-Union/jobs/Information-Technology-Specialist-c584da26e0af5081?fccid=edde55542475256a", 
        "company": "Scenic Community Credit Union", 
        "summary": "Responsibilities\nCommunicate with all levels within the Credit Union and provide internal and external users with on-site and remote technical support in conjunction with IT supervisor. Confidentiality is a must.\nInstall, diagnose, repair, maintain and upgrade all computer hardware and software to insure optimal performance. Assist in the planning, design, creation, development, testing, implementation and modification of computer programs related to various machine operating systems to include desktop PCs, laptops, tablets, servers, network equipment and software applications.\nAssist in the organization and inventory of all hardware and software resources and the creation of documents and manuals for the department when needed. Also provide emergency on-call and backup support to IT Supervisor as needed.\nSome college or in college preferred.\nMust be able to lift 40 lbs and be able to work in the cold for long periods.\nJob Type: Full-time", 
        "location": "Chattanooga, TN", 
        "date": "2017-04-23 23:17:58.405201", 
        "type": " Full-time"
    }, 
    "41": {
        "salary": 0, 
        "title": "Information Technology Specialist", 
        "url": "/company/Mercury-Technology-Development/jobs/Information-Technology-Specialist-829ceb1b40f33e9e?fccid=0e73008820d457d5", 
        "company": "Mercury Technology Development", 
        "summary": "Stravinski\n are looking for an \nInformation Technology Specialist\n who is motivated to balance professional customer service with IT technical knowledge.\nThis exciting position will be within \nMercury Technology Development (MTD), a Stravinski Company (American Canyon, CA),\n an innovative software development and technical support organization. \nMTD\n specializes in maintaining, deploying, and developing software for managing, tracking and reporting warehouse-logistics along with business-as-usual support for \nStravinski Companies\n , performing a wide range of duties from installing, configuring, and maintaining enterprise hardware and software that supports all \nStravinski\n operations to developing custom applications to suit business needs.\nUnder the direction of the IT and Software Development Managers, the ideal candidate will be responsible for:\nIT Support Activities\nProvide timely support for a team on energetic non-technical operations team\nResolve user and system issues\nDesign procure and deploy hardware and software solutions to support growing business needs\nResolve trivial user issues with professionalism\nMaintain a record of Moves, Adds and Changes within the companies\nDocument tasks performed and create user tutorials\nOther duties as assigned by management\nSoftware Development Support Activities\nMaintaining and deploying applications and resources to cloud based development and production environments\nCreating and maintaining development and production environments\nDocumenting processes and procedures and changes\nTroubleshooting connectivity and performance issues\nResearch and implement solutions to problems that arise as part of day to day operations\nOther duties as assigned by management\nDesired Experience\nHands on experience with network routing and switching protocols\nExperience with Windows, Linux, Android and Apple operating systems on both Desktop and server environments\nManage and purchase hardware and software procurement as mandated by business case\nManage Internet, Telephony, and WAN connectivity services\nTroubleshoot network issues\nExperience with Azure, Office 365, Exchange server (2013 and above), Amazon Web Services, and Remote Monitoring and Management platforms\nUnderstanding of Enterprise Information policies and procedures\nIT Security Best Practices\nDesired Soft Skills\nUnderstand challenges posed by provider of white glove customer service\nDemonstrate professionalism and courtesy with customers at all times\nResolve issues in a clear, courteous, and straight-forward manner\nStrong analytical, research and problem solving skills\nStrong team player with a can-do attitude\nTravel\nThere will be an intermittent need to travel to the Headquarters in Madera, California to attend meetings or resolve technical issues. Any urgent situation may mandate such travel at short notice.\nAbout Stravinski Companies\nStravinski\n began as a general contractor in 1986. Since that time, \nStravinski\n has constructed manufacturing plants, warehouses and distribution facilities, industrial facilities, shopping centers, medical complexes, office complexes, schools, and heavy concrete foundations to name just a few.\nStravinski\n offers a competitive compensation package commensurate with experience, along with comprehensive benefits including medical, dental and vision insurance, 401K, vacation, and paid holidays.\nJob Type: Full-time", 
        "location": "American Canyon, CA", 
        "date": "2017-04-20 23:18:04.277584", 
        "type": " Full-time"
    }, 
    "1": {
        "salary": 50000.0, 
        "title": "Full Time Helpdesk Associate", 
        "url": "/company/NextGen-Realty/jobs/Full-Time-Helpdesk-Associate-745f62d9dcca8d74?fccid=1510517ca4d395ce", 
        "company": "Boston Tech Firm", 
        "summary": "About this Job\nUs: A fast paced, high tech, multi faceted company. We span multiple physical offices and occupy a large web presence. We thrive to maintain a friendly, open, and fun atmosphere that our staff love to show up to.\nYou: A technology enthusiast who thrives in a constantly evolving environment. You should be interested in learning new software, as well as working with new hardware. You should be able to maintain calm and composure in the instance where everything may be on fire, and even be excited about running straight forward into a challenge. You must be great with people, patient with those who are less technically inclined than you, and willing to help people learn how to work with tech better.\nResponsibilities:\nProvide first level technical support to our employees and contractors both on-site and remotely.\nHandle the creation and maintenance of all accounts, including Active Directory, Hosted Exchange, etc.\nResponsible for new PC setups, virus removal, software updates, and hardware incidents.\nOperating system support for Windows 7/10.\nEffectively communicate technical issues, ticket flows, and project execution with CTO and CFO.\nContribute findings and troubleshooting documentation to knowledge portal.\nUpdate documentation with hardware information, password changes, etc.\nQualifications:\nProven ability to effectively interact with end-users (lay persons) in identifying and resolving technical issues\nUnique ability to work with both business and technical minded people to plan and execute against project timelines and deliverables\nAn understanding of TCP/IP Networking Protocols and Procedures, all relevant Windows Workstation, Operating Systems, all relevant Windows Office products\nPrior experience in a technical support role, IT sales, or call center environment\nA passion for customer service and technology, delivering exceptional support to end-users\nAbility to multi-task across clients, industries, and technologies, while maintaining an appropriate level of professionalism and composure\nWe have multiple locations, and travel between locations to deliver equipment is sometimes required. A reliable vehicle is a big plus.\nA working knowledge of the following is necessary to perform daily activities:\nActive Directory Users and Computers\nGroup policy\nDNS\nDHCP\nFile and Print Services\nMicrosoft Office Applications\nExperience with VLANs, VPN, VMWare, FreePBX, or Linux a big plus.\nJob Type: Full-time\nSalary: $45,000.00 to $55,000.00 /year\nJob Location:\nBoston, MA 02134\nRequired experience:\nActive Directory: 1 year\nHelpdesk: 1 year\nWindows Networking: 1 year\nDNS: 1 year\nDHCP: 1 year", 
        "location": "['Boston, MA 02134 ', '(Allston-Brighton area)']", 
        "date": "2017-04-21 23:14:34.657279", 
        "type": " Full-time"
    }, 
    "5": {
        "salary": 45000.0, 
        "title": "IT Specialist", 
        "url": "/company/Chips-And-Bits-IT/jobs/IT-Specialist-7197e72e8728fa5b?fccid=e2dd7bd2046f08b2", 
        "company": "Chips And Bits  IT", 
        "summary": "We are a Growing Small Business looking for people to grow with us. Looking for the person who loves to solve problems, come to the rescue, Jack of all trades, looks forward to challenges, great customer service, and professionalism.\nWe are a multi-faceted technology solutions company, we take on all tasks big and small.\nPrevious experience in IT preferred but not required.\nBig opportunity for growth!!\nJob Type: Full-time\nSalary: $30,000.00 to $60,000.00 /year\nRequired experience:\nIT: 2 years", 
        "location": "Las Vegas, NV 89146", 
        "date": "2017-04-19 23:14:48.043868", 
        "type": " Full-time"
    }, 
    "9": {
        "salary": 0, 
        "title": "IT Computer Systems Administrator", 
        "url": "/company/Solidus-Technical-Solutions/jobs/IT-Computer-System-Administrator-e4fc11bd54eedb07?fccid=44faf6c171b2e52d", 
        "company": "Solidus Technical Solutions", 
        "summary": "Solidus is seeking a Systems Administrator. The successful candidate will support a team researching and prototyping leading-edge, laser and quantum optical communications technologies. Current areas of research supported include single-photon detector arrays, coherent modems, integrated photonic circuits, and novel modulation and coding approaches. This research is enabled by a well-maintained network of Windows, Linux, and Mac OS personal computers, servers, network attached storage devices, and specialized laboratory equipment.\nThe Systems Administrator will be responsible for procuring, configuring, and maintaining the Optical Communication Technology group's computing, data storage, and networking hardware/software. These responsibilities include off-loading and expediting the group's support requests from the on site helpdesk. The successful candidate will also responsible for complying with security policies set forth by the Information Security Dept. and research sponsors.\nRelevant hardware includes nearly 50 desktop and notebook PCs, as well as several rack-mounted servers, running Windows 7 Enterprise, Linux (CentOS 6 & 7), and Mac OS. Some computers operate in laboratories connected to instruments and prototype equipment or have data acquisition cards installed. The system administrator will assist group members configure device drivers, install engineering software, archive data, and provide general technical support.\nRequirements:\n- US Citizenship and the ability to obtain a DoD Secret Clearance\n- MS with at least 8 years of system administration experience; A degree in an information technology related field, although additional experience may compensate for the lack of a degree\n- Strong interpersonal and communication skills\n- A solid understanding of Windows, Linux, Mac and network administration (including OS installation and patching\n- Ability to write Bash, Python, VBScript, or Windows PowerShell scripts\n- Liaison with on site Information Services and Security Services Departments to comply with security requirements\n- Strong problem-solving skills\n- Self-directed, eager to learn, and works well alone or in a team\n- Can present to an internal audience on hardware/software issues and security policies\n- Ability to write purchase justifications\nAdditionally Desired:\n- Virtual machine support (including ESX Server)\n- Program and group server management and configuration support (including Active Directory account management)\n- Private network support (including hardware, policy) and compliance with information security requirements\nApplicants selected must meet eligibility requirements for access to classified information. U.S. Citizenship may be required. Solidus is an Equal Opportunity Employer and participates in E-Verify. NOTICE OF AFFIRMATIVE ACTION PLAN FOR INDIVIDUALS WITH DISABILITIES, DISABLED VETERANS AND OTHER PROTECTED VETERANS. It is the policy of this Company to seek and employ qualified individuals at all locations and facilities, and to provide equal employment opportunities for all applicants and employees in recruiting, hiring, placement, training, compensation, insurance, benefits, promotion, transfer, and termination. To achieve this, we are dedicated to taking affirmative action to employ and advance in employment qualified individuals with disabilities, disabled veterans, and other protected veterans. The objective in adopting the Affirmative Action Programs is to place qualified individuals with disabilities, disabled veterans and other protected veterans in all job classifications. These Affirmative Action Programs are available for inspection by any applicant or employee by contacting the Company's EEO Coordinator, in the Human Resources office, Monday through Friday, 8am to 5pm", 
        "location": "Lexington, MA 02420", 
        "date": "2017-04-19 23:15:15.368494", 
        "type": ""
    }, 
    "77": {
        "salary": 72500.0, 
        "title": "IT Field Technician/Engineer", 
        "url": "/company/Swift-Systems,-Inc./jobs/IT-Field-Technician-Engineer-c12af8a841f19a18?fccid=fa8278df4f78ceba", 
        "company": "Swift Systems Inc", 
        "summary": "Do you want to join a strong engineering team at one of the best places to work in Frederick & Montgomery County?\nWe are Swift Systems, and our continued organic growth means we are looking for Systems Engineers to join us. We offer a great compensation and benefits package and a work environment which values honesty, transparency and dedication. We invest in our people, because they are what makes us who we are.\nWe demand excellence, discipline and great customer skills. We reward hard work and dedication. We want the best, and we won’t settle for less, because our clients are used to getting excellence and we intend to keep it that way. Interested?\nAbout Us\nSwift is a leading managed IT service provider in Maryland. We provide dynamic infrastructure services and data management solutions, helping businesses grow and make the most of the opportunities facing them. We deliver predictable costs and reliable IT services to help organizations resolve business challenges.\nRequirements for this Job\nYou will be dealing with our clients, so great customer skills are an absolute must! You must have strong personal responsibility and integrity, and the ability to consistently deliver and follow through under pressure.\n**Please Note**\n This position requires 50-75% travel primarily within the Montgomery County I-270 corridor with office hours in the Frederick main office. Reliable transportation is required. We reimburse mileage at standard rates.\nYou will need 3+ years of general IT experience with skills in the following:\nCommunications,\nCustomer Service,\nDesktop support and administration,\nServer administration,\nNetworking,\nFirewalls,\nProject planning,\nInternet infrastructure,\n**Prior MSP experience is strongly preferred.\nWishlist skills: \nSophos & Sonicwall firewalls\nAVG Managed Workplace\nTechnical documentation\nCompensation & Benefits\nWe pay for the best, with a great salary and more!\nSalary for this position is $60k to $85k depending on qualifications and experience\n401(k) with matching\nEmployee profit sharing plan\nHeavily subsidized healthcare for you and your family, including dental and vision coverage\nHealth Savings Account with a 2-for-1 contribution match up to IRS limits\n24 days of flexible PTO per year\nYou will gain exposure and great experience working with Swift customers in a variety of sectors, including manufacturing, local government, medical, non-profit, and biotech.\nPrincipals only, no calls please. Drugs & alcohol screening will be required. US citizens and permanent residents only, no temporary residents. EOE.\nJob Type: Full-time\nSalary: $60,000.00 to $85,000.00 /year", 
        "location": "Rockville, MD", 
        "date": "2017-04-14 23:19:47.879734", 
        "type": " Full-time"
    }, 
    "76": {
        "salary": 35000.0, 
        "title": "IT Support Associate", 
        "url": "/company/P&I-Supply-Co./jobs/IT-Support-Associate-620c56c4c7617597?fccid=f55f21711ccbf309", 
        "company": "P&I Supply Co", 
        "summary": "JOB DESCRIPTION\nThe IT Support Associate is a hands-on position that supports the operation of the IT functions of the organization. The IT Support Associate will work closely Data Systems Manager to identify, recommend, assist in developing, help with implementing, and support cost-effective technology solutions for all aspects of the organization. The IT Support Associate assist in the planning of IT-related activities of the organization, as well as the supporting the ongoing performance of applications and networks.\nRESPONSIBILITIES: \nResponsible for Tier 1 Technical Support of all internal end users for all technology equipment, and software. This includes, all operating systems, internally used third party software, computer equipment, office and cell phones, and tablets.\nAssist in the administration of the database, system, and network, including access control, user account maintenance, software updates, and performance optimization.\nMaintains IT resources (servers, switches, routers, firewalls, PCs, etc.) through training, experience, research, and troubleshooting. Solves IT issues.\nOffer support to customer end users for P&I Storeroom Management Software. Make suggestions for enhancements and changes to the software based on end user needs.\nSupport all warehouse staff in the use of all P&I internal applications, such as the Min/Max app, P&I Scanning, Pick Track, and other customized software.\nSet up new equipment for new and existing associates, such as computers, laptops, phones, tablets, and desk phones.\nKeeps up with current trends and developments within the field of computers and networking to keep the corporation updated and current with technology.\nAssist in the training of all technology matters to company associates.\nPerforms other related duties as assigned.\nQUALIFICATIONS: \nBachelor Degree in Computer Science or related field and at least Two years of directly related experience, OR equivalent combination of education and experience.\nIT certification a plus. Prior experience retail/wholesale ERP system also a plus.\nPersonal qualities of integrity, credibility, and steadfastness; a proactive, hands-on strategic thinker.\nWeekend or evening work is expected as needed based on the needs of the department or business.\nStrong interpersonal skills to demonstrate teamwork, leadership and flexibility while working with all levels of the organization.\nMust be able to solve problems with tact and diplomacy.\nDetail oriented and confident working with data, numbers, and other business information.\nAbility to work independently and prioritize projects.\nStrong multitasking skills in an environment with frequent deadlines.\nOperate standard office equipment.\nProficient in PC based Microsoft Office, especially with Microsoft Excel.\nAbility to learn new software and technology quickly and efficiently.\nExperience with Prelude/ADS helpful.\nWork effectively under pressure.\nGood time management and task management skills.\nAbility to communicate professionally with internal and external customers.\nSkilled in both written and oral communications.\nBasic knowledge of networking a plus.\nJob Type: Full-time\nSalary: $35,000.00 /year\nRequired education:\nBachelor's\nRequired experience:\nIT Support: 1 year", 
        "location": "Evansville, IN 47711", 
        "date": "2017-04-21 23:19:47.608625", 
        "type": " Full-time"
    }, 
    "75": {
        "salary": 50000.0, 
        "title": "IT Generalist", 
        "url": "/company/Team-Technology/jobs/IT-Generalist-a03b004b73b1e268?fccid=40197a9c732b1dc2", 
        "company": "Team Technology", 
        "summary": "Team Technology is looking for a well-rounded IT candidate for a client. In this position, you will be assisting with an ERP implementation (TEAM will handle most of the implementation), as well as handling all of the day to day for the company. Learning how to program the Machines in a manufacturing setting. This is a great position with a lot of room to grow. Starting out as a IT generalist, and developing into Director of IT.\nDesired Skills:\nPLC programming\nExperience working with an ERP system\nAbility to think ahead, and prevent issues from becoming problems\nEducation:\nDegree in Technology/Certs in Technology/Work experience in this field\nJob Type: Full-time\nSalary: $50,000.00 /year", 
        "location": "Kings Mountain, NC", 
        "date": "2017-04-07 23:19:44.100236", 
        "type": " Full-time"
    }, 
    "74": {
        "salary": 40000.0, 
        "title": "IT Technician", 
        "url": "/company/SalesPad/jobs/IT-Technician-7cbde58db5c8cd36?fccid=1100aa24b4534a55", 
        "company": "SalesPad LLC", 
        "summary": "Job Description\nThe IT Technician will assist the Network Administrator on a variety of internal IT tasks. They will be responsible for answering questions and resolving hardware/software issues for employees of SalesPad.\nJob Responsibilities\nIn essence, the IT Technician is responsible for helping to ensure the smooth running of SalesPad’s internal infrastructure. Tasks will vary depending on the assignment but will typically include the following:\nAssist with day to day operations and internal issue escalation or resolution;\nIT Troubleshooting and fielding IT related questions;\nPrioritize and manage several open cases at one time;\nNew employee hardware/software setup (new computer deployment);\nVirtual machine setup / deployment;\nAsset Management;\nAssist with developing documentation and procedures regarding SalesPad’s infrastructure.\nJob Requirements\nExperience working in a Client Help Desk setting (preferred not required);\nModerate networking skills and issue diagnosis;\nWorking knowledge of Windows 8/10 Operating System;\nHardware knowledge and experience with wireless systems;\nWorking knowledge of VMware or Hyper-V virtual machine systems;\nResults orientated attitude and strong interpersonal skills;\nExcellent written and verbal communication; strong attention to detail.\nJob Type: Full-time\nSalary: $40,000.00 /year\nRequired experience:\nInformation Technology: 1 year", 
        "location": "Grand Rapids, MI 49546", 
        "date": "2017-04-17 23:19:36.250512", 
        "type": " Full-time"
    }, 
    "73": {
        "salary": 0, 
        "title": "Desktop Support-Level 1", 
        "url": "/company/Community-Health-Center-of-the-North-Country/jobs/Desktop-Support-Level-7bd2fa30268f3347?fccid=e060742d7a2290c9", 
        "company": "Community Health Center of the North Country", 
        "summary": "This position assists staff with technical support of desktop computers, applications and related technology, with particular focus on eClinical Works and Open Dental application support. This support includes analysis and troubleshooting of the application, specification, installation and testing of computer systems and peripherals within established guidelines. Employee will also assist in the maintenance and testing and troubleshooting of network servers, and associated equipment.\nEducation and Experience:\nAA/AS degree in computer related field plus 0 -2 years’ experience supporting Windows XP, Vista and 7 desktop/laptop PCs\nExperience troubleshooting hardware issues and replacing hardware on both desktop and laptop PCs\nA+ Certification a plus\nExperience installing software, patches, updates on Desktops, Laptops, Servers\nExperience troubleshooting basic network, software, printing problems\nCustomer Service Experience a must\nJob Type: Full-time\nRequired education:\nAssociate", 
        "location": "Canton, NY 13617", 
        "date": "2017-04-17 23:19:32.577043", 
        "type": " Full-time"
    }, 
    "72": {
        "salary": 71880.0, 
        "title": "IT Infrastructure Technician", 
        "url": "/company/NextGen-Information-Services,-Inc./jobs/IT-Infrastructure-Technician-6052b1f980255b7d?fccid=36ee1b4ad396c665", 
        "company": "NextGen Information Services Inc", 
        "summary": "Job Title: IT Infrastructure Technician\nJob Location: Cleveland, OH 44125\nJob Duration: ASAP - 04/12/2018\nHours: 8am to 4:30pm Mon-Fri\nJob Description: \nLocal candidates only\nPOSITION PURPOSE: \nThe IT Infrastructure Technician is responsible to implement and provide hands-on support for standard Information Technology Solutions (applications, servers, network, PC’s) for a Site organization.\nThe role is also responsible to participate in regional and global networks, to leverage existing information technology solutions and enforce corporate standards.\nKEY RESPONSIBILITIES: \nProvide support for assigned site(s) out of scope computers by completing installations, performing maintenance and/or upgrades and scheduled back-ups.\nUnderstand the interaction between the OS and applications.\nAnticipate the impact of changes and resolve problems as new OS’s hardware or software versions are deployed.\nManage all IT assets at site, including Out of Scope PCs, printers, network equipment, and software licenses.\nBe the contact for server support group in the event they need someone to physically work on the servers.\nDAILY DUTIES: \nRespond to and resolve out of scope tickets.\nEnsure conference room equipment is maintained and operational. Provide equipment support for meetings as need arises.\nEscalate issues and concerns to IT Leader in a timely fashion.\nInstall out of scope PC’s, using the standard corporate image.\nProvide site based PC support for Out of Scope machines, including hardware troubleshooting and repair, install updates/patches as needed, provide software support.\nInterface with vendors to resolve software\\hardware issues for Out of Scope PCs.\nFunction as a member of project teams for site or corporate IT initiatives, ensure the complete implementation\nAssist in development and delivery of training for users for new or existing programs\\initiatives.\nMINIMUM REQUIREMENTS: \nAssociates degree or equivalent preferred\nMinimum of 3 years applied experience in Information Technology within a business or manufacturing site\nDemonstrated ability to effectively work with and through others\nPrevious experience and demonstrated ability to interface with business, function, or site for IT issues\nDemonstrated technical skills including\nExpert level ability with PC’s and software installations\nWindows 2007 Operating System\nWorking knowledge of the Microsoft Office Suite\nKnowledge of tape backup systems.\nLevel 1 troubleshooting of TCPIP\nExperience with remote desktop software\nJob Type: Contract\nSalary: $30.00 to $41.88 /hour\nRequired education:\nAssociate\nRequired experience:\nInformation Technology: 3 years", 
        "location": "Cleveland, OH 44125", 
        "date": "2017-04-12 23:19:30.376279", 
        "type": " Contract"
    }, 
    "71": {
        "salary": 0, 
        "title": "IT Trainer/Application Support Specialist", 
        "url": "/company/Hodgson-Russ-LLP/jobs/IT-Trainer-Application-Support-Specialist-075b3ddeb7ccddc0?fccid=cf07809279fc507f", 
        "company": "Hodgson Russ LLP", 
        "summary": "Are you a skillful communicator with the ability to effectively train others in computer software and systems orientation? We invite you to consider a great career opportunity with Hodgson Russ LLP.\nWe are seeking an enthusiastic and motivated individual to join our Information Technology team in the Buffalo office who is responsible for conducting end-user technology training, preparing end-user documentation, assisting the User Services Manager in all functions necessary in developing a successful training program. You will be responsible for the development, integration, testing and documenting of new software applications introduced into the firm. You would interact with all levels of the organization.\nQUALIFICATIONS:\nAssociates degree in Information Technology, Computer Science or related field;\nSix years’ experience developing and delivering training in networked environment with multiple software packages;\nExperience working in a networked environment with multiple software packages;\nIn-depth knowledge of a wide range of software applications including MS Office, legal-sector specific software and a facility for mastering new software and applications;\nDemonstrable knowledge of the principles of adult learning and their application to technical training in a business setting;\nSkillful communicator, able to listen actively and convey complex concepts in simple terms, both verbally and in writing;\nAbility to work well in a highly collaborative environment where team members support and learn from each other and coordinate to deliver the best outcome for the client;\nA life-long learner with the drive to stay up-to-date on developments with the business and technical field;\nCustomer focused, able to demonstrate specific instances of outstanding client service, including identifying and anticipating needs, delivering to expectations and follow through; and\nProficient in learning new material and excellent coaching ability.\nWe offer an excellent compensation package, including a competitive base salary and comprehensive benefits including both a 401(k) plan and a defined benefit pension plan.\nEOE\nJob Type: Full-time\nRequired education:\nAssociate\nRequired experience:\nIT Support: 6 years", 
        "location": "Buffalo, NY", 
        "date": "2017-04-21 23:19:30.063433", 
        "type": " Full-time"
    }, 
    "70": {
        "salary": 52500.0, 
        "title": "IT Support Technician", 
        "url": "/company/QMES/jobs/IT-Support-Technician-2edad98eb74002a9?fccid=103da31a2ee74d4d", 
        "company": "QMES", 
        "summary": "**Must have at least 3 years IT helpdesk and/or IT systems administrator experience to apply**\nQMES is a rapidly growing Durable Medical Equipment (DME) company. We provide superior customer service 24-hours a day to clients located in nine states in the northeast region of the U.S. We distribute and service medical equipment to hospitals, rehab/skilled nursing facilities, and directly to our patients in the home setting.\nKEY AREAS OF RESPONSIBILITY: \nResponsible for system and user administration for the entire organization.\nManage deployment, administration, and support for corporate servers/desktops/laptops/mobile devices\nField incoming help requests from end users\nAccess and install appropriate upgrades, patches, drivers, etc.\nPerform hands-on fixes, including software/ hardware install and upgrade, implementing file backups, and configuring systems and applications\nKNOWLEDGE AND SKILLS: \nWindows Server 2003/2008R2/2012R2 Windows XP/7/10 expertise\nSolid knowledge of TCP/IP, DNS, DHCP and LAN, Windows AD\nKnowledge of computer hardware, imaging of computers, and basic computer maintenance\nFamiliarity with general PBX concepts and VoIP phone system administration\nApplication support experience with Microsoft Office products including Office 365 administration.\nFamiliarity with a virtualized environment, HyperV, VMWare.\nStrong written/oral communication and interpersonal skills\nEDUCATION AND WORK EXPERIENCE: \nAssociates degree (A. A.) from two-year college; or four years IT Support experience and/or training; or equivalent combination of education and experience.\nMicrosoft Certifications a plus\nJob Type: Full-time\nSalary: $50,000.00 to $55,000.00 /year\nRequired education:\nAssociate\nRequired experience:\nTCP/IP: 2 years\nWindows Server 2008: 2 years\nIT Support: 3 years\nDHCP and LAN: 1 year", 
        "location": "Great Neck, NY", 
        "date": "2017-04-19 23:19:28.934439", 
        "type": " Full-time"
    }, 
    "79": {
        "salary": 45000.0, 
        "title": "IT Support Specialist", 
        "url": "/company/Princeton-Communications/jobs/IT-Support-Specialist-d130376d5be295d5?fccid=4a0971055f037a5d", 
        "company": "Princeton Hosted Solutions", 
        "summary": "You will be working with our customers regarding our VoIP phone systems. Trouble shooting issues, training on features and general technical support.\nJob Type: Full-time\nSalary: $40,000.00 to $50,000.00 /year\nJob Location:\nHaddonfield, NJ\nRequired education:\nHigh school or equivalent\nRequired experience:\nIT Support: 2 years", 
        "location": "Haddonfield, NJ 08033", 
        "date": "2017-04-21 23:19:55.232024", 
        "type": " Full-time"
    }, 
    "78": {
        "salary": 0, 
        "title": "PC Technician", 
        "url": "/company/mgsoft--net/jobs/PC-Technician-d890a037e0c99f52?fccid=5ac1e7d0c506f278", 
        "company": "mgsoft-net", 
        "summary": "mgsoft-net, Founded in 1999, is a leading IT provider for Beaver County and surrounding areas. We provide IT Support, PC Sales and Support, as well as maintaining Servers and IT infrastructure and Web Design and Development. Our work environment is often fast-paced, and we are first and foremost a company that values the loyalty of our customers.\nWe are looking for someone to join our team who possesses a strong desire to excel in delivering turn-key IT Support for our customers. We would like to speak with you if you match all (or most) of the following items:\nPrior Customer Service experience required\nDemonstrate proficiency in knowledge of Windows OS environments\nDemonstrate knowledge of Mac OS X environments (not required, but a plus)\nDemonstrate knowledge of the following software: Microsoft Office / Office 365, Google Chrome, Microsoft Edge\nMultitasking is a must\nKnowledge of PC hardware is a plus\nWe offer competitive pay, Health Insurance, paid vacation, and mileage reimbursement for our field technicians. If you feel you qualify and would like to be a part of a winning team that continues to excel, please contact us today to discuss your candidacy.\nJob Type: Full-time\nJob Location:\nBeaver, PA 15009\nRequired education:\nAssociate\nRequired experience:\nCustomer Service: 1 year", 
        "location": "Beaver, PA 15009", 
        "date": "2017-04-12 23:19:54.069339", 
        "type": " Full-time"
    }
}