{
    "24": {
        "job_url": "/company/NextGen-Realty/jobs/Full-Time-Helpdesk-Associate-745f62d9dcca8d74?fccid=1510517ca4d395ce", 
        "company": "Boston Tech Firm", 
        "job_summary": "About this Job\nUs: A fast paced, high tech, multi faceted company. We span multiple physical offices and occupy a large web presence. We thrive to maintain a friendly, open, and fun atmosphere that our staff love to show up to.\nYou: A technology enthusiast who thrives in a constantly evolving environment. You should be interested in learning new software, as well as working with new hardware. You should be able to maintain calm and composure in the instance where everything may be on fire, and even be excited about running straight forward into a challenge. You must be great with people, patient with those who are less technically inclined than you, and willing to help people learn how to work with tech better.\nResponsibilities:\nProvide first level technical support to our employees and contractors both on-site and remotely.\nHandle the creation and maintenance of all accounts, including Active Directory, Hosted Exchange, etc.\nResponsible for new PC setups, virus removal, software updates, and hardware incidents.\nOperating system support for Windows 7/10.\nEffectively communicate technical issues, ticket flows, and project execution with CTO and CFO.\nContribute findings and troubleshooting documentation to knowledge portal.\nUpdate documentation with hardware information, password changes, etc.\nQualifications:\nProven ability to effectively interact with end-users (lay persons) in identifying and resolving technical issues\nUnique ability to work with both business and technical minded people to plan and execute against project timelines and deliverables\nAn understanding of TCP/IP Networking Protocols and Procedures, all relevant Windows Workstation, Operating Systems, all relevant Windows Office products\nPrior experience in a technical support role, IT sales, or call center environment\nA passion for customer service and technology, delivering exceptional support to end-users\nAbility to multi-task across clients, industries, and technologies, while maintaining an appropriate level of professionalism and composure\nWe have multiple locations, and travel between locations to deliver equipment is sometimes required. A reliable vehicle is a big plus.\nA working knowledge of the following is necessary to perform daily activities:\nActive Directory Users and Computers\nGroup policy\nDNS\nDHCP\nFile and Print Services\nMicrosoft Office Applications\nExperience with VLANs, VPN, VMWare, FreePBX, or Linux a big plus.\nJob Type: Full-time\nSalary: $45,000.00 to $55,000.00 /year\nJob Location:\nBoston, MA 02134\nRequired experience:\nActive Directory: 1 year\nHelpdesk: 1 year\nWindows Networking: 1 year\nDNS: 1 year\nDHCP: 1 year", 
        "job_date": "2017-04-21 13:55:10.002855", 
        "location": "['Boston, MA 02134 ', '(Allston-Brighton area)']", 
        "job_title": "Full Time Helpdesk Associate"
    }, 
    "25": {
        "job_url": "/company/Charter-Schools-USA/jobs/Certified-IT-Technician-Growing-Company-562bb1ec67cc5d1d?fccid=ea87c29eed942efb", 
        "company": "Charter Schools USA", 
        "job_summary": "Charter Schools USA is an Education Management Organization with over 8,000 employees which manages over 80 high-performing schools across 7 states! We've experienced 200% growth over the course of the last three years and plan to continue this trend!\nJOB PURPOSE\nTo maintain system availability, ensure effective user support, and maintain software applications to manage CSUSA operations.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nMaintain system availability of critical and non-essential business systems\nProvide customer support through onsite presence and remote access.\nMonitor support requests to determine larger-scale issues.\nInform supervisor of any issue out of the scope or skill range of Technician promptly\nMaintain disaster recovery and prevention procedures.\nParticipate, successfully, in the training programs offered to increase the individual’s skill and proficiency related to the assignments.\nReview current developments, literature and technical sources of information related to job responsibility.\nEnsure adherence to good safety procedures.\nPerform other duties as delegated by Technician Supervisor.\nFollow federal and state laws, as well as company policies.\n**MAY PERFORM OTHER DUTIES AS ASSIGNED**\nDISCLAIMER\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel so classified.\nSKILLS AND KNOWLEDGE\nDemonstrates enthusiasm and commitment toward the job and the mission of the company; supports company’s goals and strategic priorities\nWorks and interacts with staff and relates to individuals at all levels of the organization; relates to individuals at all levels. As unique situations present themselves, the incumbent must be sensitive to corporate needs, employee goodwill, and the public image.\nAbility to organize and manage multiple priorities.\nAbility to consistently be at work, to arrive on time, to follow instructions, to respond to management direction and solicit feedback to improve performance.\nStrong customer orientation.\nEstablishes excellent interpersonal skills between all constituents: being courteous, professional, and helpful; demonstrates high level of interpersonal skills to handle sensitive and confidential situations. Position continually requires demonstrated poise, tact and diplomacy.\nDemonstrates excellent oral (including presentations), written, interpersonal (active listening), skills and ability in negotiating and influencing; great phone etiquette.\nHigh performance teams and a strong team player.\nStrong track record for analyzing complex problems/issues, identifying patterns and recommending creative solutions.\nProactive and takes initiative. Thinks creatively.\nDrives projects to completion. Insists on highest level of quality.\nJob Requirements\nCompTIA A+ Certification Required\nHigh School, Technical School or equivalent combination of education and experience.\n1+ year of experience and/or training in the field related to the title of the position.\nStrong technical ability.\nMust be able to transport self to various facility sites as required. If using own motor vehicle, must possess a valid driver’s license and proof of insurance that meets the minimum standards of the State.\nExperience with complex systems and/or in an educational environment preferred; mastery in Student Information System (SIS) and other software used in the organization.\nCommitment to company values.\nSuch alternatives to the above requirements as CSUSA may find appropriate and acceptable.\nJob Type: Full-time\nJob Location:\nKissimmee, FL 34744\nRequired education:\nHigh school or equivalent\nRequired experience:\nInformation Technology: 1 year", 
        "job_date": "2017-04-19 13:55:10.194724", 
        "location": "Kissimmee, FL 34744", 
        "job_title": "A+ Certified IT Technician for a Growing Company! (Boggy Creek)"
    }, 
    "26": {
        "job_url": "/company/Secure-Mission-Solutions,-a-Parsons-Compay/jobs/Junior-System-Administrator-a86590a0cc1c1ec8?fccid=cd9c930a56de25a9", 
        "company": "Secure Mission Solutions a Parsons Company", 
        "job_summary": "We are looking for a Junior-level System Administrator for our Security R&D Team. Our focus is on developing security-related applications and tools. You would join a small group of system administrators who support the development & QA. Our environment is nearly 100% linux (CentOS mostly), virtualized with VMware, with attached SAN storage. Tools we use include: puppet, nagios, splunk, jenkins, perl, python, PHP, Java, just to name a few.\nWe are looking for a self-motivated person who wants to learn and grow on the team. Because of our team's makeup and our ever-changing needs, there are many opportunities to branch out into software development as well.\nLocation: Anywhere in the US. This is a 100% REMOTE work-from-home position.\nHIRING REQUIREMENTS:\n* US Citizenship\n* Active DoD Security Clearance\n* Linux+ certification within 3 months\n* Security+ certification within 3 months\nRequired Skills: strong linux system administration experience, strong command-line skills, solid understanding of host & network security, good communication skills, self-learner, ability to work independently\nBonus skills: VMWare, Puppet, Jenkins, scripting (bash, perl, python, etc).\nEmail if interested. DO NOT APPLY if you do not have an active security clearance. This is a requirement for hiring and we cannot hire anyone without one.\nJob Type: Full-time\nSalary: $75,000.00 /year\nRequired experience:\nLinux system administration: 2 years\nRequired language:\nEnglish\nRequired licenses or certifications:\nSecurity+\nLinux+\nActive DoD Security Clearance", 
        "job_date": "2017-04-19 13:55:11.957503", 
        "location": "Alexandria, VA", 
        "job_title": "Junior System Administrator"
    }, 
    "27": {
        "job_url": "/company/City-of-Bradenton/jobs/PC-Technician-a8002cfc7267da4b?fccid=9dca2d60299c295e", 
        "company": "City of Bradenton", 
        "job_summary": "FLSA Status: \n Non-Exempt, On-call 24x7\nSupervision Exercised: \n None; ability to manage projects and resources where required.\nSupervision Received: \n Minimal supervision received; position requires self-management and initiative.\nGeneral Purpose of the Position: \n The purpose of this position is to implement personal computers, peripherals, desktops and phones and provide technical support on both. Where appropriate, this position will also provide application and technical support. This position also helps the City of Bradenton maximize its investment in technology by implementing solutions to the furthest extent.\nEssential Duties and Responsibilities: \nConfigure and install personal computers, peripherals and phones to City standards.\nMaintain technical procedures and storage room(s) in a manner to support the implementation of equipment.\nResponsible for the appropriate disposal of computers.\nComplete appropriate paperwork for inventory (i.e. hardware and software) and purchasing.\nWhere necessary, interface with vendors for equipment repair.\nMake recommendations for purchases and cascading equipment.\nProvide application and technical support.\nAnalyze user requests and develop reports to support business needs.\nEstablish and maintain effective and professional working relationships with team members, management, customers, and vendors.\nPromote courtesy and professionalism throughout the City of Bradenton.\nSkills and Physical Abilities Required: \nProvide excellent customer service.\nPossess in-depth knowledge of computer operations (i.e. hardware and software).\nPossess working knowledge of Microsoft applications and the internet.\nDemonstrate sound verbal and written communication skills, good troubleshooting and analytical skills.\nAbility to make sound decisions, demonstrate flexibility, and work with people at all levels of the organization.\nAbility to present technical information in a non-technical manner.\nAbility to physically move computer equipment.\nComputer Equipment and Software Requirements: \n Microsoft operating systems and desktop applications. Crystal Report Writer. Technical operations of computer hardware and operating systems. Basic knowledge of networking and security.\nEducation and Experience Required: \n Bachelor’s Degree with three (3) years of experience providing desktop support. Possession of and ability to maintain a valid Florida driver’s license.\nPreferred: \n Bachelor’s Degree in Technology.\nPay Grade: \n 114 \nSalary Range: Minimum: \n $16.03/hour \nMaximum: \n $24.05/hour\nJob Type: Full-time\nSalary: $33,000.00 to $50,000.00 /year\nRequired education:\nBachelor's", 
        "job_date": "2017-04-11 13:55:12.797636", 
        "location": "Bradenton, FL", 
        "job_title": "PC Technician II"
    }, 
    "20": {
        "job_url": "/company/Robertson-Technologies/jobs/Expert-Level-PC-Tech-Support-40eb5da86ebc6369?fccid=dd8d17a25dab5982", 
        "company": "Robertson Technologies", 
        "job_summary": "Minimum of 5 years of previous IT support experience.\nWe are looking for a professional and well-rounded IT Support Consultant.\nWhat you need to know:\nWindows 7 and Windows 10 desktop support\nWindows Server 2008 and 2012, including AD administration\nPrinciples of DNS, DHCP, general networking\nMS Office, including Office 365 Preference given to those with additional knowledge of:\nBasic SharePoint 2010 administration\nStrong Excel skills Additional requirements:\nExcellent written and verbal communication skills\nStrong attention to detail\nFriendly personality, with willingness to take direction from other team members and clients\nComfortable interacting with all levels of client staff, from entry-level workers to C-level executives\nExcellent organizational skills\nAbility to rapidly troubleshoot problems, including quickly finding solutions on the Internet\nWe prefer someone with an existing Microsoft certification\nJob Type: Full-time\nRequired education:\nAssociate\nRequired experience:\nHelp Desk: 5 years", 
        "job_date": "2017-04-14 13:54:51.098812", 
        "location": "Boston, MA", 
        "job_title": "Expert Level PC Tech Support III"
    }, 
    "21": {
        "job_url": "/company/Charter-Schools-USA/jobs/Certified-IT-Technician-Growing-Company-0051d0788534f9a7?fccid=ea87c29eed942efb", 
        "company": "Charter Schools USA", 
        "job_summary": "Charter Schools USA is an Education Management Organization with over 8,000 employees which manages over 80 high-performing schools across 7 states! We've experienced 200% growth over the course of the last three years and plan to continue this trend!\nJOB PURPOSE\nTo maintain system availability, ensure effective user support, and maintain software applications to manage CSUSA operations.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nMaintain system availability of critical and non-essential business systems\nProvide customer support through onsite presence and remote access.\nMonitor support requests to determine larger-scale issues.\nInform supervisor of any issue out of the scope or skill range of Technician promptly\nMaintain disaster recovery and prevention procedures.\nParticipate, successfully, in the training programs offered to increase the individual’s skill and proficiency related to the assignments.\nReview current developments, literature and technical sources of information related to job responsibility.\nEnsure adherence to good safety procedures.\nPerform other duties as delegated by Technician Supervisor.\nFollow federal and state laws, as well as company policies.\n**MAY PERFORM OTHER DUTIES AS ASSIGNED**\nDISCLAIMER\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel so classified.\nSKILLS AND KNOWLEDGE\nDemonstrates enthusiasm and commitment toward the job and the mission of the company; supports company’s goals and strategic priorities\nWorks and interacts with staff and relates to individuals at all levels of the organization; relates to individuals at all levels. As unique situations present themselves, the incumbent must be sensitive to corporate needs, employee goodwill, and the public image.\nAbility to organize and manage multiple priorities.\nAbility to consistently be at work, to arrive on time, to follow instructions, to respond to management direction and solicit feedback to improve performance.\nStrong customer orientation.\nEstablishes excellent interpersonal skills between all constituents: being courteous, professional, and helpful; demonstrates high level of interpersonal skills to handle sensitive and confidential situations. Position continually requires demonstrated poise, tact and diplomacy.\nDemonstrates excellent oral (including presentations), written, interpersonal (active listening), skills and ability in negotiating and influencing; great phone etiquette.\nHigh performance teams and a strong team player.\nStrong track record for analyzing complex problems/issues, identifying patterns and recommending creative solutions.\nProactive and takes initiative. Thinks creatively.\nDrives projects to completion. Insists on highest level of quality.\nJob Requirements\nCompTIA A+ Certification Required\nHigh School, Technical School or equivalent combination of education and experience.\n1+ year of experience and/or training in the field related to the title of the position.\nStrong technical ability.\nMust be able to transport self to various facility sites as required. If using own motor vehicle, must possess a valid driver’s license and proof of insurance that meets the minimum standards of the State.\nExperience with complex systems and/or in an educational environment preferred; mastery in Student Information System (SIS) and other software used in the organization.\nCommitment to company values.\nSuch alternatives to the above requirements as CSUSA may find appropriate and acceptable.\nJob Type: Full-time\nJob Location:\nJacksonville, FL 32246\nRequired education:\nHigh school or equivalent\nRequired experience:\nInformation Technology: 1 year\nRequired license or certification:\nCompTIA A+", 
        "job_date": "2017-04-19 13:54:58.908881", 
        "location": "['Jacksonville, FL 32246 ', '(Sandalwood area)']", 
        "job_title": "A+ Certified IT Technician for a Growing Company! (Coastal)"
    }, 
    "22": {
        "job_url": "/company/Veterans-Transportation-Services/jobs/Help-Desk-Technician-0309ad9157100b48?fccid=f36619651fb3cb14", 
        "company": "Veterans Transportation Services", 
        "job_summary": "The Help Desk Technician maintains and monitors end-user workstations and productivity on local area network using SysAid Help Desk. Perform a variety of maintenance, software installation, end-user support and training tasks to ensure end-user workstations and network performance meet company and user requirements. Provide support to staff on all company-supported applications. Troubleshoot computer problems, determine source and advise on appropriate action. Complete application project-based work. Perform responsibilities in accordance with all company standards, policies and procedures.\nResponsibilities: \nAdministers end-user workstations and supports end-user activities utilizing TCP/IP on a primarily Microsoft Windows-based local area network (LAN).\nInvestigates user problems and identifies their source; determines possible solutions; tests and implements solutions.\nInstalls, configures and maintains personal computers, Windows networks, workstations, file servers, network cabling, and other related equipment, devices and systems; adds or upgrades and configures disk drives, printers and related equipment.\nPerforms and/or oversees software and application installation and upgrades.\nMaintains site licenses for department/organization.\nPlans and implements network security, including maintaining firewalls, configuring VPN, managing host security, file permissions, file system integrity, and adding and deleting users.\nTroubleshoots networks, systems and applications to identify and correct malfunctions and other operational difficulties.\nDevelops and conducts various training and instruction for system users on operating systems and other applications; assists users in maximizing use of networks and computing systems.\nMaintains confidentiality with regard to the information being processed, stored or accessed by the end-users on the network.\nAssists personnel of other departments as a computer resource.\nProvides computer orientation to new and existing company staff.\nMange and install Symantec end user workstation and updates.\nMinimum Qualifications: \nDegree in related field and 3-5 years of networking experience, or equivalent applicable work experience.\n1-2 years help desk experience.\nAbility to communicate technical information to nontechnical personnel.\nAbility to install, configure and maintain personal computers, networks and related hardware and software.\nKnowledge of computer and/or network security systems, applications, procedures and techniques.\nAbility to identify and resolve computer system malfunctions and operations problems.\nSkill in organizing resources and establishing priorities.\nExcellent verbal and written communication skills.\nAbility to learn and support new systems and applications.\nJob Type: Full-time\nRequired experience:\nhelp desk: 3 years", 
        "job_date": "2017-04-10 13:55:01.861426", 
        "location": "Waltham, MA", 
        "job_title": "Help Desk Technician"
    }, 
    "23": {
        "job_url": "/company/Accelerated-IT-Services-Inc./jobs/Helpdesk-Support-59739c0e812f802a?fccid=7ae5fabbcf34ce71", 
        "company": "Accelerated  IT  Services Inc", 
        "job_summary": "Duties include, but are not limited to, the following: \nTo professionally and courteously respond to requests through the use of calls, e-mail messages, ticket updates for the medical and provider community including physicians, surgeons, Administrators, etc.\nMonitoring of ITSM queues.\nAccurately document the steps performed when troubleshooting the issue and assist the user with resolution using existing procedures and documentation.\nUse multiple tools for account validation, access permissions, and file promotions.\nDevelop or update training materials and guides for users.\nRequested Qualifications\n12 Months experience on call center duties, taking calls and dealing with customers and taking Level 2 application support related issues.\n12 months experience documenting issues and the resolutions.\n12 Months experience with troubleshooting supported web browser versions, applications and issues.\n12 Months developing training materials and guides.\n12 Months experience troubleshooting access permissions and individual account processing.\n12 Months in a staff support role.\n12 Months of working in a team environment.\nJob Location:\nAlbany, NY\nRequired experience:\nHelpdesk Support: 1 year\nhelpdesk ticketing system: 1 year", 
        "job_date": "2017-04-22 22:55:06.201643", 
        "location": "Albany, NY", 
        "job_title": "Helpdesk Support"
    }, 
    "28": {
        "job_url": "/rc/clk?cmp=B%40kerBytes,-LLC&ti=IT+System+Technician&jk=f2e837785ad87109&fccid=92898fc5d66af730", 
        "company": "B@kerBytes LLC", 
        "job_summary": "We are seeking to hire an entry level computer and systems technician. Experience and prior knowledge of Microsoft Office products, browser and internet related applications, mobile devices, PC and Mac operating systems, computer hardware and other general technical experience is preferred but not required. Applicants must have strong communication skills and able to operate in a team oriented environment with customer service being a top priority.\nThis is an excellent opportunity to learn the IT tech field and to gain knowledge and professional growth with on the job training.\nApplicants must pass regular drug screening, background check and have a clean driving record.\nJob Type: Full-time", 
        "job_date": "2017-04-19 13:55:22.132309", 
        "location": "Daphne, AL 36526", 
        "job_title": "IT Systems Technician"
    }, 
    "29": {
        "job_url": "/rc/clk?jk=8740a90f2ba4ae6b&fccid=3c2c6dad8f1c58d5", 
        "company": "Flexsolv Networks Inc", 
        "job_summary": "Bachelors Degree or equivalent work experience required.\nSpecific Skills:  * Circuit Migrations  * Network Circuit Installs  * Network Circuit Disconnects  * ADR Activities  * Point Code Mapping/Un-mapping Project Validations  * Trunk Disconnects Project Validations  * Backhaul Disconnects Project Validations  * Re-terms  * Inter-Dependencies identified on Optimization Plan T1/DS3/Ethernet Routing (ART)  * Validation of diversity (911, SS7 and SCA) of identified circuits.  * Switch Translations Class 4, 5, International and Domestic  * Emergency Services Testing, PSAP Contact, and Configurations * IP Configurations and Acceptance Testing.  * SS7 Knowledge\nGeneric skills:\nProficiency in computer skills and the ability to navigate complex systems is a necessity. Candidate must demonstrate working in a team environment and as an individual. Candidate must build strong cooperative working relationships, identify and resolve system/process issues for internal and external groups that impact our work. Candidates must have the ability to communicate both written and orally with peers, process partners, and management in an educated manner. Ability of taking ownership of issues through to resolution and being accountable for results and/or follow-ups. Candidate must be able to manage projects. General telecom knowledge of network routing architecture and components/elements is required. Experience using Microsoft Office applications and ability to understand telecom oriented applications in order to perform work assignments.\nLocation: Overland Park, KS\nRate: $20/hour\nDuration: 18 months\nRequired education:\nBachelor's", 
        "job_date": "2017-04-21 13:55:22.411361", 
        "location": "Overland Park, KS", 
        "job_title": "Network Technician"
    }, 
    "4": {
        "job_url": "/company/CompuCom/jobs/IT-Field-Service-Technician-4e26a113c66c01a9?fccid=37a1bf601ebbfd51", 
        "company": "CompuCom", 
        "job_summary": "IT Field Service Technician\nThe candidate shall be a self-starter, have exceptional customer service proficiencies and uses communication as an expansive tool to achieve an excellent customer experience. The candidate must conduct their efforts in a professional, businesslike manner and effectively communicate, as well as provide continuous quality in their daily task achievements. The candidate will be self-motivated with excellent time management skills with the ability to complete projects ahead of schedule.\nCandidate will support clients IT/Data needs, provide prompt action, support and resolution for daily technical requirements. The candidate will be consistent with documentation, tracking and monitoring issues, providing notes and feedback as well as make in-field decisions for a positive result.\nPerformance Responsibilities\nExceptional Customer Service and relationship building competence\nTravel within a radius of 75 to 100+ miles daily in a specific route\nUnderstand AC/DC and backup power concepts\nExcellent time management and reporting skill\nFamiliar with various operating systems (e.g. - Windows OS, OSX, Linux/Unix)\nManage triage, troubleshooting and resolution to scope IT equipment\nOccasionally works at heights of 20’ to 25’, lift equipment training provided\nDocument efforts, issues and resolutions, close cases/tickets daily\nExperience desired in copper and fiber cabling and various terminating connectors\nProficient communicator with emotional intelligence insight for explaining IT terminologies at the client’s level of understanding\nInsight to POS, PC, Printers, Thin Clients, AP’s, Servers, Network switch equipment\nPreferred Experience and Certifications\nOne year IT technical support experience\nA+ CompTIA certification preferred or upon conclusion of probationary period\nJob Type: Full-time\nSalary: $30,000.00 to $40,000.00 /year\nJob Location:\nColumbia, MO\nRequired experience:\ntechnical support: 1 year\nRequired licenses or certifications:\nA+ Certified\nDriver's License", 
        "job_date": "2017-04-20 13:54:14.034614", 
        "location": "Columbia, MO", 
        "job_title": "IT Field Service Technician"
    }, 
    "8": {
        "job_url": "/company/Private-Green-Bay-Manufacturing-Company/jobs/Desktop-Support-Technician-db8f27cc0da0fa24?fccid=466834f54eb85fb7", 
        "company": "Alwin Manufacturing", 
        "job_summary": "Essential Duties and Responsibilities:\nField IT Support calls and tickets related to end user issues\nEnd user orientation and training related to IT\nSoftware installs and software troubleshooting\nPC troubleshooting, repairs and set up of new desktops and laptops\nrun, terminate and test network cabling\nSet up and troubleshoot mobile devices (cell phones, tablets, etc.)\nAbility to set up Network printers\nPart time position 10-15 hours per week during 1st shift.\nJob Type: Part-time\nSalary: $12.50 /hour\nRequired experience:\nDesktop Support: 1 year", 
        "job_date": "2017-04-21 13:54:22.263115", 
        "location": "Clintonville, WI", 
        "job_title": "Desktop Support Technician"
    }, 
    "59": {
        "job_url": "/company/Candeo/jobs/IT-Support-Specialist-e0b9e676891660fd?fccid=2014a5bb02056df8", 
        "company": "Candeo", 
        "job_summary": "The Information Technology (IT) Support Specialist will report to the Director of Business Planning (DBP) and assist with organization’s responsibility to employees and Information Technology. This person will be responsible for providing timely support to all internal and remote end-users on workstations, hardware, software, network, and peripheral devices within company standards and guidelines. In addition to performing patching, upgrades, and hardware maintenance on workstations and other end-users devices; and maintain the inventory of technology hardware and software. This is a full-time position with a starting range of $15-18 an hour and full benefits.\nRequirements: \nAssociates Degree in computers, MIS, or a related IT field or equivalent combination of education and experience\nOne year of working experience in a Microsoft Windows network environment\nExperience with Windows 10, 8 or 7; Windows Server (2008 or above), computer networking, helpdesk support\nExposure to Active Directory, Group Policy and computer hardware repair\nExposure with Office 365 and Cisco Meraki admin portals preferred\nProficient in Microsoft Office or other applications software\nCustomer service attitude with a high level of organization and willingness to learn\n*\nAll applicants must pass an extensive background check. Candeo reviews Sex Offender, Dependent Adult and Child Abuse registries along with performing a criminal history check. All applicants must retain a satisfactory driving record, a working vehicle and auto insurance.\nJob Type: Full-time\nRequired education:\nAssociate\nRequired experience:\nIT Support: 1 year", 
        "job_date": "2017-04-20 13:56:47.291142", 
        "location": "Johnston, IA 50131", 
        "job_title": "IT Support Specialist"
    }, 
    "58": {
        "job_url": "/company/Duluth-Area-Association-of-REALTORS/jobs/Software-Support-IT-Administrator-7a697a954781947f?fccid=924ba0accb1974ce", 
        "company": "Duluth Area Association of REALTORS", 
        "job_summary": "Job Location:\nDuluth Area Association Of Realtors\n4031 Grand Ave Duluth, MN 55807\nJob Title: Software Support/Administrator\nWork Week: Full-Time Weekdays\nBenefits: Health Insurance, PTO, Holiday, Flexible Environment\nRequired Skills:\nPersonal Commitment to Customer Service\nExcellent Written and Verbal Communication\nAbility to take ownership of projects with team input\nWork well as part of a small team\nAbility to be self-taught with external support\nExcellent General Computer Skills\nDesired Skills:\nGeneral Computer Hardware/Software, Setup, Maintenance and Troubleshooting\nWebsite Support/Management (HTML/CSS/PHP)\nWindows 7 / 10\nBonus Skills:\nProgramming Knowledge (C++/C#, Objective-C, Java, BASH scripting, etc)\nScripting Languages\nMySQL Knowledge\nNetwork Hardware/Software Support\nDatabase Administration\nJob Description: Small local business is hiring a full-time help desk administrator/software support professional. This close-knit team believes in what they do and is committed to working towards goals together while taking time out to share a laugh or six. Flexible and accommodating work environment.\nDuties:\n*Provide technical support for industry specific software to persons at all skill levels\n*Conduct hands-on training to groups of up to 20 people\n*Attend meetings regarding system support and technology advancement opportunities\n*Monitor and maintain systems within the organization\n*Other duties as requested by the CEO\n*Occasional travel required.\nCompensation based on experience.\nSend resume, references and salary requirements.\nJob Type: Full-time\nJob Location:\nDuluth, MN 55807\nRequired education:\nHigh school or equivalent", 
        "job_date": "2017-04-13 13:56:46.411085", 
        "location": "Duluth, MN 55807", 
        "job_title": "Software Support/IT Administrator"
    }, 
    "55": {
        "job_url": "/rc/clk?cmp=Marlite%C2%AE,-a-Division-of-Verzatec&ti=IT+System+Specialist&jk=6b5b15b4423aefa9&fccid=4bd9511c46fbdc93", 
        "company": "u    Marlite\\xae a Division of Verzatec", 
        "job_summary": "JOB SUMMARY:\nThe IT Systems Specialist I is responsible for assisting with and maintaining IT projects and computer/server/application support. This position will also have responsibility for end-user support and satisfaction.\nREPORTING RELATIONSHIP:\nThis position reports directly to the IT Director.\nESSENTIAL FUNCTIONS:\nThe IT Systems Specialist I is responsible and accountable for:\nPlanning, implementing, and maintaining all hardware, software and infrastructure used for PC/LAN, communications, systems operations, or desktop use. This includes but is not limited to desktop support, networking support, printer support, and software support (MS Office, etc.)\nResponsible for server support and Active Directory support\nResponsible for data back-up of LAN environment.\nTelephone system maintenance and support.\nPlanning, implementing, and maintaining security systems/firewalls and policies to provide requisite protection against viruses and other destructive or invasive software, and unauthorized or malicious access of the PC/LAN or protected data, from both inside and outside the organization.\nResponsible for troubleshooting and maintaining network equipment.\nWeekend / Night backups, patching, and other process work as necessary.\nEnsures that critical services are accessible at all times.\nEnsures all service and/or technical support subscriptions/licenses are current.\nPerform other duties as assigned.\nDIMENSIONS:\nNumber of supported PC’s inclusive of data collection devices 150 approx.\nNumber of phones 75 approx\nNumber of printers 20 approx\nMINIMUM REQUIREMENTS:\nBachelor’s Degree in Computer Science or two to five years on the job experience in LAN support.\nJob Type: Full-time\nRequired education:\nBachelor's\nRequired experience:\nIT: 3 years", 
        "job_date": "2017-04-19 13:56:31.695912", 
        "location": "Dover, OH", 
        "job_title": "IT Systems Specialist I"
    }, 
    "54": {
        "job_url": "/company/Mrs.-Grissom's-Salads/jobs/IT-Support-Specialist-811df1675645ca12?fccid=65c497624aac6c44", 
        "company": "Mrs Grissoms Salads", 
        "job_summary": "Mrs. Grissom's Salads in Nashville, TN is accepting resumes for a Desktop Support Specialist to trouble shoot and problem solve all software and hardware systems for a rapidly growing production and distribution company. The Desktop Support Specialist is responsible for conducting setup, maintenance, modification and configuration of onsite and remote systems including handheld systems, desktops, tablets, laptops, printers, phone systems, and servers.\nSample of Responsibilities: \nProvides technical support and guidance to onsite and remote users\n-Setup, configure, and support the deployment of end user devices and software -Recommends/Implements upgrades, patches, applications and equipment\n-Practice 5S with all technical equipment including server room and IT cabinets\n-Keep up to date with the latest data protection and security threats\nPosition Qualifications and Requirements: \nDegree in Information Technology related field or comparable experience in the Information Technology field\n-Tablet and/or handheld programming and support is ideal\n-Ability to effectively support users and solve technical problems directly and remotely\n-Ability to support web environments\n-Ability to support (S)FTP(S) server\n-Knowledge in server management (Windows/Linux)\nPhysical capability\n-Ability to use step stools, ladders or other equipment necessary to install and repair technical systems\n-Ability to lift items up to 35lbs -Excellent communication, people and organization skills -Excellent diagnosis, problem-solving and resolution skills\n-Our Microsoft-based infrastructure includes Windows 7 desktops, Windows Server 2008 on both physical and Hyper V virtual servers, MS SQL.\nMust have a valid driver's license - Limited local travel will be required\nJob Type: Full-time\nSalary: $14.00 to $17.00 /hour\nJob Location:\nNashville, TN\nRequired experience:\nIT Support: 1 year\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-21 13:56:24.909517", 
        "location": "Nashville, TN 37204", 
        "job_title": "IT Support Specialist"
    }, 
    "57": {
        "job_url": "/company/Ocean-Pines/jobs/IT-11b47dfa10291eea?fccid=a88b9f8ea14efd7b", 
        "company": "Ocean Pines", 
        "job_summary": "Technical support position to manage computer systems, and AV equipment throughout several restaurants and entertainment venues. Must be willing to work nights and weekends. Benefits available.\nJob Type: Full-time\nSalary: $15.00 to $20.00 /hour\nRequired experience:\nIT Support: 1 year", 
        "job_date": "2017-04-23 13:56:46.240180", 
        "location": "Berlin, MD 21811", 
        "job_title": "IT / AV Support"
    }, 
    "56": {
        "job_url": "/company/City-of-Berkeley,-MO/jobs/Information-Technology-Help-Desk-Technician-56f5c8a4c11f2a84?fccid=a3656b38fe595eb8", 
        "company": "City of Berkeley MO", 
        "job_summary": "DEPARTMENT\n : ADMINISTRATION\nPOSITION\n : INFORMATION TECHNOLOGY (IT) HELP DESK TECHNICIAN\nIT Help Desk Technician\nType: \n Permanent\nAppointment: \n Full Time\nSalary/Pay Rate: \n Depending on Experience\nPosted Date: \n 04/04/2017\nClosing Date: \n Open until filled\nThe City of Berkeley is accepting applications for the position of IT Help Desk Technician in the City’s Administration Department\nAreas include assisting and training staff; computer systems, installing hardware and software, and connecting printers and other peripherals; responding to Help Desk queries and logging tickets; inventorying computer hardware and accessories; addressing complaints and resolving problems; and forwarding appropriate incidents to the IT Manager.\nEXPERIENCE: \n Two of the five years of experience in a lead or technical supervisory capacity. Project management experience\nLICENSES OR CERTIFICATIONS REQUIRED\nGraduation from a college or university with an Associate’s Degree in Computer Technology required. Bachelor's degree in computer science or a related field is preferred.\nFour (4) years’ experience in troubleshooting computer hardware and software, component isolation and replacement, and system installation, preferred.\nDesires someone with Project management experience and possess Microsoft Certified Solutions Associate (MCSA), and Microsoft Certified Solutions Expert (MCSE) certificates highly desirable. Must maintain certifications renewals at all times.\nJob Type: Full-time\nRequired education:\nAssociate", 
        "job_date": "2017-04-14 13:56:33.746629", 
        "location": "City of Berkeley, MO", 
        "job_title": "Information Technology (IT) Help Desk Technician"
    }, 
    "51": {
        "job_url": "/company/GL-VENEER-CO-INC./jobs/T-Specialist-dc60876d35cea079?fccid=cc473eadb2d9d438", 
        "company": "GL VENEER CO INC", 
        "job_summary": "A Los Angeles based company with 40 years in the wood-working industry is currently seeking I.T. Candidates w/ 1-3 years of Syspro experience. The ideal candidate will have the following skill-set:\nExperience in deployment and configuration of ERP Solution, Syspro\nExperience in configuring and customizing Syspro Modules.\nAssist with and follow the software development lifecycle and lead projects. Analyze document business requirements, developing project plans and managing projects to deadlines.\nAssist with the design and development of application modules & database structures\nEnsure that all applications conform to system and programming standards and are appropriately documented.\nAssist with project communication amongst team and with other project participants using methods appropriate to audience and type of communication.\nLiaison between the IT team and internal stakeholder(s) and external customer(s)\nProject Management experience to plan and execute projects with internal and external resources including vendor management.\nAssists managing hardware, software, and networking\nMaintain, manage, troubleshoot and upgrade computer systems and servers for performance and security related issues\nProvide end user support for IT related issues, hardware and software.\nSQL, MS Access, and Crystal Reports experience a plus.\nBi-lingual English/Spanish helpful\nOther duties may be assigned.\nBENEFITS:\nMEDICAL\nDENTAL\nVISION\n401(k)\nSUPPLEMENTARY BENEFITS\nPAID HOLIDAYS\nJob Type: Full-time\nSalary: $50,000.00 to $80,000.00 /year\nJob Location:\nLos Angeles, CA\nRequired education:\nBachelor's\nRequired experience:\nSyspro: 2 years\nRequired language:\nSpanish", 
        "job_date": "2017-04-23 13:56:10.103785", 
        "location": "Los Angeles, CA", 
        "job_title": "I.T. Specialist"
    }, 
    "50": {
        "job_url": "/company/iConnect-POS/jobs/Technical-Support-Specialist-5d538cfc5574155e?fccid=5a50eefa9a5741f9", 
        "company": "iConnectPOS", 
        "job_summary": "Technical Support Specialist\niConnect POS - Denver, CO\n \n$16 an hour\nThe iConnect technical support team provides professional, courteous and prompt tier one technical support to our customers and partners. This includes problem definition, prioritization, analysis, recreation and resolution. This position exists to ensure client satisfaction by providing answers and resolutions to incoming support inquires in a timely and effective manner. A key part of this position will be to identify problems and document/communicate any issues with our development team.\nResponsibilities: \nTake ownership for resolving client support issues from case logging through management of escalation or resolution\nMaintain a proactive approach with clients who with the goal of delivering satisfaction and great experience on calls and emails\nProvide cheerful customer service while helping answer questions and resolve issues\nDetail any bugs or issues in the JIRA system\nRespond to client cases and field inquiries in a timely and effective manner by answering known questions and reproducing straightforward technical problems\nEffectively use escalation procedures as necessary\nFacilitate issue resolution by leveraging internal experts when necessary\nOther job related duties as assigned\nQualifications\nPrefer 2+ years’ experience in hardware and software troubleshooting, analysis and resolution\nStrong oral and written communication skills required\nKnowledge and experience with iOS, windows, and Android\nAbility to solve a wide range of technical problems\nAbility to analyze data and/or situations containing both identifiable and unidentifiable factors\nProven ability to work within a team environment, multi-task, and adapt to change\nABOUT US: \niConnect POS is a cloud Point of Sale solution designed to help single and multi-location businesses sell more, and create loyal customers. Our passion is to empower Retailers, Health and Beauty professionals, Quick Service, and mobile businesses with simple, beautiful software. iConnect POS combines point of sale on any device with optional back office features to manage, grow, and know your business. Our customers include Entrepreneur Magazine’s fastest growing franchises like SEVA Beauty, Retailers like Arteriors Home, Traeger Grills, & Murad Inc, and thousands of small businesses on main street America. iConnect POS puts mPOS in the hands of local and national businesses everywhere, so that owners can sell more and focus on growing other areas of business. In simple terms, we are replacing the traditional cash register. For more than a century, these clunky boxes have taken up valuable counter space at salons, retail stores, and coffee shops, and have served as a costly impediment to small business ownership. We are disrupting this industry through our cloud-based architecture, amazing customer service and intuitive software that delivers the innovative features and analytics small business owners need. We’re proud of the culture we’re building, and our ideal candidate embodies our distinct core values of friendly professionalism, and has a strong desire to succeed.\nJob Type: \n Full-time\nSalary: \n $15.00 /hour\n*Required experience*\n1 year Software & Hardware experience\nAny networking a plus\nEducation level\n : High school or equivalent\nJob Type: Full-time\nSalary: $16.00 /hour\nRequired education:\nHigh school or equivalent\nRequired experience:\nhardware: 1 year\nTechnical Support: 1 year", 
        "job_date": "2017-04-21 13:56:09.941979", 
        "location": "Greenwood Village, CO", 
        "job_title": "Technical Support Specialist"
    }, 
    "53": {
        "job_url": "/company/DISYS/jobs/Help-Desk-Support-Specialist-41da7579c4b575ba?fccid=2ac1f406582acd9b", 
        "company": "DISYS", 
        "job_summary": "Ideal candidate will be proficient in matter management and document management applications\n .\nHard worker with a strong drive to succeed/excel.\nSoftware skills\n :\nproficient in Microsoft applications including Outlook, Word, Excel, PowerPoint and Visio.\nAbility to train others on how to perform tasks/skills.\nStrong problem solving ability.\nMust be Proficient in SharePoint\n1+ year of experience providing technical support\nstrong customer service skills/background\nProvides routine to moderately complex technical support for a business unit.\nIs the first point of contact for technical issues and initiatives related to all systems, tools and applications used by the work group.\nDuties are varied and include user access and other security administration issues, production support and troubleshooting, application maintenance, monitoring and/or balancing.\nSupports application installations and upgrades.\nCoordinates and executes User Acceptance Testing, assisting in writing test scripts.\nDocuments user application procedures, updating as changes occur.\nConducts and may develop user training.\nParticipates in user needs assessment and works with technology partners on business requirements and specifications.\nMonitors and coordinates proper maintenance and/or replacement of user equipment.\nSalary: $20.00 /hour\nRequired experience:\nHelp Desk: 2 years\nShare: 1 year", 
        "job_date": "2017-04-21 13:56:20.242893", 
        "location": "Des Moines, IA", 
        "job_title": "Help Desk Support Specialist"
    }, 
    "52": {
        "job_url": "/company/3-Point-Teks/jobs/IT-Field-Technician-26df6a367eb6863e?fccid=bdbfd40e715c17ac", 
        "company": "3 Point Teks", 
        "job_summary": "3 Point Teks is a minority and woman-owned Information Technology and Telecommunication company with a well-known reputation for excellent work, quick turnaround times and competitive service rates designed to fit customers budget. The company was started as a partnership in 2011 and is registered as a limited liability company in Maryland and Washington, DC. We offer services to private companies, small to large size corporations, K-12, colleges & universities, governments, non-profit organizations, retail, healthcare and more.\nThis position is a per job (on-call) basis. Calls are typically dispatched 24-72 hours before the job is scheduled. All jobs are paid at a flat rate or hourly depending on our customer. Typical hourly rate is $50.00 for the first hour and $20.00 every additional hour. Flat rate jobs can range from $50.00-$200 per site.\n \nDepending on the volume of work you can receive one call a week or multiple calls per week.\nPay-outs are paid on the 1st and 15th of each month via check.\nMust have your own tools and transportation!!!\nJobs are typically within 40 mile range of the DMV area\nMain Line of Services\nTV Monitor Setup and Mount Installation\nNetwork Cabling/Wiring\nVoIP Phone installs\nPOS Installation/Setup\nTech Requirements\nAccurately diagnose problems\nAbility to interact and communicate clearly with customers.\nExcellent communication skills\nStrive for complete customer satisfaction at all times.\nAbility to work quickly/efficiently while meeting tough quality standards.\nAbility to work independently with minimal supervision.\nWorks well with others\nAbility to plan and complete the work while utilizing the standard tools of the trade.\nRequired Tools\nRS323 serial to USB cable\nButt Set\nCable Tester\nCell Phone\nConsole Cable\nCrimper\nCrossover cable\nDrill with standard bit set\nFish tape\nLadder\nLaptop 6ft minimum\nNeedle Nose Pliers\nPatch Cable\nPunch Down Tool\nPush Rods\nScrewdriver Set\nJob Type: Contract\nSalary: $50.00 to $200.00 /day", 
        "job_date": "2017-04-06 13:56:13.561523", 
        "location": "Hyattsville, MD 20785", 
        "job_title": "IT Field Technician"
    }, 
    "88": {
        "job_url": "/company/Legacy-Medical-Management/jobs/Mid-Level-Computer-Technician-106fdd6dd077c95c?fccid=d29bd1a7c8990eb4", 
        "company": "Third Helix Technology", 
        "job_summary": "Work Schedule: \n Work Schedule: Monday through Friday, 8:00am – 5:00pm. One hour for lunch. Extended hours may be required on occasion.\nClassification\n : Full-time salary position with Exempt status\nTravel\n : Travel to surrounding businesses or area may be required depending on client needs.\nLocation\n : Oklahoma City, OK (At this time the company does not provide relocation assistance.)\nJob Summary: \n Establishes, plans, and coordinates the overall development, implementation, deployment and operation of information systems and technology solutions for business needs and goals. Identifies, analyzes, and proposes new information technologies and systems to improve business processes and decision making for different departments and determines ways to meet business objectives by modifying existing or developing new processing systems. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks to include managing the system hardware, operating systems, software, and procedures that adhere to the organization’s values and goals.\nSupervision Received: \n Reports to Operation Manager and Owner of Third Helix\nRequired Essential Functions: \nLeads and directs the work of others.\nProvide overall I.T. governance for the organization and clients.\nWide degree of creativity and latitude is expected to accomplish long term goals.\nFamiliar with a variety of concepts, practices, and procedures.\nPlan, implement and monitor changes in infrastructure configurations.\nConfigure hardware and install new software.\nDevelop and maintain system standards.\nMonthly reporting required by clients and their measurements of metrics per individual contractual obligations.\nPerform daily backup operations.\nPerform system monitoring for security purposes.\nMonitor service desk for tickets and assist with assignment to appropriate queue.\nCommunicate regularly with executive management.\nDevelop best practices and written documentation for all I.T. maintenance.\nOversee the provisioning of the end-user services.\nManage hardware and software vendor relationships.\nAdhere to all policies and procedures.\nEnsures technical compliance with HIPAA regulations and standards.\nRequired Education: \n BA/BS in related field of Information Systems, Business, Communications or related field with 3-5 years’ experience. Please read entire job description any resumes not fulfilling requirements and needs listed on job description will be not be accepted.\nPhysical Requirements: \n Sitting for up to 2 hours at a time and lifting up to 20 pounds. May require work on hands and knees.\nSkills/Experience: \nTechnical knowledge of understanding modern business practices.\nExperience with organizational technology, standards and procedures, software and infrastructure.\nCustomer service orientated and experienced problem solver with critical thinking skills.\nStrong knowledge of Information Systems as applied to Management needs.\nStrong leadership skills for managing a team.\nAble to communicate effectively both verbally and through written documentation.\nIntricate knowledge of PC’s/laptops/printer/servers/cloud technology/mobile devices/office equipment\nTeam player, adaptable, and flexible in stressful situations.\nMust be organized and able to multitask with time management skills.\nMust be dependable and punctual.\nMust be able to identify organizational weaknesses and technology that can strengthen those areas.\nAbility to demonstrate competency in one of the following languages: vbscript, cscript, Visual Basic, C#, or Powershell\nCompetency in Network Management including routing concepts, firewall concepts, Unified Threat Management Concepts, backup methodologies and disaster recovery procedures, VLANs, Network Switching, VPN Networking, VIOP, Hyper-V and/or VMWare ESXi.\nCompetency in standard business operating systems and software including Windows desktop operating systems, Microsoft Office Suite, Internet Browsers, Centrally Managed AntiMalware Systems.\nExperience configuring and administering Windows Server operating systems, Corporate Email systems including Microsoft Exchange, and database management systems.\nFor questions or if unable or experiencing difficulty submitting resume, please contact Amanda at 580-233-1125\nJob Type: Full-time\nSalary: $60,000.00 /year\nJob Location:\nOklahoma City, OK\nRequired education:\nBachelor's\nRequired experience:\nInformation Technology (Computer Technician) preferably 3-5: 3 years\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-14 13:57:35.898811", 
        "location": "Oklahoma City, OK", 
        "job_title": "Mid-Level Computer Technician (I.T.)"
    }, 
    "89": {
        "job_url": "/company/Chips-And-Bits-IT/jobs/IT-Specialist-7197e72e8728fa5b?fccid=e2dd7bd2046f08b2", 
        "company": "Chips And Bits  IT", 
        "job_summary": "We are a Growing Small Business looking for people to grow with us. Looking for the person who loves to solve problems, come to the rescue, Jack of all trades, looks forward to challenges, great customer service, and professionalism.\nWe are a multi-faceted technology solutions company, we take on all tasks big and small.\nPrevious experience in IT preferred but not required.\nBig opportunity for growth!!\nJob Type: Full-time\nSalary: $30,000.00 to $60,000.00 /year\nRequired experience:\nIT: 2 years", 
        "job_date": "2017-04-19 13:57:40.301884", 
        "location": "Las Vegas, NV 89146", 
        "job_title": "IT Specialist"
    }, 
    "82": {
        "job_url": "/company/Home-Technology-Experts/jobs/Entry-Level-Technician-f78453aa148c99db?fccid=6533fc791365ed71", 
        "company": "Home Technology Experts", 
        "job_summary": "Install Tech I\nJob Description\nESSENTIAL DUTIES & RESPONSIBILITIES: \nThe ability to use hand and power tools in a safe and efficient manner.\nAssist with and perform installation tasks in a timely and quality conscious manner.\nDuties may include but are not limited to: Pulling cable, installing connectors, equipment mounting terminating wire\nPositive and effective interaction with internal and external customers.\nAbility to read and interpret electronic schematics and architectural blueprints.\nAssist with mechanical fabrication\nAbility to travel and work at various job sites. \nStarting from Southampton New York\nRequired Skill\nKNOWLEDGE, SKILLS AND ABILITIES REQUIRED: \nAbility to think and work independently and meet necessary deadlines.\nEffective interaction with employees, customers and colleagues.\nAttention to detail.\nAbility to work overtime when necessary.\nPC proficient Problem solving and troubleshooting skills.\nMust possess a valid driver’s license and be a safe driver.\nQUALIFICATIONS: \nBe able to regularly climb and work from ladders up to heights of 35 feet; lifting equipment, tools and materials and loading and unloading equipment weighing a minimum of 75 pounds.\nPHYSICAL DEMANDS: \nThe physical demands of this position are those that are necessary to meet the responsibilities and essential functions of this position. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions. This job description in no way states or implies that these are the only duties to be performed by this employee. He or she will be required to follow any other instructions and to perform any other duties requested by his or her supervisor.\nRequired Experience\nStriving for excellence in everything we do, Home Technology Experts is committed to honoring these core values:\nCharacter\n - Being honest and acting with integrity toward each other, our customers and ourselves.\nTeamwork\n - Working together, through the good and the bad, toward a common goal, and being jointly responsible for exceeding customer expectations.\nKnowledge\n - Continuously growing our business and technical expertise and sharing our knowledge for the benefit of others.\nResponsibility\n - -Being accountable for getting the job done right and doing whatever it takes for the growth and success of our team and our customers.\nRespect\n - Appreciating each person's value to the team and treating each other with courtesy and professionalism.\nJob Type: Full-time\nRequired education:\nHigh school or equivalent\nRequired experience:\nConstruction: 1 year\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-12 13:57:33.238695", 
        "location": "Southampton, NY 11968", 
        "job_title": "Entry Level Technician"
    }, 
    "83": {
        "job_url": "/company/P&I-Supply-Co./jobs/IT-Support-Associate-620c56c4c7617597?fccid=f55f21711ccbf309", 
        "company": "P&I Supply Co", 
        "job_summary": "JOB DESCRIPTION\nThe IT Support Associate is a hands-on position that supports the operation of the IT functions of the organization. The IT Support Associate will work closely Data Systems Manager to identify, recommend, assist in developing, help with implementing, and support cost-effective technology solutions for all aspects of the organization. The IT Support Associate assist in the planning of IT-related activities of the organization, as well as the supporting the ongoing performance of applications and networks.\nRESPONSIBILITIES: \nResponsible for Tier 1 Technical Support of all internal end users for all technology equipment, and software. This includes, all operating systems, internally used third party software, computer equipment, office and cell phones, and tablets.\nAssist in the administration of the database, system, and network, including access control, user account maintenance, software updates, and performance optimization.\nMaintains IT resources (servers, switches, routers, firewalls, PCs, etc.) through training, experience, research, and troubleshooting. Solves IT issues.\nOffer support to customer end users for P&I Storeroom Management Software. Make suggestions for enhancements and changes to the software based on end user needs.\nSupport all warehouse staff in the use of all P&I internal applications, such as the Min/Max app, P&I Scanning, Pick Track, and other customized software.\nSet up new equipment for new and existing associates, such as computers, laptops, phones, tablets, and desk phones.\nKeeps up with current trends and developments within the field of computers and networking to keep the corporation updated and current with technology.\nAssist in the training of all technology matters to company associates.\nPerforms other related duties as assigned.\nQUALIFICATIONS: \nBachelor Degree in Computer Science or related field and at least Two years of directly related experience, OR equivalent combination of education and experience.\nIT certification a plus. Prior experience retail/wholesale ERP system also a plus.\nPersonal qualities of integrity, credibility, and steadfastness; a proactive, hands-on strategic thinker.\nWeekend or evening work is expected as needed based on the needs of the department or business.\nStrong interpersonal skills to demonstrate teamwork, leadership and flexibility while working with all levels of the organization.\nMust be able to solve problems with tact and diplomacy.\nDetail oriented and confident working with data, numbers, and other business information.\nAbility to work independently and prioritize projects.\nStrong multitasking skills in an environment with frequent deadlines.\nOperate standard office equipment.\nProficient in PC based Microsoft Office, especially with Microsoft Excel.\nAbility to learn new software and technology quickly and efficiently.\nExperience with Prelude/ADS helpful.\nWork effectively under pressure.\nGood time management and task management skills.\nAbility to communicate professionally with internal and external customers.\nSkilled in both written and oral communications.\nBasic knowledge of networking a plus.\nJob Type: Full-time\nSalary: $35,000.00 /year\nRequired education:\nBachelor's\nRequired experience:\nIT Support: 1 year", 
        "job_date": "2017-04-23 13:57:34.728641", 
        "location": "Evansville, IN 47711", 
        "job_title": "IT Support Associate"
    }, 
    "80": {
        "job_url": "/company/Tennessee-State-University/jobs/PC-Technician-f7395b5fbc9bf1e4?fccid=1c726425dc9c40df", 
        "company": "Tennessee State University", 
        "job_summary": "APPLY ONLINE AT WWW.JOBS.TNSTATE.EDU\nJob Summary:\nKnowledge of computer operations, design techniques, and job control language. Knowledge of modern office practices and procedures. Ability to exercise good judgment in evaluating problem situations and in making decisions concerning hardware and software. Ability to establish and maintain work schedules. Ability to establish and maintain effective working relationships with other employees.\nMinimum Qualifications/Experience:\nIn depth knowledge of personal computers, servers, network equipment and software; working knowledge of Microsoft Windows OS and Apple OS. Ability to repair, maintain, and install computer equipment. Excellent communication and organizational skills. Ability to interact with a diverse group of users and managers. High school diploma with two (2) years of formal academic training in Computer Science, Information Systems, or related field. At least three (3) years of experience in computer repair/maintenance.\nJob Type: Full-time", 
        "job_date": "2017-04-19 13:57:26.557229", 
        "location": "Nashville, TN 37209", 
        "job_title": "P.C. Technician"
    }, 
    "81": {
        "job_url": "/company/AccelerateRPA/jobs/Associate-Technical-Consultant-49c1864ce0c4503a?fccid=f69aee709a57f28a", 
        "company": "AccelerateRPA", 
        "job_summary": "Associate Technical Consultant - Robotic Process Automation - Global Travel\nAccelerateRPA are looking for 10 additional members to join the team who have a passion for technology who are eager to pursue careers as Technical Consultants. You will be working on projects with large organizations all across the world.\nWe will provide you with thorough training during our 6-week training programme. During this time you will gain project experience and certification in world-leading RPA software. You will also learn about process mapping and business analysis.\nFollowing training, you will work on-site with one of our market leading clients. You will help them configure, develop and support their RPA solution. There is a large client facing element to this position, so it suits someone who enjoys interacting with others and who also has excellent analytical ability.\nAll travel costs and accommodation will be paid for when working on-site with a client.\nYour training and certification will also be paid for and we offer continuous support to all our consultants.\nWe are looking for people with the following:\n- Minimum Bachelors Degree level qualification\n- Excellent analytical ability\n- Passion for travel\n- Strong interest in technology (especially RPA)\nWhat we offer:\n- World leading training\n- Work experience with exceptional companies worldwide\n- Certification in cutting edge software\n- Paid for travel and accommodation\nIf interested in this exciting opportunity, please, send your resume ASAP.\nJob Type: Full-time\nSalary: $50,000.00 /year", 
        "job_date": "2017-04-21 13:57:28.074074", 
        "location": "Boston, MA", 
        "job_title": "Associate Technical Consultant - College Graduate"
    }, 
    "86": {
        "job_url": "/company/Medlinks-Cost-Containment/jobs/IT-Professional-09b5df4cc5faacc3?fccid=fc6dc3f65c8d1671", 
        "company": "Medlinks Cost Containment", 
        "job_summary": "COUNTY OF PLACER looking for IT Professionals!!!\nSalary: TBD\nHours: TBD\nOverall Duties: \n- Install and upgrade desktop hardware, software and peripheral equipment and configures system for optimum operations\n- Analyze and/or resolve hardware, software, and applications problems for network and stand-alone computer systems and network resources supported by the City of Fresno\n- Monitor computer systems, networks, and applications for response time, problem prevention, performance and resource utilization\n- Coordinate the resolution of network hardware, software, and applications problems between technical, support and customer personnel\n- Report hardware failures to appropriate vendors via telephone or on-line systems\n- Evaluate user hardware and software needs and assist in acquisition of approved equipment and software\n- Provide a full range of assistance and help to system and equipment users in role of help desk expert\n- Assist in preparation of user's procedures and documentation\n- Provide operations and support for legacy productions systems including startup, operation of daily production programs, logging results and performing backup procedures\n- Complete scheduled systems operational task and routines such as periodic reports and shutdown/start-up procedures for required maintenance and corrective actions\n- Train users in operating systems, computer language, applications programs, utilities and hardware operation; assist users in applying computer training to work environment; create technical documents and computer training for end-users\n- Analyze problems and design technical solutions to specific departmental needs including spreadsheets, word processors, database, presentation graphics, client/server applications, emulators, communications protocols and intranet/internet\n- Coordinate class preparation, scheduling and billing for services\n- Research and acquire knowledge of computer hardware and software available to users\nQualifications: \nKnowledge of: \n- Principles of and current trends in information technology including systems software and hardware technologies for mainframe, server, personal computer and client server environment - Information technology security methods\n- City rules for information technology projects and business objectives, processes and environment\n- Currently available commercial off-the-shelf software\n- Principles and techniques of training including training needs assessment techniques\n- Disaster planning and recovery methods\n- General computer architecture including application life cycle, central processing unit, memory allocation, peripheral devices and input/output methodologies\n- Various hardware platforms and multiple desktop software including electronic mail systems, spreadsheets, word processors, database, presentation graphics, client/server applications, emulators, communications protocols and intranet/internet\n- Principles and procedures of procedural and fourth generation programming languages\n- Personal computer and local-area-network troubleshooting techniques\n- Personal computer and local-area-network configurations, specifications and requirements\n- Problem tracking software tools, security and quality assurance policies and procedures, document workflow processes, and remote access software and techniques of connectivity\n- Technical documents protocols including manuals, schematics, procedures and specifications\n- Communications protocols, telecommunications and information processing environments\n- Backup and recovery methods, wiring capacities and limitations, intranet and internet technologies\nAbility to: \n- Communicate effectively orally and in written format in a variety of situation and formats\n- Make group presentations\n- Exercise analytical skills in providing fact-based details to support ideas, recommendations, and analysis\n- Reason logically, use a variety of techniques to resolve problems, manage time and resources, concurrently handle multiple assignments and work under strict deadlines\n- Coordinate and facilitate work with others and train and guide others\n- Lift and move equipment weighing up to 50 pounds\n- Analyze, diagnose and resolve customer problems relating to hardware, software and applications software\n- Write programs in appropriate procedural and fourth generation computer language\n- Prepare test data, test, and debug applications program\n- Troubleshoot and perform routine maintenance on computer systems and communications components\n- Operate computer master console and other help desk equipment\n- Configure desktop computers and related peripherals\n- Prepare and present technical oral and written reports\n- Utilize a variety of systems utilities, methods, and techniques\n- Perform backups and restores\nEducation/ Experience: \nA.A or B.A\n in Computer Science, Information Science or Business Information Systems.\nJob Type: Contract\nRequired education:\nAssociate\nRequired experience:\nIT Professional: 3 years\nperation, maintenance, and implementation of applications programs: 2 years", 
        "job_date": "2017-04-19 13:57:35.617015", 
        "location": "Auburn, CA", 
        "job_title": "IT Professional"
    }, 
    "87": {
        "job_url": "/company/Rocket-Network-Tools/jobs/Network-Technician-9cae4e6c06b7aed2?fccid=6e8b4baf53f1f2bf", 
        "company": "Rocket Network Tools", 
        "job_summary": "Network Technician will receive, analyze, monitor and resolve network problems in a timely fashion with minimal guidance from more senior technicians or supervisor.\nResponsibilities will include configuring and troubleshooting of routers and switches, opening trouble tickets for various customers, answering incoming telephone calls, responding to network alarms and customer emails, and documenting/updating customer account data,\nEducation: High school or equiv.\nMust be familiar with \nAT LEAST HALF\n of the following: VLANS, VTP, DTP, OSPF, EIGRP, BGP, Solarwinds, HSRP, VRRP, CDP, LLDP, 802.1Q\nMust have strong skills in Cisco CLI (IOS)\nNetwork Automation experience is a plus\nPosition may require shift work based on days of the week or hours.\nCCNA\n or \nNetwork+\n preferred\nThis positions hours are generally: 9am - 6 pm.\nJob Type: Contract\nSalary: $22.00 /hour", 
        "job_date": "2017-04-18 13:57:35.761497", 
        "location": "Ashburn, VA", 
        "job_title": "Network Technician"
    }, 
    "84": {
        "job_url": "/company/Millbrook-School/jobs/IT-Assistant-d9b2e5a8eb2bcbf2?fccid=0b638113a67a98bf", 
        "company": "Millbrook School", 
        "job_summary": "Millbrook School\nIT Assistant\nSummary Position Description:\nReporting to the IT Director the IT Assistant provides help desk support and assists with school wide hardware, software, and network issues for employees and students. Also provides general office support to the IT Department.\nResponsibilities:\nHelp Desk Support\nRespond promptly and courteously to all call coming in to the Help Desk.\nProvide accurate technical assistance and resolve issues promptly.\nRefer any technical issues that cannot be resolved promptly to the It Director.\nLog calls and resolutions as directed and maintain accurate records of Help Desk activity.\nHardware\nAssist the IT Director in ordering, installing, updating, and repairing hardware.\nAssist with the Hardware Inventory process and maintain the inventory records.\nSoftware\nAssist the IT Director is upgrading software.\nMaintain technical expertise in all software used by the school.\nAssist the IT Director in training users on software.\nKeep current on safety and security issues affecting the software used by the school.\nNetwork\nAssist the IT Director is managing the network.\nMaintain and keep email users and groups current and accurate.\nProvides general office support.\nAnswers phones.\nGreets visitors.\nPrepares correspondence and reports.\nOrders supplies.\nMaintains office files.\nOther duties as assigned.\nQualifications \n: \nTechnical expertise on both PC and Apple products\nClear and effective oral and written communications with employees and students\nAble to multi-task and work with constant disruptions\nStrong organizational skills\nAble to maintain confidentiality\nKeen attention to detail\nPatience and a sense of humor Physical Requirements:\nRegularly required to:\n*\nSit, walk, kneel, bend, and stand\nTalk and hear both in person and by telephone\nUse hands repetitively to finger, handle, feel, or operate standard office equipment\nReach with hands and arms\nLift up to 50 pounds\nClose vision, distance vision, and ability to adjust focus\nWorking Conditions:\nTypical office conditions\nLikely to spend long periods of time sitting in front of a computer screen\nUnavoidable exposure to repetitive motion\nBursts of heavy student traffic, congestion, and teenage exuberance throughout the day\nCompensation:\nThis full-time, hourly position is scheduled to work approximately 40 hours per week year round. The starting rate of pay for this position will be based on experience.\nApplication Procedure:\nInterested candidates should submit a cover letter, resume, and completed application form (found on the school’s web site) to Virginia Connolly at:\n131 Millbrook School Road, Millbrook, NY 12545\n845-677-0339 (fax)\nJob Type: Full-time", 
        "job_date": "2017-04-20 13:57:35.341031", 
        "location": "Millbrook, NY", 
        "job_title": "IT Assistant"
    }, 
    "85": {
        "job_url": "/company/Chips-And-Bits-IT/jobs/IT-Specialist-7197e72e8728fa5b?fccid=e2dd7bd2046f08b2", 
        "company": "Chips And Bits  IT", 
        "job_summary": "We are a Growing Small Business looking for people to grow with us. Looking for the person who loves to solve problems, come to the rescue, Jack of all trades, looks forward to challenges, great customer service, and professionalism.\nWe are a multi-faceted technology solutions company, we take on all tasks big and small.\nPrevious experience in IT preferred but not required.\nBig opportunity for growth!!\nJob Type: Full-time\nSalary: $30,000.00 to $60,000.00 /year\nRequired experience:\nIT: 2 years", 
        "job_date": "2017-04-19 13:57:35.475325", 
        "location": "Las Vegas, NV 89146", 
        "job_title": "IT Specialist"
    }, 
    "3": {
        "job_url": "/company/USTECHLAND-CORP./jobs/IT-Technician-dd6cc04c5ca2440a?fccid=70c07b025617cd40", 
        "company": "USTECHLAND CORP", 
        "job_summary": "We are an IT company looking for professionals\nWe are looking for experienced technician all over the USA. There are multiple positions PART TIME, FULL TIME, CONTRACT (side work, flexible hours, and contractor). \nGo here to apply: \n \nhttps://ustechland.com/SignUp\nJob Type: Full-time\nSalary: $50,000.00 /year\nRequired education:\nAssociate\nRequired experience:\nInformation Technology: 1 year\nRequired language:\nEnglish", 
        "job_date": "2017-04-14 13:54:12.217173", 
        "location": "Boston, MA", 
        "job_title": "IT Technician"
    }, 
    "7": {
        "job_url": "/company/Cavalier-IT-Solutions/jobs/IT-Support-33162e5f6d73ec4d?fccid=232dda64bad8b565", 
        "company": "Cavalier  IT  Solutions", 
        "job_summary": "Position: IT Support\nLocation: Philly, PA\nDuration: 3 months\nJob Description: \nThis Analyst will work closely with Business Analyst, Project Leads, and Management to develop and maintain POS Menu Data and Implementation information, its supporting systems, and processes and users who consume it.\nAs such, this position will work primarily, but not exclusively, with Micros Simphony 1.x, 2.x and other interfaced systems in support of client critical POS mission.\nIdeal candidates will have the opportunity to configure these systems and support our users of afore mentioned systems, while working within teams and independently.\nTake information provided from Business Readiness and Project Management team and configure the POS Software utilizing that information\nFollow business processes and standards when configuring POS system for new implementations Work out of a menu change support queue to continuously update POS item's and menu's Provide pre and post deployment POS menu support\nJob Type: Contract", 
        "job_date": "2017-04-11 13:54:21.597055", 
        "location": "['Boston, MA 02210 ', '(South Boston area)']", 
        "job_title": "IT Support"
    }, 
    "100": {
        "job_url": "/company/Career-Strategies/jobs/IT-Security-Analyst-87af9f4cfca9f150?fccid=5eaad8bca39abc75", 
        "company": "Career Strategies Inc", 
        "job_summary": "Westside fun, hip Sports Marketing Firm is searching for an IT Security Analyst. A recent college grad with 2-3 years experience welcome.\nMust haves include: \n3 years experience within and a deep understanding of security analysis\nExperience with various compliance regulations\nExperience with contract reviews and analysis\nAbility to communicate with various stakeholders\nAbility to understand IT security breaches\nMust be able to proactively spot possible security breaches\nPlusses: \nISO 2701 Certification\nISF 2015\n*** Bring your A-Game to this company's laid back, fitness-oriented company. ***\nJob Type: Contract\nSalary: $50.00 /hour\nRequired experience:\nSecurity Analysis: 3 years", 
        "job_date": "2017-04-20 13:58:11.931568", 
        "location": "Los Angeles, CA", 
        "job_title": "IT Security Analyst"
    }, 
    "39": {
        "job_url": "/company/MSBA/jobs/Network-Technician-963d226975b1c9cb?fccid=f9457a88b495a115", 
        "company": "MSBA", 
        "job_summary": "Please apply here: http://www.massschoolbuildings.org/about/careers\nNetwork Technician\nJob Description\n[Application deadline is April 29, 2017]\nThe Massachusetts School Building Authority (MSBA) seeks qualified candidates for the position of Network Technician with strong experience with end user support, knowledge of Microsoft Office Windows environment and familiarity with various network and operating systems. Ideal candidates should have have diagnosis and troubleshooting skills and strong communication skills. The MSBA is a quasi-independent government authority that partners with Massachusetts communities to support the design and construction of educationally-appropriate, flexible, sustainable, and cost-effective public school facilities. The MSBA is looking for exceptional candidates to contribute to building a stellar MSBA team. Our goal is to attract and retain exceptionally talented employees to join our agency.\nPosition Summary\nWe are seeking a Network Technician to provide technical support to our business users on the Authority’s computer and network systems. The candidate must work well in a team environment. The MSBA Network Technician has the technical aptitude and will be passionate about technology, networking, and has the ability to multi task and the candidate would thrive in an environment where they are constantly learning new things as well as problem solving for the Authority’s business users. This role will help manage network and information technology assets, including servers, software, and hardware.\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES\nHave the knowledge to execute daily backups on MSBA local servers; provide shadow copy services on the network drives; restore files and folders when requested that are critical to the business processes of the Authority.\nMake recommendations to IT team as well as Senior Management on potential changes to departmental policies and standards for network performance.\nSupport desktop hardware and all peripherals, including software installation and configuration, software updates, and anti-virus protection.\nWork closely with Network Administrator to monitor, analyze, troubleshoot network problems and escalate issues to the Director of IT.\nMake recommendations and assist with efforts to move appropriate data to the cloud.\nAssist with evaluating new software.\nAssist with procurement of IT resources by the Authority in accordance with the Commonwealth’s procurement policies.\nSupport network access, monitoring, control with account creation and deactivation for onboarding and off-boarding procedures.\nManage and support the email system.\nManage and support the secure door access system.\nManage and support the phone system.\nManage all mobile devices for the Authority.\nAdminister and support networked printers.\nAct as primary point of contact for server, PC, and laptop issues.\nProvide proactive and timely customer service support to solve user software and hardware issues.\nEnsure employees have all software and hardware needs met in a timely manner.\nAssist to compile, maintain, and conduct regular inventory of the Authority’s information technology assets.\nRecord events and problems and their resolution in IT ticketing system. Direct unresolved issues to the next level of support personnel.\nPerform other duties as required.\nREQUIRED QUALIFICATIONS (unless otherwise noted)\nA Bachelor’s degree in IT, Computer Science, or a related field\n3-5 years of Experience\nExpertise in Microsoft Windows environment and familiarity with other network and operating systems, particularly Microsoft Windows.\nProficiency in Microsoft Office 2010 software applications, including Excel, Word, PowerPoint and Outlook.\nDesktop and server troubleshooting skills.\nAbility to diagnose and resolve basic technical issues.\nExperience with setting and managing priorities and the ability to manage multiple priorities simultaneously.\nAbility to communicate effectively, and at audience-appropriate levels.\nAbility to work both independently and as part of a team.\nOperate in a respectful and courteous manner while addressing issues.\nPREFERRED QUALIFICATIONS\nExpertise in Microsoft Windows environment and familiarity with other network and operating systems.\nJob Type: Full-time\nRequired education:\nBachelor's\nRequired experience:\nIT: 3 years", 
        "job_date": "2017-04-14 13:55:42.436566", 
        "location": "['Boston, MA 02109 ', '(Central area)']", 
        "job_title": "Network Technician"
    }, 
    "38": {
        "job_url": "/company/iConnect-POS/jobs/Technical-Support-Specialist-512a5d0a484a46ad?fccid=322f756b679239a9", 
        "company": "iConnect POS", 
        "job_summary": "Support Specialist The iConnect Customer Service team provides professional, courteous and prompt tier one technical support to our customers and partners. This includes problem definition, prioritization, analysis, recreation and resolution. This position exists to ensure client satisfaction by providing answers and resolutions to incoming support inquires in a timely and effective manner. A key part of this position will be to identify problems and document/communicate any issues with our development team.\nResponsibilities:\nTake ownership for resolving client support issues from case logging through management of escalation or resolution\nMaintain a proactive approach with clients who with the goal of delivering satisfaction and great experience on calls and emails\nProvide cheerful customer service while helping answer questions and resolve issues\nDetail any bugs or issues in the JIRA system\nRespond to client cases and field inquiries in a timely and effective manner by answering known questions and reproducing straightforward technical problems\nEffectively use escalation procedures as necessary\nFacilitate issue resolution by leveraging internal experts when necessary\nOther job related duties as assigned\nQualifications\nPrefer 2+ years experience in hardware and software troubleshooting, analysis and resolution\nStrong oral and written communication skills required\nKnowledge and experience with iOS, windows, and Android\nAbility to solve a wide range of technical problems\nAbility to analyze data and/or situations containing both identifiable and unidentifiable factors\nProven ability to work within a team environment, multi-task, and adapt to change\nABOUT US: iConnect POS is a cloud Point of Sale solution designed to help single and multi location businesses sell more, and create loyal customers. Our passion is to empower Retailers, Health and Beauty professionals, Quick Service, and mobile businesses with simple, beautiful software. iConnect POS combines point of sale on any device with optional back office features to manage, grow, and know your business.Our customers include Entrepreneur Magazine’s fastest growing franchises like SEVA Beauty, Retailers like Arteriors Home, Traeger Grills, & Murad Inc, and thousands of small businesses on main street America. iConnect POS puts mPOS in the hands of local and national businesses everywhere, so that owners can sell more and focus on growing other areas of business.In simple terms, we are replacing the traditional cash register. For more than a century, these clunky boxes have taken up valuable counter space at salons, retail stores, and coffee shops, and have served as a costly impediment to small business ownership. We are disrupting this industry through our cloud-based architecture, amazing customer service and intuitive software that delivers the innovative features and analytics small business owners need. We’re proud of the culture we’re building, and our ideal candidate embodies our distinct core values of friendly professionalism, and has a strong desire to succeed.\nJob Type: Full-time\nSalary: $15.00 /hour\nJob Location:\nSan Jose, CA\nRequired education:\nAssociate\nRequired experience:\nhardware: 2 years\nTechnical Support: 2 years\nAndroid: 1 year", 
        "job_date": "2017-04-21 13:55:40.456778", 
        "location": "San Jose, CA", 
        "job_title": "Technical Support Specialist"
    }, 
    "33": {
        "job_url": "/company/Keystone-It/jobs/Help-Desk-Technician-457b68def46784d8?fccid=c3a9b4a75c38fb7f", 
        "company": "Keystone  It", 
        "job_summary": "Keystone's Customer Service Philosophy\nEvery contact with a client, or a potential client, is an opportunity to build trust and a professional relationship. All employees must consciously and consistently practice this philosophy.\nHelp Desk Technician\nThe Help Desk is the face of the company. The Technician is first person to take phone calls and emails from clients requesting help or information. The Technician determines the nature of the clients' problems and attempts to resolve the problems. If the problem is found to be more complicated than can be solved immediately, the Technician then decides how to move forward resolving the customer's problem.\nOperations Support\nThe goal is to resolve our clients' problems quickly.\nThe Technician overall responsibility is to take personal ownership of customers' orders from the placement of the order through final payment for the goods and services that were delivered.\nA work order(s) is then generated in the system.\nOpen customer orders and the associated work orders are then monitored for on time completion. The Technician stays in contact with the Computer Engineer in charge of the order to make sure work orders are completed and delivery promises are met. Any delays are communicated to the client\nAssists with monitoring key client information in the CRM assuring its accuracy.\nTech Support\nRefurbishes equipment by cleaning the device, replacing parts, and testing.\nAssists in configuring new computers by installing software, setting up users, data migration, and testing.\nSalvages parts from computers and recycling what remains.\nCritical Job Requirements\nAbility to project a helpful demeanor under the most trying circumstances.\nMust be a good, independent problem solver.\nMust be able to follow processes with a minimum of supervision.\nMust be a good listener and able to communicate clearly using proper language and grammar.\nOther Skills and Abilities Required for Success\nHave an an understanding of the concepts and terms used in the Informational Technology Industry.\nAbility to learn and retain new information.\nComfortable working alone and/or in a team.\nA good sense of humor.\nJob Type: Full-time\nSalary: $35,000.00 /year", 
        "job_date": "2017-04-18 13:55:30.941911", 
        "location": "Iowa City, IA 52240", 
        "job_title": "Help Desk Technician"
    }, 
    "32": {
        "job_url": "/company/AEQUOR-Technologies,-Inc./jobs/IT-Support-Specialist-09cb64860b707fa0?fccid=91b44cea9fbac389", 
        "company": "Aequor Technologies", 
        "job_summary": "Location: Boston, MA\nDuration: 15+ Months\nDescription\n(Intermediate, 1 - 3 Years Experience).\nMaintains, analyzes, troubleshoots, and repairs computer systems, hardware and computer peripherals. Documents, maintains, upgrades or replaces hardware and software systems.\nSupports and maintains user account information including rights, security and systems groups.\nMay require an associate’s degree in a related area or 1 - 3 years of experience in the field or in a related area.\nFamiliar with a variety of the fields concepts, practices, and procedures.\nRelies on experience and judgment to plan and accomplish goals.\nPerforms a variety of complicated tasks.\nTypically reports to a project leader or manager.\nA wide degree of creativity and latitude is expected.\nPosition Description: \nField incoming help \nrequests\n from \nend users\n via both telephone and work orders in a courteous manner.\nDocument all pertinent end user\n identification information, including name, department, contact information, and nature of problem or issue.\nBuild rapport and elicit problem details from help desk customers.\nPrioritize and schedule problems.\nEscalate problems (when required) to the appropriately experienced technician.\nRecord, track, and \ndocument the help desk request\n problem-solving process, including all successful and unsuccessful decisions made, and actions taken, through to the final resolution.\nApply diagnostic utilities to aid in \ntroubleshooting\n .\nAccess software updates, drivers, knowledge bases, and frequently asked questions resources on the Internet to aid in problem resolution.\nIdentify and learn appropriate software and hardware used and supported by the organization.\nPerform \nhands-on fixes at the desktop level\n , including \ninstalling and upgrading software\n , implementing file \nbackups\n , and \nconfiguring systems and applications\n .\nTest fixes to ensure problem has been adequately resolved.\nPerform post-resolution \nfollow-ups\n to help requests.\nDevelop help sheets and knowledge base articles for end users.\nWork with end-users to ensure transition of all software and customized settings are complete\nFollow refresh process and documentation to ensure quality and accuracy\nAbility to follow technical process / documentation required\nSpecific knowledge of support practices on \nhardware desktop and laptop devices\nPerform related duties consistent with the scope and intent of the position\nJob Type: Contract\nRequired experience:\nIT Support: 2 years", 
        "job_date": "2017-04-11 13:55:30.745424", 
        "location": "Cambridge, MA", 
        "job_title": "IT Support Specialist"
    }, 
    "31": {
        "job_url": "/company/F2ONSITE/jobs/Desktop-Support-Technician-57a1db7f9921c2ab?fccid=63920ddc4c2a711a", 
        "company": "F2Onsite", 
        "job_summary": "Job Summary\nThe Level 1 Desktop Support Technician - is an intermediate position that performs tasks related to the repair of a variety of technology-based products typically associated in an end-user computing environment.\nResponsibilities\nPerforms basic and moderately complex troubleshooting and repair activities, typically associated in an end-user environment, including but not limited to PC’s, desktops, laptops, tablets and printers.Provide support to client identified VIPs. Responds to change management requests including installing new PC equipment, providing end-user desk side support and other related activities.Perform Install/Move/Add or Change (IMAC) activities. Perform all assigned desk-side support activities. Display outstanding technical and professional services skills at all times. Meet - established customer service satisfaction levels and other operational/customer service metrics as outlined in established guidelines. Proactively communicate with the end-user and service desk personnel regarding arrival times, repair time estimates and status of the repair. Understands and follows all documented service operations policies and procedures.Other duties or certifications may be assigned to meet business needs.\nRequirements\nEducation and Experience\nTypically requires technical school certification or equivalent of 2-4 years of relevant experience.\nCertifications and/or Qualifications\nMaintain all required OEM Certifications as directed by Management. Knowledge of relevant software and hardware systems. Understanding of ITIL methodologies. A+ certification is desired. May require additional customer-specific certifications or training as required.\nSkills\nExcellence in communication and customer-facing skills. Strong oral, written and interpersonal skills. Ability to follow instructions and processes with minimal instruction. Ability to lift and or move various computer equipment up to 50 lbs. Ability to pass drug screen and background check, education and employment verification at time of hire.\nJob Type: Full-time\nRequired experience:\nDesktop Support: 1 year", 
        "job_date": "2017-04-20 13:55:22.779909", 
        "location": "Greensburg, IN", 
        "job_title": "Desktop Support Technician - $18/hour - Contract to Hire"
    }, 
    "30": {
        "job_url": "/company/Bucket-Wonders-LLC/jobs/IT-Position-Growth-Management-2c8dae819550680a?fccid=aa52a01e263d025b", 
        "company": "Bucket Wonders LLC", 
        "job_summary": "We're a growing souvenir manufacturer with a casual and fun, but fast-paced and productive atmosphere. We're looking for a well-rounded, unique individual to fill this permanent, full-time position. Initial duties would require an understanding of IT and computer programs, with a variety of related tasks each day. Through time and with good performance, duties would include assisting the company CEO, new product development, and promotion to eventual management over other employees. We're looking for a self-motivated individual, with a positive, can-do attitude and the ability to learn a wide spectrum of tasks - from computer tech to leading others.\nDescription of initial duties:\n- computer, software and network maintenance\n- combination of routine computer-driven daily workflow processes, maintenance of computer systems and machines, and troubleshooting problems\n- may include new product development, including sourcing materials, designing displays, and problem-solving\n- ability to increase business efficiency and streamline processes\n- may occasionally include travel opportunities\nQualifications:\n- knowledge of various computer platforms and programs\n- must be available full-time, and looking for a permanent position\n- ability to solve problems and find solutions independently\n- good oral and written communication skills and enjoying working with others\n- ability to see a complicated project from start to completion\nStarting benefits include paid holidays and vacation. We look forward to growing our business with the right individual!\nJob Type: Full-time\nSalary: $50,000.00 /year", 
        "job_date": "2017-04-15 13:55:22.592037", 
        "location": "Orem, UT 84058", 
        "job_title": "IT Position with Growth to Management"
    }, 
    "37": {
        "job_url": "/company/Opus-Inspection,-Inc./jobs/Manager-Information-Technology-3cdf36110394d961?fccid=64a1c8a3013c0283", 
        "company": "Opus Inspection Inc", 
        "job_summary": "OPUS INSPECTION\n , and its subsidiary Envirotest, is a multi-national company that has integrated operations in 22 states within the U.S. and several countries. Our operations includes Emission Programs, Safety Programs, Remote Sensing, ESP, Drew Technologies and FastLign Touchless Alignment System.\nOpus Inspection, actively seeks a knowledgeable Manager of Information Technology, with at least 7 years of applicable I.T. experience. The Manager of I.T. position includes a starting salary of $84K. We offer medical, dental, retirement plan, vacation and sick accrual time as part of our benefits package.\nJob Purpose\nFrom the Tucson Development Center (TDC), manage all facets of Corporate IT including: technology planning and administration, project management and implementation, task prioritization and direction of corporate IT staff. Also responsible for developing an overall network strategy for Opus Inspection’s existing business as well as for areas of growth – supporting, collaboratively creating and successfully implementing our developing network and data management services.\nDuties & Responsibilities\nCoordinate with senior managers, program managers, engineering managers and other key personnel to ensure that corporate information technology priorities and activities are aligned with Corporate IT and Company business strategy.\nBuild effective professional and partnering relationships with engineering managers.\nOversee the integration of IT support for Opus Inspection business unit operations.\nManage a technical staff, including system administrators, desktop support personnel, network and data management team members, and contractors. Effectively negotiate with vendors to confirm and manage contract, licensing and support agreements and relationships.\nManage local and Corporate IT infrastructure assets and monitor revenue-generating high-availability systems.\nDirect and manage security of information systems, data, communication lines, and equipment as directed.\nEnsure that resources are allocated and used efficiently and effectively to meet corporate goals, achieve high performance, and deliver on commitments.\nOversee the support and successful development of data management services, under the general direction of the Vice-President of Engineering and in conjunction with key business development and technical personnel.\nRepresenting IT on the corporate management team, research and recommend beneficial changes in IT functions, structure, technology, and systems.\nOther responsibilities as may be defined or changed due to business necessity.\nRequirements\nWorking knowledge of IT systems and tools, network architectures and infrastructures, LAN/WAN technologies, data management technologies, and business applications.\nAbility to manage in a team environment, including leading and motivating staff and contract personnel to achieve departmental goals and complete projects on time and on budget.\nAbility to analyze business needs and translate them into technical solutions.\nAbility to balance multiple priorities and problem-solve.\nProfessional written and verbal communication and interpersonal skills to ensure successful interaction with executive and senior management and staff oversight.\nDemonstrated commitment to continuous improvement.\nQualifications\nBachelor’s degree in Management Information Systems, Information Technology, Computer Science, Business Administration, Engineering or related field, or equivalent work experience required. Master’s degree in related field a plus.\n7-10 Years experience in a dynamic and growing IT environment; at least 3 years in management.\nProven successful track record of developing and implementing network and data management applications.\nAbility to pass a background investigation and drug screen.\nFor more information\n \n,\n visit www.opusinspection.com\nOpus Inspection and its subsidiary is an equal opportunity employer.\nNo Recruitment and/or Staffing Agency Inquiries\nJob Type: Full-time\nSalary: $84,000.00 /year\nRequired education:\nBachelor's\nRequired experience:\nmanagement: 3 years\ninformation technology: 7 years", 
        "job_date": "2017-04-19 13:55:39.464875", 
        "location": "['Tucson, AZ 85705 ', '(Flowing Wells area)']", 
        "job_title": "Manager of Information Technology"
    }, 
    "36": {
        "job_url": "/company/One-Garage-Doors/jobs/Garage-Door-Technician-52b4e8aed6736148?fccid=fd525c31f89d3071", 
        "company": "One Garage Doors Inc", 
        "job_summary": "We are a newer company needing independent employees who can repair, install, and service anything having to do with garage doors/garage door openers. We are a fully Licensed, Bonded, and Insured company in Las Vegas.\nWe pay per job on a percentage of the job done. We would need someone who has their own truck, and tools.\nWe are starting to advertise heavy, and expect a lot of business.\nIt is ok if you work with other companies.\nIf you are interested, please give us a call.\nThank You,\nOne Garage Doors Inc.\nJob Type: Commission\nSalary: $100.00 to $300.00 /day\nJob Location:\nLas Vegas, NV\nRequired experience:\nGarage Door Service/Repair/Installation: 1 year\nRequired language:\nEnglish", 
        "job_date": "2017-04-19 13:55:39.047765", 
        "location": "Las Vegas, NV", 
        "job_title": "Garage Door Technician"
    }, 
    "35": {
        "job_url": "/company/Wavsys,-LLC/jobs/IT-Technical-Support-Tech-bb8d8f8cfb836686?fccid=8a7265f0b3011e21", 
        "company": "Wavsys LLC", 
        "job_summary": "General Responsibilities: Provides IT Desktop support to the relevant End-user community in the location/region based, this includes all desktop computing hardware and software and peripherals. Makes timely and accurate diagnosis of system related problems and determining between hardware, software and network related problems, and work in conjunction with the Global Service desk and other IT operations/engineering groups to provide resolution.\nWill be required to lead problem resolution activities in order to get technology incidents and problems resolved. Will be expected to take ownership for assigned incidents and problems, and contact required resources both inside and outside the company necessary to resolve the problem, with minimum supervision. Responds to request for service with experience and compliance in established time limits.\nDevelops/maintains support document for use by all levels of support personnel as well as end-user documentation. Identifies and solves any problems that affect desktop computer operating systems and troubleshoots routine problems and maintenance of systems.\nJob Type: Contract\nSalary: $18.00 to $24.00 /hour\nJob Location:\nBellevue, WA\nRequired experience:\nIT Support: 3 years", 
        "job_date": "2017-04-19 13:55:38.859687", 
        "location": "Bellevue, WA", 
        "job_title": "IT Technical Support Tech"
    }, 
    "34": {
        "job_url": "/company/CTG,-Inc./jobs/Desktop-Support-Technician-95384f6dbd980314?fccid=49798603e4669d2a", 
        "company": "CTG Inc", 
        "job_summary": "We at CTG are presently seeking Desktop Support Technician at Neillsville, WI for one of our Clients, if this opportunity interests you I urge you to email me your updated resume in word format with your contact information and the best time to reach you.\nPlease feel free to call me (Waseem Khan) at 800-992-5350 Ext 4985. If you need more information\nPosition: Desktop Support Technician\nLocation: Neillsville, WI\n 54456\nDuration: 6 Months\nEssential job functions: \nDescription\nDesktop Support Technician\nThis is a 6 month contract to hire.\nThe candidate will be responsible for daily operation duties of user support, administration, monitoring, and deployment of new and replacement equipment. This Position will report directly to the Conduent Site Operations Manager. Specific duties of the IT Technician will be performed in accordance with the Customer priorities as directed by the Site Operations Manager:\nInstall, configure, and administer Microsoft Windows operating systems\nInstall, configure, and support end user hardware\nProvide desktop and application support\nProvide outstanding customer service and communication to the end users\nOther project and duties as assigned\nJob Type: Contract\nSalary: $35.00 /hour\nJob Location:\nNeillsville, WI\nRequired education:\nHigh school or equivalent\nRequired experience:\nInstall, configure, and administer Microsoft Windows: 2 years\nDesktop Support: 3 years", 
        "job_date": "2017-04-18 13:55:32.617868", 
        "location": "Neillsville, WI", 
        "job_title": "Desktop Support Technician"
    }, 
    "60": {
        "job_url": "/company/Mercury-Technology-Development/jobs/Information-Technology-Specialist-829ceb1b40f33e9e?fccid=0e73008820d457d5", 
        "company": "Mercury Technology Development", 
        "job_summary": "Stravinski\n are looking for an \nInformation Technology Specialist\n who is motivated to balance professional customer service with IT technical knowledge.\nThis exciting position will be within \nMercury Technology Development (MTD), a Stravinski Company (American Canyon, CA),\n an innovative software development and technical support organization. \nMTD\n specializes in maintaining, deploying, and developing software for managing, tracking and reporting warehouse-logistics along with business-as-usual support for \nStravinski Companies\n , performing a wide range of duties from installing, configuring, and maintaining enterprise hardware and software that supports all \nStravinski\n operations to developing custom applications to suit business needs.\nUnder the direction of the IT and Software Development Managers, the ideal candidate will be responsible for:\nIT Support Activities\nProvide timely support for a team on energetic non-technical operations team\nResolve user and system issues\nDesign procure and deploy hardware and software solutions to support growing business needs\nResolve trivial user issues with professionalism\nMaintain a record of Moves, Adds and Changes within the companies\nDocument tasks performed and create user tutorials\nOther duties as assigned by management\nSoftware Development Support Activities\nMaintaining and deploying applications and resources to cloud based development and production environments\nCreating and maintaining development and production environments\nDocumenting processes and procedures and changes\nTroubleshooting connectivity and performance issues\nResearch and implement solutions to problems that arise as part of day to day operations\nOther duties as assigned by management\nDesired Experience\nHands on experience with network routing and switching protocols\nExperience with Windows, Linux, Android and Apple operating systems on both Desktop and server environments\nManage and purchase hardware and software procurement as mandated by business case\nManage Internet, Telephony, and WAN connectivity services\nTroubleshoot network issues\nExperience with Azure, Office 365, Exchange server (2013 and above), Amazon Web Services, and Remote Monitoring and Management platforms\nUnderstanding of Enterprise Information policies and procedures\nIT Security Best Practices\nDesired Soft Skills\nUnderstand challenges posed by provider of white glove customer service\nDemonstrate professionalism and courtesy with customers at all times\nResolve issues in a clear, courteous, and straight-forward manner\nStrong analytical, research and problem solving skills\nStrong team player with a can-do attitude\nTravel\nThere will be an intermittent need to travel to the Headquarters in Madera, California to attend meetings or resolve technical issues. Any urgent situation may mandate such travel at short notice.\nAbout Stravinski Companies\nStravinski\n began as a general contractor in 1986. Since that time, \nStravinski\n has constructed manufacturing plants, warehouses and distribution facilities, industrial facilities, shopping centers, medical complexes, office complexes, schools, and heavy concrete foundations to name just a few.\nStravinski\n offers a competitive compensation package commensurate with experience, along with comprehensive benefits including medical, dental and vision insurance, 401K, vacation, and paid holidays.\nJob Type: Full-time", 
        "job_date": "2017-04-21 13:56:49.415620", 
        "location": "American Canyon, CA", 
        "job_title": "Information Technology Specialist"
    }, 
    "61": {
        "job_url": "/company/krg-technologies-Inc./jobs/Desktop-Support-Technician-467a400433ac78da?fccid=85e326bd50e78c08", 
        "company": "KRG Technologeis  HCL America", 
        "job_summary": "Job Title : \nDeskside Engineer\nLocation : \nQuincy, IL\nDuration : \n6 - 12 months\n .\nJob Description: \nMinimum of 2 years’ technical experience in providing Field Support which includes:\nPC hardware repair (Dell/HP)\nWindows system support\nOS X Support (10% of techs should have this skill)\nSoftware installation/troubleshooting\nPerforming Tech Refresh\nMobile device support (iOS/iPhone/iPads) – excluding warranty hardware repair\nNetworking\nAsset tracking\nStock room management\nBasic support in Video conferencing equipment\nGeneral Core Competencies to be considered when hiring:\nCustomer focused – Customer is #1 Attitude\nPersonal accountability for results\nDetail oriented\nStrong analytical and troubleshooting skills\nHigh integrity\nA minimum of two confirmed references is preferred.\nThe following educational/technical certifications are preferred:\nTechnical degree (i.e. Associates, Bachelors, etc.) or equivalent in years of experience in Field Support\nDell/HP hardware certifications\nTechnical certifications (e.g. A+, MCDST, MCP, MCSA, etc.).\nCandidate has a professional appearance (i.e. grooming, clothing, etc.).\nRoles and Responsibilities: \nDesk Side Engineer\nAccurately test, identify, repair, resolve and document end user technical issues for basic desktop/laptop/workstation support, basic connectivity support (wired and wireless), PDAs, BlackBerrys and basic printer support.\nAnthem owned equipment\nApple support – Smart hands and feet, also coordination w Anthem Apple team.\nQuestions about nonstandard equipment should be brought to HCL management’s attention\nTroubleshoot and resolve software issues. Ability to install, configure, reconfigure or reinstall software including remote support\nUpdate the tickets in ITSM & work on tickets within the defined service levels\nAppropriate notes required\nHOLD reason notes required\nMissed schedule date notes required\nTicket transfer reason notes required\nIdentify tickets that should be project and provide info to the Project Management team\nUpdate TAMIT (SNOW) Asset Database for each hardware interaction.\nWhile at an associates desk, check other assets at the desk and update asset database\n100% compliance required\nAsset salvage runs scheduled by the Stockroom Tech/FST.\nReimaging computers/hard drives in accordance with customer standards\nIMACD function including installation and decommission.\nBacking up and restoring settings and associated systems administration activities\nDrive end to end ownership of issues to provide a resolution for all requests and incidents.\nCategorize and prioritize end user support requests and service requests by utilizing ticketing system to track tickets and provide up-to-date status and information.\nMove equipment associated with escalated help desk incidents and service requests\nPerform asset inventory activities to maintain accuracy.\nTrains and orients staff on use of hardware and software.\nRecommends and / or performs upgrades on systems to ensure longevity.\nOther tasks as assigned by Site Lead/Regional Lead.\nWork w the team/partner w HCL SD/ATS/FSS teams to improve service.\nMaintain a clean work environment.\nJob Type: Contract\nSalary: $20.00 to $23.00 /hour\nRequired experience:\nDesktop Support: 3 years", 
        "job_date": "2017-04-13 13:56:53.815206", 
        "location": "Quincy, IL", 
        "job_title": "Desktop Support Technician"
    }, 
    "62": {
        "job_url": "/company/MCR-Health-Services/jobs/IT-Help-Desk-Technician-Inventory-Analyst-b3accf7880b5b370?fccid=3df459e65d0999e0", 
        "company": "MCR Health Services", 
        "job_summary": "Responsible for providing computer, telephone and report-writing technical support to all users, log all requests for assistance making tickets in the help desk database using Boss Support Central.\nProvides technical computer assistance remotely, diagnosing and applying recommended solutions to users and escalating tickets to appropriate IT field technician.\nManage help desk emails in Outlook to resolution creating tickets and responding to all work related communication as letters, emails, text or voicemail in a timely manner.\nPurchase all equipment ordering from CDW, Verizon and Apple website accounts.\nMaintain inventory database for all devices including network equipment and deploy devices for recycling.\nInstall, troubleshoot, upgrade and maintain devices such as desktop computers, laptops, printers, scanners, iPhones, iPads, MiFis, in hardware and software programs.\nImage and post new and old computers using smart deploy software for windows 7 and 10\nEncrypt laptops for all users using Sophos console.\nSynchronize Boss inventory with Active Directory for computers and reset password for users.\nProcess iPhones, iPads, MiFis and coordinate with users to setup new devices or update old ones, install company AirWatch App, update iOS to latest version, setup user’s exchange account for emails and contacts. Create apple IDs and keep inventory update for these devices.\nPerforms other duties as assigned.\nResponsible for providing computer, telephone and report-writing technical support to all users, log all requests for assistance making tickets in the help desk database using Boss Support Central.\nProvides technical computer assistance remotely, diagnosing and applying recommended solutions to users and escalating tickets to appropriate IT field technician.\nManage help desk emails in Outlook to resolution creating tickets and responding to all work related communication as letters, emails, text or voicemail in a timely manner.\nPurchase all equipment ordering from CDW, Verizon and Apple website accounts.\nMaintain inventory database for all devices including network equipment and deploy devices for recycling.\nInstall, troubleshoot, upgrade and maintain devices such as desktop computers, laptops, printers, scanners, iPhones, iPads, MiFis, in hardware and software programs.\nImage and post new and old computers using smart deploy software for windows 7 and 10\nEncrypt laptops for all users using Sophos console.\nSynchronize Boss inventory with Active Directory for computers and reset password for users.\nProcess iPhones, iPads, MiFis and coordinate with users to setup new devices or update old ones, install company AirWatch App, update iOS to latest version, setup user’s exchange account for emails and contacts. Create apple IDs and keep inventory update for these devices.\nPerforms other duties as assigned.\nJob Type: Full-time\nJob Location:\nBradenton, FL 34203\nRequired education:\nBachelor's\nRequired license or certification:\nN/A", 
        "job_date": "2017-04-20 13:56:54.349799", 
        "location": "Bradenton, FL 34203", 
        "job_title": "IT Help Desk Technician/Inventory Analyst"
    }, 
    "63": {
        "job_url": "/company/Family-Worship-Center-Church/jobs/Information-Technology-Specialist-30aeb18f3f3ef771?fccid=b2b28659464c1c88", 
        "company": "Jimmy Swaggart Ministries", 
        "job_summary": "Summary\nThis is a full-time Information Technology Support position and will function as a member of the JSM Information Technology team, a technology support unit within the Jimmy Swaggart Ministries. This position supports the campus in providing Information Technology hardware and software support services in addition to general IT maintenance.\nDetail\nThe Information Technology Specialist performs analytical, technical, and administrative work in the planning, design, and installation of new and existing personal computer systems, workstations and printers.\nDiagnoses and resolves problems in response to end user reported incidents.\nConfers with end users to determine types of hardware and software required.\nInstalls new hardware and software and maintains existing components.\nTrains end users in the use of IT systems.\nPerforms general maintenance tasks.\nTroubleshoots and resolves issues with computer systems and peripheral equipment located throughout the organization.\nEvaluates products for compatibility, expandability, and ease of use and support.\nDuties and Responsibilities\nWorks in a team to provide IT support services to JSM users.\nConfigures and installs desktop and notebook units.\nAssists other team members as needed.\nWorks with vendors to resolve issues of warranty and new purchases.\nInteracts and assists Administration with technical and configuration questions.\nConducts technical research as needed.\nMinimum Qualifications\nThree years of hardware/software support experience, including experience providing IT customer support services. An Associate's degree in Management Information Systems, Computer Information Technology or similar field is preferred.\nTechnical Qualifications\nExperience with Microsoft Windows-based systems.\nExperience with Mac OS.\nExperience with Microsoft Office products.\nExperience troubleshooting in network environment.\nExperience troubleshooting hardware and software issues.\nAbility to document solutions clearly and concisely.\nSelf-motivating and a team player.\nAbility to answer technical questions in a non-technical manner during meetings or presentations.\nJob Type: Full-time\nRequired education:\nHigh school or equivalent\nRequired experience:\nHardware/Software Support: 3 years", 
        "job_date": "2017-04-20 13:56:54.766563", 
        "location": "Baton Rouge, LA 70810", 
        "job_title": "Information Technology Specialist"
    }, 
    "64": {
        "job_url": "/company/Protalus/jobs/PC-Support-Specialist-9dd9fe7ac27f37c0?fccid=a987b1fadf510821", 
        "company": "Protalus", 
        "job_summary": "Come join our dynamic and rapidly growing team. At Protalus we work hard, have a lot of fun, and work together to create a unique and amazing culture.\nThe PC Support Specialist will assist the IT Manager to support client computers, printers, cell phones and other IT systems used by Protalus.\nDuties and Responsibilities: \nIT Support for dozens of Windows PC's and a small amount of Mac OS X systems.\nSupport for mobile phones (iOS and Android) and land line phones.\nIT ordering including computers, phones, monitors, and accessories.\nAssist with troubleshooting network and server platforms.\nCreate and maintain documentation for IT systems and policies.\nQualifications: \nEducation: Bachelors Degree in IT/IS or a Technology-related field or equivalent work experience.\nExperience: 2-5 years of experience supporting IT in a corporate environment.\nCertification: Certifications from Microsoft, CompTIA, Linux Foundation, etc. are highly desirable.\nDemonstrated Skills: \nExperience with managing multiple client computers including OS/drivers/BIOS installation, application installation and advance troubleshooting and should have a solid understanding of TCP/IP networking concepts.\nAdvanced/Specialized Knowledge: \nKnowledge of Active Directory/Group Policy as well as Google GSuite and Microsoft Office 365 is preferred.\nAbilities\n :\nPerform root cause analysis to identify and resolve problems and should have experience with command line tools for advance configuration and troubleshooting.\nThe good stuff\n :\nPTO/Sick Pay\n is awarded to eligible full time regular employees on their first day of employment following the calendar quarter as follows:\nHired in 1st quarter 4 weeks\nHired in 2nd quarter 3 weeks\nHired in 3rd quarter 2 weeks\nHired in 4th quarter 1 week\nHoliday Pay\nThe following are holidays that Protalus will observe:\nNew Year’s Day\nMemorial Day\nIndependence Day\nLabor Day\nThanksgiving\nDay after Thanksgiving\nChristmas Eve\nChristmas Day\nOne (1) Floating Holiday to use as you wish\nJob Type: Full-time\nSalary: $17.00 to $22.00 /hour\nRequired experience:\nIT Support: 2 years", 
        "job_date": "2017-04-11 13:56:55.314166", 
        "location": "West Linn, OR 97068", 
        "job_title": "PC Support Specialist"
    }, 
    "65": {
        "job_url": "/company/QMES/jobs/IT-Support-Technician-2edad98eb74002a9?fccid=103da31a2ee74d4d", 
        "company": "QMES", 
        "job_summary": "**Must have at least 3 years IT helpdesk and/or IT systems administrator experience to apply**\nQMES is a rapidly growing Durable Medical Equipment (DME) company. We provide superior customer service 24-hours a day to clients located in nine states in the northeast region of the U.S. We distribute and service medical equipment to hospitals, rehab/skilled nursing facilities, and directly to our patients in the home setting.\nKEY AREAS OF RESPONSIBILITY: \nResponsible for system and user administration for the entire organization.\nManage deployment, administration, and support for corporate servers/desktops/laptops/mobile devices\nField incoming help requests from end users\nAccess and install appropriate upgrades, patches, drivers, etc.\nPerform hands-on fixes, including software/ hardware install and upgrade, implementing file backups, and configuring systems and applications\nKNOWLEDGE AND SKILLS: \nWindows Server 2003/2008R2/2012R2 Windows XP/7/10 expertise\nSolid knowledge of TCP/IP, DNS, DHCP and LAN, Windows AD\nKnowledge of computer hardware, imaging of computers, and basic computer maintenance\nFamiliarity with general PBX concepts and VoIP phone system administration\nApplication support experience with Microsoft Office products including Office 365 administration.\nFamiliarity with a virtualized environment, HyperV, VMWare.\nStrong written/oral communication and interpersonal skills\nEDUCATION AND WORK EXPERIENCE: \nAssociates degree (A. A.) from two-year college; or four years IT Support experience and/or training; or equivalent combination of education and experience.\nMicrosoft Certifications a plus\nJob Type: Full-time\nSalary: $50,000.00 to $55,000.00 /year\nRequired education:\nAssociate\nRequired experience:\nTCP/IP: 2 years\nWindows Server 2008: 2 years\nIT Support: 3 years\nDHCP and LAN: 1 year", 
        "job_date": "2017-04-20 13:56:55.452844", 
        "location": "Great Neck, NY", 
        "job_title": "IT Support Technician"
    }, 
    "66": {
        "job_url": "/company/COMBINED-PUBLIC-COMMUNICATIONS/jobs/IT-Support-Specialist-51ce78f2bc859ffd?fccid=b305faa5932d7df8", 
        "company": "Combined Public Communications", 
        "job_summary": "IT Support Specialist\nWe are looking for a Jr. – Mid level IT Support Specialist with experience working in a virtual environment. We are a small telecommunications company in Cold Spring, KY. You will work with a small, but agile, team of IT professionals focused on providing the highest level of service to our customers.\nResponsibilities:\nYou will be working with the team configuring, maintaining, upgrading and deploying PC’s, laptops and mobile devices. You will also be creating, modifying and deleting AD/Exchange user accounts, distribution and security groups. As part of the team you will assist senior Specialists in the upkeep and monitoring of our virtual environment and assist in administration of our internal PBX (VoIP) phone system.\nSkillset:\nCommunication skills with technical and nontechnical people\nWorking independently and in team environments\nWork in person and over the phone to solve issues\nTrack support tickets and manage your time\nWrite technical documentation and train coworkers\nWindows 10 and 7 installation, setup, and support\nActive Directory – Modifying users/groups, and email features\nExchange – Creation and modification of user mailboxes\nMicrosoft Office troubleshooting including Word, PowerPoint, Excel and, Outlook\nVoIP Phone systems – Regular maintenance and modifications\nDesktop, laptop, server, and basic network setup, troubleshooting, and replacement\nPeripheral support: Printers, scanners, tablets, smartphones, etc.\nQuick learning of proprietary systems and web pages\nRequirements:\nMinimum 2 year degree in information systems and/or 3+ years of related experience\nMust be punctual and driven to meet required task deadlines.\nStrong verbal and written communication skills.\nALL season, reliable transportation is required\nJob Type: Full-time", 
        "job_date": "2017-04-08 13:57:02.446689", 
        "location": "Newport, KY 41076", 
        "job_title": "IT Support Specialist"
    }, 
    "67": {
        "job_url": "/company/Communications-Advertising-for-Affinity-Resouces-(hosted-jobs)/jobs/System-Administrator-56f05445be70773c?fccid=f92d435a448debf1", 
        "company": "IntellaPro", 
        "job_summary": "Our Boca Raton based client is looking to hire a Systems Administrator for a long term contract. The Systems Administrator is responsible for the technical implementation and support of server hardware, networking hardware, storage, appliances, and the installation, maintenance, administration, management, and configuration of server operating systems. The System Administrator collaborates with Project Managers and Application Development teams on projects requiring infrastructure support or migrations.\n-VMware\n-Windows\n-O365\n-Sharepoint\n-IIS\n-Patching/Upgrades\n-AWS/Azure\nThe candidate must be willing to work during on-call rotations and up to 3-4 nights a week. A typical work week might be two 8-hour day shifts onsite in office and three 8-hour night shifts going from 10PM-6AM or 11PM-7AM. During the night shifts candidate would be permitted to work from home.\nSorry, No Third Parties.\nJob Type: Contract\nSalary: $50.00 to $55.00 /hour", 
        "job_date": "2017-04-23 13:57:03.239623", 
        "location": "Boca Raton, FL 33487", 
        "job_title": "Systems Administrator"
    }, 
    "68": {
        "job_url": "/company/Vancouver-Radiologists,-P.C./jobs/Information-Technology-Specialist-7b72f0203a30adee?fccid=117e5335c5fb390e", 
        "company": "Vancouver Radiologists PC", 
        "job_summary": "Vancouver Radiologists, PC has an excellent career opportunity for an entry level Information Technology Specialist. The IT Specialist responsibilities includes support of Active Directory, Exchange, Windows servers and clients to ensure a highly secure, reliable and available infrastructure.\nQualified candidates must have an Associate’s Degree in Information Technology or equivalent directly related work experience and a minimum of 1 year experience managing a MS Active Directory network infrastructure. MCSA, MCSE, MCIPT, or CCNA certification preferred.\nThis full time position offers competitive salary/benefits. Interested and qualified candidates please send resume and salary requirements to Human Resources, Vancouver Radiologists, 4201 NE 66th Avenue, Suite 104, Vancouver WA 98661, or send to our HR email listed below.\nJob Type: Full-time", 
        "job_date": "2017-04-06 13:57:03.393801", 
        "location": "Vancouver, WA 98662", 
        "job_title": "Information Technology Specialist"
    }, 
    "69": {
        "job_url": "/company/Single-Path,-LLC/jobs/IT-Help-Desk-Support-Technician-101ec3b736c84b7b?fccid=33aad51d3efdbc9a", 
        "company": "Single Path LLC", 
        "job_summary": "Primary Duties and Responsibilities include but are not limited to:\nManage the day-to-day functions of using technology including, but not limited to, network, e-mail, and various software systems\nSupport of Macintosh (macOS and macOS server) and Windows (Desktop/Server) operating systems, iOS devices (iPads, iPods), Google Console, including knowledge for VMware\nAbility to deploy software using Network/Server/MDM based software installation\nKnowledge and Support of Workgroup Manager, Open Directory, Active Directory, and Google Console\nInstallation of all new desktop computers, servers, and computer related equipment (printers and other peripherals)\nInstallation and troubleshoot use of interactive teaching solutions (boards & projectors)\nRepair and replace non-functioning computer equipment\nCreate, maintain and update all required computer images\nMaintain and upgrade networking equipment as required\nInstall and support of software and updates as necessary\nMaintaining software license compliance records\nSupport telephone system issues as necessary and facilitating repair requests\nMaintain appropriate physical security and control on all computer assets\nMaintain inventory records of all equipment (purchases, placements, repairs and final dispositions)\nMaintain a working knowledge of all computer-related equipment in order to facilitate timely troubleshooting and repairs\nPerforming other duties as assigned.\nPhysical Demands:\nAbility to read and communicate effectively with employees\nAbility to apply common sense understanding to carry out instructions provided in either written, diagram or oral form\nWork involves walking, talking, hearing, using hands to handle, feel or operate objects or controls, and reaching with hands and arms\nVision abilities required include close vision and the ability to adjust focus\nMay be required to push, pull, lift, and/or carry up to 60 pounds\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\nQualifications:\nBachelor's Degree in Computer Technology or related field or equivalent experience desired\nMinimum two-year experience in computer hardware and software installation and maintenance desired\nThis position requires the ability to establish effective working relationships with all levels of staff\nJob Type: Full-time\nSalary: $32,000.00 to $35,000.00 /year\nRequired experience:\nIT Support: 1 year\nCustomer Service: 1 year", 
        "job_date": "2017-04-21 13:57:03.537547", 
        "location": "Crystal Lake, IL", 
        "job_title": "IT Help Desk Support Technician"
    }, 
    "2": {
        "job_url": "/company/Intex-Recreation-Corp/jobs/IT-Generalist-6b78054be235443c?fccid=2f52ec1606149d18", 
        "company": "Intex Recreation Corp", 
        "job_summary": "INTEX is an entrepreneurial industry leader manufacturing and marketing Above Ground Swimming Pools, Pool Accessories and Inflatable Airbeds. With over 40 years of experience, our well known products are sold worldwide to major retail customers.\nWe have an excellent career opportunity for a JR IT professional. We require 2-4 years of related work experience. Bachelor’s degree and/or certifications preferred. Salary range is between $45,000 - $55,000 DOE\nWe are seeking a dynamic individual who is a quick learner with an open mind. We need someone who is a team player with good communication skills.\nsome responsibilities will include but not limited to:\n1. work with TCP/IP Networks, desktop support, Linux, VMware Virtualization, MS Windows, Active Directory, Firewalls, Network Switches\n2. application support\n3. Network support (routing changes/updates, firewall changes/updates, switching changes/updates)\n4. server support including Linux Servers (Apache, PHP, MySQL)\n5. Windows servers, including active directory, general technical housekeeping & documentation, VOIP, MAC Savy\nIt will be a PLUS to have MCSE Certification, Red Hat Certification, MAC Experience, LAMP stack & strong documentation skills\nIf you are motivated by challenges, take pride in your work, and are looking for a ground-floor opportunity, then consider joining the team that is setting the pace in the industry!\nJob Type: Full-time\nSalary: $55,000.00 /year", 
        "job_date": "2017-04-23 13:54:07.910163", 
        "location": "Long Beach, CA", 
        "job_title": "IT Generalist / Jr. Admin."
    }, 
    "6": {
        "job_url": "/company/Capital-Crossing-Servicing-Company/jobs/IT-Helpdesk-Administrator-fecc9e967fa44c86?fccid=b6acf32321ba192a", 
        "company": "Capital Crossing Servicing Company", 
        "job_summary": "COMPANY OVERVIEW\nCapital Crossing is an industry leading underwriter, investor and servicer of commercial real estate and small business loans. Since 1987, with a disciplined approach, the company has purchased and managed more than $5 billion in assets nationwide, both for its own account and for its strategic partners. It has built its business model and reputation on a strong central core – its people. Our culture is one of teamwork, trust, respect and commitment, and we are always looking for people who are highly motivated and stand out from their peers.\nJOB SUMMARY\nThe Help Desk Administrator is a member of Capital Crossing Servicing Company’s Information Systems team and provides a broad range of technical support for systems, with an emphasis on providing first and second level technical support for the day-to-day operation of employee computers, printers, and applications. The qualified candidate will also assist in monitoring the health of the IT infrastructure by reviewing system reports, monitoring system updates, and recording daily backup performance. In addition, the position will be asked to do various small projects and tasks such as maintaining inventory, imaging computers, setting up new employees, updating network diagrams, and verifying warranties.\nESSENTIAL JOB FUNCTIONS\nRespond to initial support requests via phone, email, or in person\nTrack reported support requests and follow up on unresolved requests\nResolve issues and provide support in the following areas:\nWorkstation and Laptop hardware\nPrinters and Multi-Function Copiers\nWindows 7 and MS Office\nMobile device hardware and connectivity (iPhone/iPad/Surface)\nUser Access\nCreate new accounts\nUpdate network and/or application access privileges\nReset passwords and unlock accounts * Application errors\nInternet and WAN connectivity issues\nRemote access issues\nWi-Fi connectivity issues\nWindows updates\nAnti-virus maintenance\nInventory and tagging of IT assets\nRegular log reviews\nBackups\nServer logs\nNetwork monitoring\nMINIMUM JOB REQUIREMENTS: \nAt least 1 year experience with hands-on support of Windows PC’s, preferably working with Dell computers\nBachelor’s degree in Computer Science, Information Systems, Engineering, Business or other technical area.\nMicrosoft Windows and Office experience\nBasic workstation/laptop/printer hardware knowledge\nSolid Interpersonal Skills (Customer service oriented)\nInterest in technology\nDetail oriented\nAble to work independently\nAbility to multitask\nTeam player\nBasic network security\nJob Type: Full-time\nJob Location:\nBoston, MA", 
        "job_date": "2017-04-18 13:54:14.707326", 
        "location": "['Boston, MA 02110 ', '(Central area)']", 
        "job_title": "IT Helpdesk Administrator"
    }, 
    "99": {
        "job_url": "/company/ACI-Federal/jobs/Information-Technology-Specialist-9d044ce809b1d95b?fccid=58476d2e8b9c7544", 
        "company": "ACI Federal", 
        "job_summary": "Responsibilities: \nApply specialized knowledge in a single discipline such as assembly/integration, cross-discipline functions, data engineering, industry expertise, knowledge engineering or legacy evolution.\nApply specialization to conceptualize, design, construct, test and implement portions of business and technical information technology solutions through application of appropriate software development life cycle methodology.\nInteract with the customer to gain an understanding of the business environment, technical context and organizational strategic direction.\nDefine scope, plans and deliverables for assigned projects.\nCollect, identify, define and organize detailed user and information technology requirements.\nCoordinate and collaborate with others in analyzing collected requirements to ensure plans and identified solutions meet customer needs and expectations.\nConfirm and prioritize project plans and deliverables with the customer.\nParticipate in business and technical information technology solution implementations, upgrades, enhancement and conversions.\nUnderstand and uses appropriate tools to analyze, identify and resolve business and or technical problems.\nApply metrics to monitor performance and measure key project criteria.\nPrepare system documentation.\nEstablish and maintain security, integrity and business continuity controls and documents. Participate in special studies.\nStay current on emerging tools, techniques and technologies.\nAssist information engineers on application of specialized knowledge to coding, testing, implementation\nRequirements: \nHigh school Diploma or General Equivalency Diploma (GED)\nFour to nine (4-9) years of related experience in information systems.\nValid DoD 8570: A+ Certification (could accept Network +, Security +, or CISSP).\nJob Type: Full-time\nSalary: $45,000.00 /year\nRequired education:\nHigh school or equivalent\nRequired experience:\nIT: 4 years\nRequired licenses or certifications:\nA+\nNetwork+, Security+, or CISSP", 
        "job_date": "2017-04-15 13:58:10.880647", 
        "location": "Bremerton, WA", 
        "job_title": "Information Technology Specialist II"
    }, 
    "98": {
        "job_url": "/company/Flexstaff/jobs/IT-Support-Specialist-f85e1b28932add92?fccid=a9113ab282dde37c", 
        "company": "Flexstaff", 
        "job_summary": "Fast-growing and well-established manufacturing company seeks to add a qualified IT Support Specialist to provide help desk solutions for both hardware and software issues. Strong desktop computing, varied software, and network knowledge needed. Position is permanent with benefits, and reports to the IT Manager.\nStarting pay range is $20 - $25 per hour, based on prior experience. Must pass drug screen.\nJob Type: Full-time\nRequired experience:\nIT Support: 2 years", 
        "job_date": "2017-04-20 13:58:04.585127", 
        "location": "Blue Ash, OH", 
        "job_title": "IT Support Specialist"
    }, 
    "91": {
        "job_url": "/company/Rocket-Network-Tools/jobs/Network-Technician-9cae4e6c06b7aed2?fccid=6e8b4baf53f1f2bf", 
        "company": "Rocket Network Tools", 
        "job_summary": "Network Technician will receive, analyze, monitor and resolve network problems in a timely fashion with minimal guidance from more senior technicians or supervisor.\nResponsibilities will include configuring and troubleshooting of routers and switches, opening trouble tickets for various customers, answering incoming telephone calls, responding to network alarms and customer emails, and documenting/updating customer account data,\nEducation: High school or equiv.\nMust be familiar with \nAT LEAST HALF\n of the following: VLANS, VTP, DTP, OSPF, EIGRP, BGP, Solarwinds, HSRP, VRRP, CDP, LLDP, 802.1Q\nMust have strong skills in Cisco CLI (IOS)\nNetwork Automation experience is a plus\nPosition may require shift work based on days of the week or hours.\nCCNA\n or \nNetwork+\n preferred\nThis positions hours are generally: 9am - 6 pm.\nJob Type: Contract\nSalary: $22.00 /hour", 
        "job_date": "2017-04-18 13:57:40.585296", 
        "location": "Ashburn, VA", 
        "job_title": "Network Technician"
    }, 
    "90": {
        "job_url": "/company/Medlinks-Cost-Containment/jobs/IT-Professional-09b5df4cc5faacc3?fccid=fc6dc3f65c8d1671", 
        "company": "Medlinks Cost Containment", 
        "job_summary": "COUNTY OF PLACER looking for IT Professionals!!!\nSalary: TBD\nHours: TBD\nOverall Duties: \n- Install and upgrade desktop hardware, software and peripheral equipment and configures system for optimum operations\n- Analyze and/or resolve hardware, software, and applications problems for network and stand-alone computer systems and network resources supported by the City of Fresno\n- Monitor computer systems, networks, and applications for response time, problem prevention, performance and resource utilization\n- Coordinate the resolution of network hardware, software, and applications problems between technical, support and customer personnel\n- Report hardware failures to appropriate vendors via telephone or on-line systems\n- Evaluate user hardware and software needs and assist in acquisition of approved equipment and software\n- Provide a full range of assistance and help to system and equipment users in role of help desk expert\n- Assist in preparation of user's procedures and documentation\n- Provide operations and support for legacy productions systems including startup, operation of daily production programs, logging results and performing backup procedures\n- Complete scheduled systems operational task and routines such as periodic reports and shutdown/start-up procedures for required maintenance and corrective actions\n- Train users in operating systems, computer language, applications programs, utilities and hardware operation; assist users in applying computer training to work environment; create technical documents and computer training for end-users\n- Analyze problems and design technical solutions to specific departmental needs including spreadsheets, word processors, database, presentation graphics, client/server applications, emulators, communications protocols and intranet/internet\n- Coordinate class preparation, scheduling and billing for services\n- Research and acquire knowledge of computer hardware and software available to users\nQualifications: \nKnowledge of: \n- Principles of and current trends in information technology including systems software and hardware technologies for mainframe, server, personal computer and client server environment - Information technology security methods\n- City rules for information technology projects and business objectives, processes and environment\n- Currently available commercial off-the-shelf software\n- Principles and techniques of training including training needs assessment techniques\n- Disaster planning and recovery methods\n- General computer architecture including application life cycle, central processing unit, memory allocation, peripheral devices and input/output methodologies\n- Various hardware platforms and multiple desktop software including electronic mail systems, spreadsheets, word processors, database, presentation graphics, client/server applications, emulators, communications protocols and intranet/internet\n- Principles and procedures of procedural and fourth generation programming languages\n- Personal computer and local-area-network troubleshooting techniques\n- Personal computer and local-area-network configurations, specifications and requirements\n- Problem tracking software tools, security and quality assurance policies and procedures, document workflow processes, and remote access software and techniques of connectivity\n- Technical documents protocols including manuals, schematics, procedures and specifications\n- Communications protocols, telecommunications and information processing environments\n- Backup and recovery methods, wiring capacities and limitations, intranet and internet technologies\nAbility to: \n- Communicate effectively orally and in written format in a variety of situation and formats\n- Make group presentations\n- Exercise analytical skills in providing fact-based details to support ideas, recommendations, and analysis\n- Reason logically, use a variety of techniques to resolve problems, manage time and resources, concurrently handle multiple assignments and work under strict deadlines\n- Coordinate and facilitate work with others and train and guide others\n- Lift and move equipment weighing up to 50 pounds\n- Analyze, diagnose and resolve customer problems relating to hardware, software and applications software\n- Write programs in appropriate procedural and fourth generation computer language\n- Prepare test data, test, and debug applications program\n- Troubleshoot and perform routine maintenance on computer systems and communications components\n- Operate computer master console and other help desk equipment\n- Configure desktop computers and related peripherals\n- Prepare and present technical oral and written reports\n- Utilize a variety of systems utilities, methods, and techniques\n- Perform backups and restores\nEducation/ Experience: \nA.A or B.A\n in Computer Science, Information Science or Business Information Systems.\nJob Type: Contract\nRequired education:\nAssociate\nRequired experience:\nIT Professional: 3 years\nperation, maintenance, and implementation of applications programs: 2 years", 
        "job_date": "2017-04-19 13:57:40.453717", 
        "location": "Auburn, CA", 
        "job_title": "IT Professional"
    }, 
    "93": {
        "job_url": "/company/Red-Paladin/jobs/System-Administrator-7ac13c94bddaea7e?fccid=e90d309547f42799", 
        "company": "Red Paladin", 
        "job_summary": "SUMMARY\n-Manage and tune client computer software systems, servers, virtual machines, and network connections to ensure high levels of availability and security of the supported business applications. -Participate in the planning and implementation of policies and procedures to ensure system provisioning and maintenance that is consistent with company's goals, industry best practices, and regulatory requirements\nSKILLS\n .\n-Experience with Windows Server (2003, 2008, and 2012) platforms.\n-Experience with Windows Security Configuration and Analysis.Experience with Windows security tools/appliances (Firewalls, IPS).Experience with Local Area Network technologies (Switches, Hubs, Routers, VPN, etc).Working knowledge how to provide support for MS Active Directory including Windows domain group policies and administration.\n-Experience with VMware, Segregated Storage, NAS, SAN, and Backups.Experience with backup and recovery tools/software.\nESSENTIAL DUTIES & JOB RESPONSIBILITIES\n-Troubleshoot network systems and respond to issues and or problems.\n-Provides documentation and management reporting.\n-Provide tactical and strategic input on overall network planning and related projects.\n-Review, analyze and evaluate business systems and user needs.Install new software releases, system upgrades, evaluate and install patches and resolve software and OS related problems.\n-Perform system backups and recovery. Maintain data files and monitors system configuration to ensure data integrity.\n-Provide user support as required.Investigate network and security issues and provide recommendations for improvement.\n-Participate in Business Continuity/Disaster Recovery infrastructure planning, building, and testing.\n-Ensure the integrity and security of enterprise data.\n-Manage end user accounts, permissions, access rights, and storage allocations in accordance with best-practices regarding privacy, security, and regulatory compliance.Perform and test routine system backups and restores.Anticipate, mitigate, identify, troubleshoot, and resolve hardware and software problems.\n-Support application development teams.\n-Analyze system, server, and application, and network, performance.\n-Recommend, schedule, and perform software and hardware improvements, upgrades, patches, reconfiguration, and/or purchases.\n-Conduct research on emerging products, services, protocols, and standards in support of systems software procurement and development efforts.\n-Develop, document, and maintain policies, procedures and associated training plans for system administration and appropriate use.Build and deploy physical and virtual servers.\nJob Type: Full-time\nSalary: $30,000.00 to $40,000.00 /year\nRequired education:\nAssociate\nRequired experience:\nSystem Administration: 6 years", 
        "job_date": "2017-04-21 13:57:41.315804", 
        "location": "Piscataway, NJ 08854", 
        "job_title": "System Administrator"
    }, 
    "92": {
        "job_url": "/company/Third-Helix-Technology/jobs/Mid-Level-Computer-Technician-106fdd6dd077c95c?fccid=d29bd1a7c8990eb4", 
        "company": "Third Helix Technology", 
        "job_summary": "Work Schedule: \n Work Schedule: Monday through Friday, 8:00am – 5:00pm. One hour for lunch. Extended hours may be required on occasion.\nClassification\n : Full-time salary position with Exempt status\nTravel\n : Travel to surrounding businesses or area may be required depending on client needs.\nLocation\n : Oklahoma City, OK (At this time the company does not provide relocation assistance.)\nJob Summary: \n Establishes, plans, and coordinates the overall development, implementation, deployment and operation of information systems and technology solutions for business needs and goals. Identifies, analyzes, and proposes new information technologies and systems to improve business processes and decision making for different departments and determines ways to meet business objectives by modifying existing or developing new processing systems. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks to include managing the system hardware, operating systems, software, and procedures that adhere to the organization’s values and goals.\nSupervision Received: \n Reports to Operation Manager and Owner of Third Helix\nRequired Essential Functions: \nLeads and directs the work of others.\nProvide overall I.T. governance for the organization and clients.\nWide degree of creativity and latitude is expected to accomplish long term goals.\nFamiliar with a variety of concepts, practices, and procedures.\nPlan, implement and monitor changes in infrastructure configurations.\nConfigure hardware and install new software.\nDevelop and maintain system standards.\nMonthly reporting required by clients and their measurements of metrics per individual contractual obligations.\nPerform daily backup operations.\nPerform system monitoring for security purposes.\nMonitor service desk for tickets and assist with assignment to appropriate queue.\nCommunicate regularly with executive management.\nDevelop best practices and written documentation for all I.T. maintenance.\nOversee the provisioning of the end-user services.\nManage hardware and software vendor relationships.\nAdhere to all policies and procedures.\nEnsures technical compliance with HIPAA regulations and standards.\nRequired Education: \n BA/BS in related field of Information Systems, Business, Communications or related field with 3-5 years’ experience. Please read entire job description any resumes not fulfilling requirements and needs listed on job description will be not be accepted.\nPhysical Requirements: \n Sitting for up to 2 hours at a time and lifting up to 20 pounds. May require work on hands and knees.\nSkills/Experience: \nTechnical knowledge of understanding modern business practices.\nExperience with organizational technology, standards and procedures, software and infrastructure.\nCustomer service orientated and experienced problem solver with critical thinking skills.\nStrong knowledge of Information Systems as applied to Management needs.\nStrong leadership skills for managing a team.\nAble to communicate effectively both verbally and through written documentation.\nIntricate knowledge of PC’s/laptops/printer/servers/cloud technology/mobile devices/office equipment\nTeam player, adaptable, and flexible in stressful situations.\nMust be organized and able to multitask with time management skills.\nMust be dependable and punctual.\nMust be able to identify organizational weaknesses and technology that can strengthen those areas.\nAbility to demonstrate competency in one of the following languages: vbscript, cscript, Visual Basic, C#, or Powershell\nCompetency in Network Management including routing concepts, firewall concepts, Unified Threat Management Concepts, backup methodologies and disaster recovery procedures, VLANs, Network Switching, VPN Networking, VIOP, Hyper-V and/or VMWare ESXi.\nCompetency in standard business operating systems and software including Windows desktop operating systems, Microsoft Office Suite, Internet Browsers, Centrally Managed AntiMalware Systems.\nExperience configuring and administering Windows Server operating systems, Corporate Email systems including Microsoft Exchange, and database management systems.\nFor questions or if unable or experiencing difficulty submitting resume, please contact Amanda at 580-233-1125\nJob Type: Full-time\nSalary: $60,000.00 /year\nJob Location:\nOklahoma City, OK\nRequired education:\nBachelor's\nRequired experience:\nInformation Technology (Computer Technician) preferably 3-5: 3 years\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-14 13:57:40.796805", 
        "location": "Oklahoma City, OK", 
        "job_title": "Mid-Level Computer Technician (I.T.)"
    }, 
    "95": {
        "job_url": "/company/Chips-And-Bits-IT/jobs/IT-Specialist-7197e72e8728fa5b?fccid=e2dd7bd2046f08b2", 
        "company": "Chips And Bits  IT", 
        "job_summary": "We are a Growing Small Business looking for people to grow with us. Looking for the person who loves to solve problems, come to the rescue, Jack of all trades, looks forward to challenges, great customer service, and professionalism.\nWe are a multi-faceted technology solutions company, we take on all tasks big and small.\nPrevious experience in IT preferred but not required.\nBig opportunity for growth!!\nJob Type: Full-time\nSalary: $30,000.00 to $60,000.00 /year\nRequired experience:\nIT: 2 years", 
        "job_date": "2017-04-19 13:57:54.453366", 
        "location": "Las Vegas, NV 89146", 
        "job_title": "IT Specialist"
    }, 
    "94": {
        "job_url": "/company/AccelerateRPA/jobs/Associate-Technical-Consultant-49c1864ce0c4503a?fccid=f69aee709a57f28a", 
        "company": "AccelerateRPA", 
        "job_summary": "Associate Technical Consultant - Robotic Process Automation - Global Travel\nAccelerateRPA are looking for 10 additional members to join the team who have a passion for technology who are eager to pursue careers as Technical Consultants. You will be working on projects with large organizations all across the world.\nWe will provide you with thorough training during our 6-week training programme. During this time you will gain project experience and certification in world-leading RPA software. You will also learn about process mapping and business analysis.\nFollowing training, you will work on-site with one of our market leading clients. You will help them configure, develop and support their RPA solution. There is a large client facing element to this position, so it suits someone who enjoys interacting with others and who also has excellent analytical ability.\nAll travel costs and accommodation will be paid for when working on-site with a client.\nYour training and certification will also be paid for and we offer continuous support to all our consultants.\nWe are looking for people with the following:\n- Minimum Bachelors Degree level qualification\n- Excellent analytical ability\n- Passion for travel\n- Strong interest in technology (especially RPA)\nWhat we offer:\n- World leading training\n- Work experience with exceptional companies worldwide\n- Certification in cutting edge software\n- Paid for travel and accommodation\nIf interested in this exciting opportunity, please, send your resume ASAP.\nJob Type: Full-time\nSalary: $50,000.00 /year", 
        "job_date": "2017-04-21 13:57:52.271550", 
        "location": "Boston, MA", 
        "job_title": "Associate Technical Consultant - College Graduate"
    }, 
    "97": {
        "job_url": "/company/Legacy-Medical-Management/jobs/Mid-Level-Computer-Technician-106fdd6dd077c95c?fccid=d29bd1a7c8990eb4", 
        "company": "Third Helix Technology", 
        "job_summary": "Work Schedule: \n Work Schedule: Monday through Friday, 8:00am – 5:00pm. One hour for lunch. Extended hours may be required on occasion.\nClassification\n : Full-time salary position with Exempt status\nTravel\n : Travel to surrounding businesses or area may be required depending on client needs.\nLocation\n : Oklahoma City, OK (At this time the company does not provide relocation assistance.)\nJob Summary: \n Establishes, plans, and coordinates the overall development, implementation, deployment and operation of information systems and technology solutions for business needs and goals. Identifies, analyzes, and proposes new information technologies and systems to improve business processes and decision making for different departments and determines ways to meet business objectives by modifying existing or developing new processing systems. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks to include managing the system hardware, operating systems, software, and procedures that adhere to the organization’s values and goals.\nSupervision Received: \n Reports to Operation Manager and Owner of Third Helix\nRequired Essential Functions: \nLeads and directs the work of others.\nProvide overall I.T. governance for the organization and clients.\nWide degree of creativity and latitude is expected to accomplish long term goals.\nFamiliar with a variety of concepts, practices, and procedures.\nPlan, implement and monitor changes in infrastructure configurations.\nConfigure hardware and install new software.\nDevelop and maintain system standards.\nMonthly reporting required by clients and their measurements of metrics per individual contractual obligations.\nPerform daily backup operations.\nPerform system monitoring for security purposes.\nMonitor service desk for tickets and assist with assignment to appropriate queue.\nCommunicate regularly with executive management.\nDevelop best practices and written documentation for all I.T. maintenance.\nOversee the provisioning of the end-user services.\nManage hardware and software vendor relationships.\nAdhere to all policies and procedures.\nEnsures technical compliance with HIPAA regulations and standards.\nRequired Education: \n BA/BS in related field of Information Systems, Business, Communications or related field with 3-5 years’ experience. Please read entire job description any resumes not fulfilling requirements and needs listed on job description will be not be accepted.\nPhysical Requirements: \n Sitting for up to 2 hours at a time and lifting up to 20 pounds. May require work on hands and knees.\nSkills/Experience: \nTechnical knowledge of understanding modern business practices.\nExperience with organizational technology, standards and procedures, software and infrastructure.\nCustomer service orientated and experienced problem solver with critical thinking skills.\nStrong knowledge of Information Systems as applied to Management needs.\nStrong leadership skills for managing a team.\nAble to communicate effectively both verbally and through written documentation.\nIntricate knowledge of PC’s/laptops/printer/servers/cloud technology/mobile devices/office equipment\nTeam player, adaptable, and flexible in stressful situations.\nMust be organized and able to multitask with time management skills.\nMust be dependable and punctual.\nMust be able to identify organizational weaknesses and technology that can strengthen those areas.\nAbility to demonstrate competency in one of the following languages: vbscript, cscript, Visual Basic, C#, or Powershell\nCompetency in Network Management including routing concepts, firewall concepts, Unified Threat Management Concepts, backup methodologies and disaster recovery procedures, VLANs, Network Switching, VPN Networking, VIOP, Hyper-V and/or VMWare ESXi.\nCompetency in standard business operating systems and software including Windows desktop operating systems, Microsoft Office Suite, Internet Browsers, Centrally Managed AntiMalware Systems.\nExperience configuring and administering Windows Server operating systems, Corporate Email systems including Microsoft Exchange, and database management systems.\nFor questions or if unable or experiencing difficulty submitting resume, please contact Amanda at 580-233-1125\nJob Type: Full-time\nSalary: $60,000.00 /year\nJob Location:\nOklahoma City, OK\nRequired education:\nBachelor's\nRequired experience:\nInformation Technology (Computer Technician) preferably 3-5: 3 years\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-14 13:57:54.845663", 
        "location": "Oklahoma City, OK", 
        "job_title": "Mid-Level Computer Technician (I.T.)"
    }, 
    "96": {
        "job_url": "/company/Rocket-Network-Tools/jobs/Network-Technician-9cae4e6c06b7aed2?fccid=6e8b4baf53f1f2bf", 
        "company": "Rocket Network Tools", 
        "job_summary": "Network Technician will receive, analyze, monitor and resolve network problems in a timely fashion with minimal guidance from more senior technicians or supervisor.\nResponsibilities will include configuring and troubleshooting of routers and switches, opening trouble tickets for various customers, answering incoming telephone calls, responding to network alarms and customer emails, and documenting/updating customer account data,\nEducation: High school or equiv.\nMust be familiar with \nAT LEAST HALF\n of the following: VLANS, VTP, DTP, OSPF, EIGRP, BGP, Solarwinds, HSRP, VRRP, CDP, LLDP, 802.1Q\nMust have strong skills in Cisco CLI (IOS)\nNetwork Automation experience is a plus\nPosition may require shift work based on days of the week or hours.\nCCNA\n or \nNetwork+\n preferred\nThis positions hours are generally: 9am - 6 pm.\nJob Type: Contract\nSalary: $22.00 /hour", 
        "job_date": "2017-04-18 13:57:54.640662", 
        "location": "Ashburn, VA", 
        "job_title": "Network Technician"
    }, 
    "11": {
        "job_url": "/company/Cybertools,-inc./jobs/Computer-Network-Technician-a48466bb7951844d?fccid=2c503e22ce8c4f7b", 
        "company": "Cybertools Inc", 
        "job_summary": "Computer Network Technician / Systems Administrator\nAre you an experienced network technician that is tired of spending hours on a lengthy commute to the north end? Are you interested in working for a professional and innovative company in the South Sound region?\nDo you have an outgoing personality and enjoy working directly with end users and business owners? Do you take pride in your ability to delivering excellent customer service? Are you wanting to work in a team environment where you can contribute your ideas to the company?\nAt Cybertools we provide IT consulting, managed services and break / fix solutions to small and medium sized business clients.\nWe are looking for a network support technician who can help manage and support our client’s IT infrastructures. You will work with evolving technology on a daily basis as well as a variety of networks and clients. This exposure will allow you to gain valuable experience and grow your skill set while working on the job. This unique opportunity allows you to get into an established, growing company and take advantage of the opportunities that will arise as we continue to expand.\nPrimary Responsibilities\nSolve technical issues for our clients both remotely and on-site\nAccurately track your time and work progress in our ticketing system\nIdentify technological solutions that could benefit our clients\nWork with our team to design new solutions to address client needs\nContribute to team meetings by sharing innovative ideas and providing feedback on current solutions\nTechnical Skills Needed\n2 years experience as a network technician, or systems administrator\nExperience with Microsoft server environments\nExperience with Microsoft desktop applications in a networked environment\nExperience in configuration of network firewalls, routers and switches\nExperience in client facing situations preferred\nExcellent communication and interpersonal skills\nExcellent documentation skills and attention to detail\nAbility to multi-task and manage several customer projects at once\nJob Type: Full-time\nSalary: $44,000.00 /year\nRequired experience:\nNetworking: 2 years\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-20 13:54:33.158985", 
        "location": "Puyallup, WA 98374", 
        "job_title": "Computer Network Technician"
    }, 
    "10": {
        "job_url": "/company/SK-HiTech/jobs/Senior-Helpdesk-Tech-07490d3427f5e71a?fccid=266c31d6b0d94d02", 
        "company": "Washington Metropolitan Area Transit Authority", 
        "job_summary": "At least 3 years of experience supervising/managing a Help Desk\nMinimum Certifications: \n Any (3) or any (3) equivalent of: A+, Network+, Project+, Security+, MCSE, MCSA, MCP, HDI Support Center Specialist, ITIL v3 Foundation, PMP Minimum\nEducation: \n Four-year Bachelor Degree from an accredited U.S. school\nDemonstrate expertise in Microsoft operating systems\nDemonstrate working experience with Microsoft Suites and Applications to include Office Professional, Project and Visio Experience with Microsoft Exchange\nFlexible working hours 5 days per week, 6:00a.m. - 7:00pm,\nsupport for evenings, weekends, and holidays.\nExceptional understanding of IT Service Management processes\nDemonstrated experience in managing/scheduling computer refreshes on a scale of hundreds of computers per refresh period\nAn aptitude for providing positive customer service Experience within a Desktop Helpdesk environment\nGood communication, problem solving and technical writing skills\nAn in-depth knowledge of relevant operating systems, applications, printers and other hardware required.\nDisplays courtesy and sensitivity Manages difficult or emotional customer situations\nMeets all commitments Responds promptly to customer needs Solicits customer feedback to improve service\nJob Type: Contract\nSalary: $40.00 /hour", 
        "job_date": "2017-04-13 13:54:33.004298", 
        "location": "['Washington, DC 20001 ', '(Shaw area)']", 
        "job_title": "Sr Helpdesk Tech, Tier III - Team Lead"
    }, 
    "13": {
        "job_url": "/company/Ka'ala-Systems-Technology-Corp./jobs/System-Administrator-3f4caa343ef56f71?fccid=6bc86d656fbf0882", 
        "company": "Kaala Systems Technology Corp", 
        "job_summary": "Description\nKa’ala Systems Technology Corp. is in need of System Administrators to support the Defense Logistics Agency (DLA) by providing End User IT support services for DLA personnel at Naval Base Guam, Santa Rita, Guam, and remotely for other DLA personnel within the region.\nThe Systems Administrator will maintain and return customers to normal IT operations with the smallest possible impact on the business activity of the organization’s end user(s). The Systems Administrator will provide local and remote technical support services for end users on the NIPRNET and SIPRNET and provide support for IT solutions software and hardware service requests for end user issues not resolved at the Initial Response Support level. Additionally, the Systems Administrator will provide IT support in the following areas: device build, maintenance and administration; IT incident and customer service; IT service requests; software support; device wiping and restoration; asset management; installations, moves, adds, changes (IMAC); technology refresh; mobile devices; special needs support; and other ancillary services.\nBasic Qualifications: \nBS degree in an information technology related field with 2 years of experience or- 4 years of IT experience and a combination of education and IT experience totaling 4 years.\nIT-II Level qualified\nIAT-II Level qualified\nMinimum Security+ (CE) and Windows 8 (or higher) certifications IAW DoD 8570\nDemonstrated customer support experience\nValid driver’s license\nActive Secret security clearance\nUS citizenship\nPreferred Qualifications: \nExperience with BMC Remedy trouble ticket software\nExperience with Tier II / Tier III Help Desk response\nExperience supporting DLA or DoD networks\nCompleted Single Scope Background Investigation (SSBI)\nKa’ala Systems Technology Corp. is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA. U.S. Citizenship is required for this position.\nJob Type: Full-time\nSalary: $59,000.00 /year\nJob Location:\nGuam, MO\nRequired education:\nBachelor's\nRequired experience:\nIT experience and a combination of education: 4 years\nRequired licenses or certifications:\nWindows 8 (or higher) certifications in accordacne DoD 8570\nIT-II Level qualified\nvalid driver’s license\nIAT-II Level qualified\nSecurity+ CE\nvalid DoD Secret Clearance or higher", 
        "job_date": "2017-04-21 13:54:35.300479", 
        "location": "Guam, MO", 
        "job_title": "Systems Administrator, End User Support"
    }, 
    "12": {
        "job_url": "/company/Pure-Channel-IT/jobs/Help-Desk-Specialist-504301b6abe46bcf?fccid=d3e3d830a845735f", 
        "company": "Pure Channel  IT", 
        "job_summary": "DOES THIS DESCRIBE YOU?\nYou possess strong IT support skills. You enjoy helping clients over the phone with both Tier 1 and 2 technical issues.\nYou are a problem solver who enjoys troubleshooting technical issues. Finding solutions excites you professionally.\nYou’re a help desk professional looking for a new challenge, and you want to develop your career and move into a technology leadership role.\nYou enjoy working with customers and utilizing your strong communication skills. You want to work for a company dedicated to Information Technology solutions for small business customers.\nWHAT IS PURE CHANNEL IT?\nWe developed a highly efficient and successful way to deliver and support Remote Monitoring and Management (RMM) platforms and managed IT environments.\nWe hire and train the best IT professionals in the business and provide high-touch, elite customer service.\nOur nationwide team implements and supports managed IT and cloud offerings better and more cost effectively than any competitor.\nWe are the pre-eminent supplier of managed IT solutions to small and medium sized business customers.\nTHE NUTS AND BOLTS\nProvide remote customer technical support. Receive incoming calls from clients looking for solutions to technical problems.\nManage RMM client portal setups and configurations. Monitor clients on the portal.\nCoordinate client-site technicians and support Pure Channel IT vCIOs.\nTroubleshoot and coordinate with RMM provider NOC.\nContinue to develop your skills and eventually move into a Sales Engineer and/or leadership role.\nWHAT YOU BRING\nA passion for technology.\nStrong verbal and written communication skills.\nA minimum of 1 year of experience as a Help Desk Analyst or Network Administrator or similar role. We will consider entry-level candidates, but you must be able to demonstrate a basic level of technical aptitude and ambitious personality.\nKnowledge of the following terms and technical tools: Active Directory and group policies, routing and switching, firewalls, configuring and managing mobile devices and patch management.\nExcellent client relationship skills and troubleshooting abilities. Should be able to handle easy to more difficult technical issues with customers.\nStrong desire to learn and develop your skills. You want a career, not just a job.\nJoin a company with a bright future, where your technical expertise, ambition and drive to succeed will be rewarded!\nJob Type: Full-time\nSalary: $32,000.00 to $38,000.00 /year\nRequired experience:\nHelp Desk: 1 year", 
        "job_date": "2017-04-20 13:54:35.125363", 
        "location": "Saint Paul, MN", 
        "job_title": "Help Desk Specialist"
    }, 
    "15": {
        "job_url": "/company/Charter-Schools-USA/jobs/Certified-IT-Technician-Growing-Company-9ed46ebbe28784cf?fccid=ea87c29eed942efb", 
        "company": "Charter Schools USA", 
        "job_summary": "Charter Schools USA is an Education Management Organization with over 8,000 employees which manages over 80 high-performing schools across 7 states! We've experienced 200% growth over the course of the last three years and plan to continue this trend!\nJOB PURPOSE\nTo maintain system availability, ensure effective user support, and maintain software applications to manage CSUSA operations.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nMaintain system availability of critical and non-essential business systems\nProvide customer support through onsite presence and remote access.\nMonitor support requests to determine larger-scale issues.\nInform supervisor of any issue out of the scope or skill range of Technician promptly\nMaintain disaster recovery and prevention procedures.\nParticipate, successfully, in the training programs offered to increase the individual’s skill and proficiency related to the assignments.\nReview current developments, literature and technical sources of information related to job responsibility.\nEnsure adherence to good safety procedures.\nPerform other duties as delegated by Technician Supervisor.\nFollow federal and state laws, as well as company policies.\n**MAY PERFORM OTHER DUTIES AS ASSIGNED**\nDISCLAIMER\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel so classified.\nSKILLS AND KNOWLEDGE\nDemonstrates enthusiasm and commitment toward the job and the mission of the company; supports company’s goals and strategic priorities\nWorks and interacts with staff and relates to individuals at all levels of the organization; relates to individuals at all levels. As unique situations present themselves, the incumbent must be sensitive to corporate needs, employee goodwill, and the public image.\nAbility to organize and manage multiple priorities.\nAbility to consistently be at work, to arrive on time, to follow instructions, to respond to management direction and solicit feedback to improve performance.\nStrong customer orientation.\nEstablishes excellent interpersonal skills between all constituents: being courteous, professional, and helpful; demonstrates high level of interpersonal skills to handle sensitive and confidential situations. Position continually requires demonstrated poise, tact and diplomacy.\nDemonstrates excellent oral (including presentations), written, interpersonal (active listening), skills and ability in negotiating and influencing; great phone etiquette.\nHigh performance teams and a strong team player.\nStrong track record for analyzing complex problems/issues, identifying patterns and recommending creative solutions.\nProactive and takes initiative. Thinks creatively.\nDrives projects to completion. Insists on highest level of quality.\nJOB REQUIREMENTS\nCompTIA A+ Certification Required\nHigh School, Technical School or equivalent combination of education and experience.\n1+ year of experience and/or training in the field related to the title of the position.\nStrong technical ability.\nMust be able to transport self to various facility sites as required. If using own motor vehicle, must possess a valid driver’s license and proof of insurance that meets the minimum standards of the State.\nExperience with complex systems and/or in an educational environment preferred; mastery in Student Information System (SIS) and other software used in the organization.\nCommitment to company values.\nSuch alternatives to the above requirements as CSUSA may find appropriate and acceptable.\nJob Type: Full-time\nJob Location:\nNaples, FL 34120\nRequired education:\nHigh school or equivalent\nRequired experience:\nInformation Technology: 1 year\nRequired license or certification:\nCompTIA A+", 
        "job_date": "2017-04-19 13:54:44.988808", 
        "location": "Naples, FL 34120", 
        "job_title": "A+ Certified IT Technician for a Growing Company! (Collier)"
    }, 
    "14": {
        "job_url": "/company/Expert-Computer-Solutions/jobs/Level-Network-Desktop-Support-Technician-6a920722bfc102fb?fccid=98aaa716b18771b3", 
        "company": "Expert Computer Solutions", 
        "job_summary": "We are an IT consulting / support company looking for an experienced Level II Help Desk/Desktop support professional. If you are stuck in a dead-end job and want to grow your career in IT, we can help. Our company is offering great benefits and incentives to professionals that will fit in with our organization and help us take our business to the next level.\nJob Description\nThe applicant must have the ability to:\nOperate, at times, under limited supervision and direction, provide support for end-user using PC/Apple products.\nHave strong communication and customer service skills\nCommunicate well with other team members\nTroubleshoot Software and Hardware issues over the phone and remotely using IT support tools. - Travel to client locations and provide on-site support when required.\nProvide assistance for smart phones and other messaging devices – BlackBerry, iPhone, Android, etc.\nSupport hardware and software testing.\nSupport, install or maintain the following:\nWindows OS XP, OS Vista, OS Windows 7 & 8, MS Office, Office 365, MS Exchange, Outlook, Active Directory, group policies, Windows domain networking, local area networking, remote access software, VPN technology, virus/spyware removal and recovery, perform PC imaging, personal firewall technologies, Google Apps\nBenefits:\nFlexible schedule.\nMedical and Dental insurance coverage\nProfit Sharing Options\nEmployee discount and technology incentives.\nWorking with a team of professionals who share a common goal.\nQualifications:\nMCP certification is required. MCSE is preferred.\nCandidate should have experience building and maintaining MS server-based infrastructures, administering and troubleshooting MS Active Directory and Exchange, backup applications and knowledge of Google Apps and MS Office 365.\nCandidate should have a strong desire to learn new skills, expand upon and improve existing ones, be detail oriented with the ability to work in a fast-paced, team-oriented environment.\nCandidate should have a bachelor degree in a related area or minimum of 4 years’ experience with helpdesk, application support and should be comfortable with TCP/IP, DNS, DHCP and other networking protocols.\nMust be able to work weekends when on-call.\nAdditional knowledge or requirements:\nExcellent customer service skills Experience with using a CRM and attention to detail. Strong written/verbal communications skills. Strong logical problem solving ability Excellent organization and documentation skills Apple/Mac product knowledge Windows Server 2003/2008 R2/2012 Standard & Essential experience MS SQL Server experience A+/Network+ Ability to identify and recommend improvements Virtualization SharePoint Terminal Server CISCO network infrastructure VMWare knowledge Information security Knowledge of Kaseya Knowledge of ConnectWise Physical Requirements\nMust be able to lift PC equipment (50lbs) and run local cabling. Must have reliable transportation.\n**IMPORTANT - You need to apply on our website in addition to your indeed application. If you do not apply on our website your application will not be considered.\nTO APPLY PLEASE GO TO: www.ecsoffice.com/technology-expert/\nJob Type: Full-time\nSalary: $40,000.00 to $55,000.00 /year\nJob Location:\nHouston, TX\nRequired experience:\nDesktop Support: 4 years", 
        "job_date": "2017-04-23 13:54:43.277944", 
        "location": "Houston, TX", 
        "job_title": "Level II Network/Desktop Support Technician"
    }, 
    "17": {
        "job_url": "/company/Charter-Schools-USA/jobs/Certified-IT-Technician-Growing-Company-9ed46ebbe28784cf?fccid=ea87c29eed942efb", 
        "company": "Charter Schools USA", 
        "job_summary": "Charter Schools USA is an Education Management Organization with over 8,000 employees which manages over 80 high-performing schools across 7 states! We've experienced 200% growth over the course of the last three years and plan to continue this trend!\nJOB PURPOSE\nTo maintain system availability, ensure effective user support, and maintain software applications to manage CSUSA operations.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nMaintain system availability of critical and non-essential business systems\nProvide customer support through onsite presence and remote access.\nMonitor support requests to determine larger-scale issues.\nInform supervisor of any issue out of the scope or skill range of Technician promptly\nMaintain disaster recovery and prevention procedures.\nParticipate, successfully, in the training programs offered to increase the individual’s skill and proficiency related to the assignments.\nReview current developments, literature and technical sources of information related to job responsibility.\nEnsure adherence to good safety procedures.\nPerform other duties as delegated by Technician Supervisor.\nFollow federal and state laws, as well as company policies.\n**MAY PERFORM OTHER DUTIES AS ASSIGNED**\nDISCLAIMER\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel so classified.\nSKILLS AND KNOWLEDGE\nDemonstrates enthusiasm and commitment toward the job and the mission of the company; supports company’s goals and strategic priorities\nWorks and interacts with staff and relates to individuals at all levels of the organization; relates to individuals at all levels. As unique situations present themselves, the incumbent must be sensitive to corporate needs, employee goodwill, and the public image.\nAbility to organize and manage multiple priorities.\nAbility to consistently be at work, to arrive on time, to follow instructions, to respond to management direction and solicit feedback to improve performance.\nStrong customer orientation.\nEstablishes excellent interpersonal skills between all constituents: being courteous, professional, and helpful; demonstrates high level of interpersonal skills to handle sensitive and confidential situations. Position continually requires demonstrated poise, tact and diplomacy.\nDemonstrates excellent oral (including presentations), written, interpersonal (active listening), skills and ability in negotiating and influencing; great phone etiquette.\nHigh performance teams and a strong team player.\nStrong track record for analyzing complex problems/issues, identifying patterns and recommending creative solutions.\nProactive and takes initiative. Thinks creatively.\nDrives projects to completion. Insists on highest level of quality.\nJOB REQUIREMENTS\nCompTIA A+ Certification Required\nHigh School, Technical School or equivalent combination of education and experience.\n1+ year of experience and/or training in the field related to the title of the position.\nStrong technical ability.\nMust be able to transport self to various facility sites as required. If using own motor vehicle, must possess a valid driver’s license and proof of insurance that meets the minimum standards of the State.\nExperience with complex systems and/or in an educational environment preferred; mastery in Student Information System (SIS) and other software used in the organization.\nCommitment to company values.\nSuch alternatives to the above requirements as CSUSA may find appropriate and acceptable.\nJob Type: Full-time\nJob Location:\nNaples, FL 34120\nRequired education:\nHigh school or equivalent\nRequired experience:\nInformation Technology: 1 year\nRequired license or certification:\nCompTIA A+", 
        "job_date": "2017-04-19 13:54:48.541012", 
        "location": "Naples, FL 34120", 
        "job_title": "A+ Certified IT Technician for a Growing Company! (Collier)"
    }, 
    "16": {
        "job_url": "/company/Solidus-Technical-Solutions/jobs/IT-Computer-System-Administrator-e4fc11bd54eedb07?fccid=44faf6c171b2e52d", 
        "company": "Solidus Technical Solutions", 
        "job_summary": "Solidus is seeking a Systems Administrator. The successful candidate will support a team researching and prototyping leading-edge, laser and quantum optical communications technologies. Current areas of research supported include single-photon detector arrays, coherent modems, integrated photonic circuits, and novel modulation and coding approaches. This research is enabled by a well-maintained network of Windows, Linux, and Mac OS personal computers, servers, network attached storage devices, and specialized laboratory equipment.\nThe Systems Administrator will be responsible for procuring, configuring, and maintaining the Optical Communication Technology group's computing, data storage, and networking hardware/software. These responsibilities include off-loading and expediting the group's support requests from the on site helpdesk. The successful candidate will also responsible for complying with security policies set forth by the Information Security Dept. and research sponsors.\nRelevant hardware includes nearly 50 desktop and notebook PCs, as well as several rack-mounted servers, running Windows 7 Enterprise, Linux (CentOS 6 & 7), and Mac OS. Some computers operate in laboratories connected to instruments and prototype equipment or have data acquisition cards installed. The system administrator will assist group members configure device drivers, install engineering software, archive data, and provide general technical support.\nRequirements:\n- US Citizenship and the ability to obtain a DoD Secret Clearance\n- MS with at least 8 years of system administration experience; A degree in an information technology related field, although additional experience may compensate for the lack of a degree\n- Strong interpersonal and communication skills\n- A solid understanding of Windows, Linux, Mac and network administration (including OS installation and patching\n- Ability to write Bash, Python, VBScript, or Windows PowerShell scripts\n- Liaison with on site Information Services and Security Services Departments to comply with security requirements\n- Strong problem-solving skills\n- Self-directed, eager to learn, and works well alone or in a team\n- Can present to an internal audience on hardware/software issues and security policies\n- Ability to write purchase justifications\nAdditionally Desired:\n- Virtual machine support (including ESX Server)\n- Program and group server management and configuration support (including Active Directory account management)\n- Private network support (including hardware, policy) and compliance with information security requirements\nApplicants selected must meet eligibility requirements for access to classified information. U.S. Citizenship may be required. Solidus is an Equal Opportunity Employer and participates in E-Verify. NOTICE OF AFFIRMATIVE ACTION PLAN FOR INDIVIDUALS WITH DISABILITIES, DISABLED VETERANS AND OTHER PROTECTED VETERANS. It is the policy of this Company to seek and employ qualified individuals at all locations and facilities, and to provide equal employment opportunities for all applicants and employees in recruiting, hiring, placement, training, compensation, insurance, benefits, promotion, transfer, and termination. To achieve this, we are dedicated to taking affirmative action to employ and advance in employment qualified individuals with disabilities, disabled veterans, and other protected veterans. The objective in adopting the Affirmative Action Programs is to place qualified individuals with disabilities, disabled veterans and other protected veterans in all job classifications. These Affirmative Action Programs are available for inspection by any applicant or employee by contacting the Company's EEO Coordinator, in the Human Resources office, Monday through Friday, 8am to 5pm", 
        "job_date": "2017-04-19 13:54:48.371061", 
        "location": "Lexington, MA 02420", 
        "job_title": "IT Computer Systems Administrator"
    }, 
    "19": {
        "job_url": "/company/Charter-Schools-USA/jobs/Certified-IT-Technician-Growing-Company-0ce99bddcbbaab03?fccid=ea87c29eed942efb", 
        "company": "Charter Schools USA", 
        "job_summary": "Charter Schools USA is an Education Management Organization with over 8,000 employees which manages over 80 high-performing schools across 7 states! We've experienced 200% growth over the course of the last three years and plan to continue this trend!\nJOB PURPOSE\nTo maintain system availability, ensure effective user support, and maintain software applications to manage CSUSA operations.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nMaintain system availability of critical and non-essential business systems\nProvide customer support through onsite presence and remote access.\nMonitor support requests to determine larger-scale issues.\nInform supervisor of any issue out of the scope or skill range of Technician promptly\nMaintain disaster recovery and prevention procedures.\nParticipate, successfully, in the training programs offered to increase the individual’s skill and proficiency related to the assignments.\nReview current developments, literature and technical sources of information related to job responsibility.\nEnsure adherence to good safety procedures.\nPerform other duties as delegated by Technician Supervisor.\nFollow federal and state laws, as well as company policies.\n**MAY PERFORM OTHER DUTIES AS ASSIGNED**\nDISCLAIMER\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel so classified.\nSKILLS AND KNOWLEDGE\nDemonstrates enthusiasm and commitment toward the job and the mission of the company; supports company’s goals and strategic priorities\nWorks and interacts with staff and relates to individuals at all levels of the organization; relates to individuals at all levels. As unique situations present themselves, the incumbent must be sensitive to corporate needs, employee goodwill, and the public image.\nAbility to organize and manage multiple priorities.\nAbility to consistently be at work, to arrive on time, to follow instructions, to respond to management direction and solicit feedback to improve performance.\nStrong customer orientation.\nEstablishes excellent interpersonal skills between all constituents: being courteous, professional, and helpful; demonstrates high level of interpersonal skills to handle sensitive and confidential situations. Position continually requires demonstrated poise, tact and diplomacy.\nDemonstrates excellent oral (including presentations), written, interpersonal (active listening), skills and ability in negotiating and influencing; great phone etiquette.\nHigh performance teams and a strong team player.\nStrong track record for analyzing complex problems/issues, identifying patterns and recommending creative solutions.\nProactive and takes initiative. Thinks creatively.\nDrives projects to completion. Insists on highest level of quality.\nJob Requirements\nCompTIA A+ Certification Required\nHigh School, Technical School or equivalent combination of education and experience.\n1+ year of experience and/or training in the field related to the title of the position.\nStrong technical ability.\nMust be able to transport self to various facility sites as required. If using own motor vehicle, must possess a valid driver’s license and proof of insurance that meets the minimum standards of the State.\nExperience with complex systems and/or in an educational environment preferred; mastery in Student Information System (SIS) and other software used in the organization.\nCommitment to company values.\nSuch alternatives to the above requirements as CSUSA may find appropriate and acceptable.\nJob Type: Full-time\nJob Location:\nApollo Beach, FL 33572\nRequired education:\nHigh school or equivalent\nRequired experience:\nInformation Technology: 1 year\nRequired license or certification:\nCompTIA A+", 
        "job_date": "2017-04-19 13:54:49.761543", 
        "location": "Apollo Beach, FL 33572", 
        "job_title": "A+ Certified IT Technician for a Growing Company! (Waterset)"
    }, 
    "18": {
        "job_url": "/company/SMS-Data-Products-Group-Inc./jobs/Help-Desk-Specialist-fc0d482e4906ea62?fccid=9de6d6f3e4890fe8", 
        "company": "SMS Data Products Group Inc", 
        "job_summary": "As part of a a tri-zone help desk team, handles daily maintenance and monitoring of managed hardware and software for Hanscom AFB clients and customers, both classifed and unclassifed systems\nSupport client voice issues, to include analog, VoIP and SIP services\nAssists in workstation life-cycle rotations\nEnsures team provides support for remote clients and users\nSupports and complies with IT procedures for team and client usage\nInstalls and configures systems in compliance with AFNet polices and asset management requirements\nSupports team in lifecycle management of existing and new hardware inventory using standard desktop images and entprise client management tools to build, patch secure and deploy desktop computer systems to include computer peripheral equipment\nPrepares and processes Information Technology assets for resource reutilization.\nEnsures workstations, peripherals, communications devices, and operating system/application software are properly configured for network operation, are on-line, and are available to users\nPeriodically reviews processes and procedures and client configurations for completeness, effectiveness and compliance with information assurance polices and DISA STIGs\nServes as the system troubleshooter, a critical role in keeping client systems operational.\nContacts the customer organization Point of Contact to coordinate hardware maintenance when necessary.\nImplements software patches and security fixes.\nEnsures all software installed on customer organization systems is appropriately licensed, authorized, and recorded in the base software license inventory.\nJob Type: Full-time\nJob Location:\nBedford, MA\nRequired education:\nBachelor's\nRequired experience:\nHelp Desk: 1 year\nRequired licenses or certifications:\nSecret\nSecurity + CE", 
        "job_date": "2017-04-21 13:54:48.680668", 
        "location": "Bedford, MA", 
        "job_title": "Help Desk Specialist"
    }, 
    "48": {
        "job_url": "/company/Scenic-Community-Credit-Union/jobs/Information-Technology-Specialist-c584da26e0af5081?fccid=edde55542475256a", 
        "company": "Scenic Community Credit Union", 
        "job_summary": "Responsibilities\nCommunicate with all levels within the Credit Union and provide internal and external users with on-site and remote technical support in conjunction with IT supervisor. Confidentiality is a must.\nInstall, diagnose, repair, maintain and upgrade all computer hardware and software to insure optimal performance. Assist in the planning, design, creation, development, testing, implementation and modification of computer programs related to various machine operating systems to include desktop PCs, laptops, tablets, servers, network equipment and software applications.\nAssist in the organization and inventory of all hardware and software resources and the creation of documents and manuals for the department when needed. Also provide emergency on-call and backup support to IT Supervisor as needed.\nSome college or in college preferred.\nMust be able to lift 40 lbs and be able to work in the cold for long periods.\nJob Type: Full-time", 
        "job_date": "2017-04-23 13:56:04.768969", 
        "location": "Chattanooga, TN", 
        "job_title": "Information Technology Specialist"
    }, 
    "49": {
        "job_url": "/company/Charter-Schools-USA/jobs/Certified-IT-Technician-Growing-Company-e570d80c2fd1f83d?fccid=ea87c29eed942efb", 
        "company": "Charter Schools USA", 
        "job_summary": "Charter Schools USA is an Education Management Organization with over 8,000 employees which manages over 80 high-performing schools across 7 states! We've experienced 200% growth over the course of the last three years and plan to continue this trend!\nJOB PURPOSE\nTo maintain system availability, ensure effective user support, and maintain software applications to manage CSUSA operations.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nMaintain system availability of critical and non-essential business systems\nProvide customer support through onsite presence and remote access.\nMonitor support requests to determine larger-scale issues.\nInform supervisor of any issue out of the scope or skill range of Technician promptly\nMaintain disaster recovery and prevention procedures.\nParticipate, successfully, in the training programs offered to increase the individual’s skill and proficiency related to the assignments.\nReview current developments, literature and technical sources of information related to job responsibility.\nEnsure adherence to good safety procedures.\nPerform other duties as delegated by Technician Supervisor.\nFollow federal and state laws, as well as company policies.\n**MAY PERFORM OTHER DUTIES AS ASSIGNED**\nDISCLAIMER\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel so classified.\nSKILLS AND KNOWLEDGE\nDemonstrates enthusiasm and commitment toward the job and the mission of the company; supports company’s goals and strategic priorities\nWorks and interacts with staff and relates to individuals at all levels of the organization; relates to individuals at all levels. As unique situations present themselves, the incumbent must be sensitive to corporate needs, employee goodwill, and the public image.\nAbility to organize and manage multiple priorities.\nAbility to consistently be at work, to arrive on time, to follow instructions, to respond to management direction and solicit feedback to improve performance.\nStrong customer orientation.\nEstablishes excellent interpersonal skills between all constituents: being courteous, professional, and helpful; demonstrates high level of interpersonal skills to handle sensitive and confidential situations. Position continually requires demonstrated poise, tact and diplomacy.\nDemonstrates excellent oral (including presentations), written, interpersonal (active listening), skills and ability in negotiating and influencing; great phone etiquette.\nHigh performance teams and a strong team player.\nStrong track record for analyzing complex problems/issues, identifying patterns and recommending creative solutions.\nProactive and takes initiative. Thinks creatively.\nDrives projects to completion. Insists on highest level of quality.\nJOB REQUIREMENTS\nCompTIA A+ Certification Required\nHigh School, Technical School or equivalent combination of education and experience.\n1+ year of experience and/or training in the field related to the title of the position.\nStrong technical ability.\nMust be able to transport self to various facility sites as required. If using own motor vehicle, must possess a valid driver’s license and proof of insurance that meets the minimum standards of the State.\nExperience with complex systems and/or in an educational environment preferred; mastery in Student Information System (SIS) and other software used in the organization.\nCommitment to company values.\nSuch alternatives to the above requirements as CSUSA may find appropriate and acceptable.\nJob Type: Full-time\nJob Location:\nGoose Creek, SC 29445\nRequired education:\nHigh school or equivalent\nRequired experience:\nInformation Technology: 1 year\nRequired license or certification:\nCompTIA A+", 
        "job_date": "2017-04-13 13:56:04.908122", 
        "location": "Goose Creek, SC 29445", 
        "job_title": "A+ Certified IT Technician for a Growing Company! (Mevers)"
    }, 
    "46": {
        "job_url": "/company/Strategic-Data-Systems/jobs/IT-Specialist-c0cf3480a2f90b0b?fccid=7195f9d9a703fd11", 
        "company": "Strategic Data Systems", 
        "job_summary": "Strategic Data Systems is looking for an IT Specialist Tier 2 to join our team. We are known for providing IT and Engineering solutions with multiple opportunities supporting the Department of Defense. The Perks: We offer competitive salaries, great benefits package and the opportunity for you to receive or maintain security clearances/certifications that can enhance your IT career locally or beyond.\nIT Specialist Mid\nMarine Corps Base,Camp Pendleton, CA 92055\nSalary Negotiable / Full-Time with Benefits\nFlexible Start-Date – Immediate Opening\nYou will support the installation, configuration and troubleshooting of computer software, printers and networks in an Enterprise-level, DOD Windows / Active Directory environment.\nYour work may also involve: \nPerform repairs on HP & Dell desktops/laptops; along with Xerox, HP and Lexmark network printers.\nUtilize HP Service Manager and Remedy Help Desk Support to prioritize, track and document incident and MAC (move, add, change) tickets.\nPerform hard drive re imaging, data recovery, decryption and encryption.\nDeploy computers, peripherals and configure smart phones/CAC readers.\nUtilize Active Directory, Remote Desktop Connection, Element and HP Service Manager to troubleshoot user account issues and configure DNS/ IP settings.\nTo qualify for this position you will need the following certifications and experience: \nThis role requires someone with 3-4 years' IT support experience, one of the following CompTIA certifications: Security+CE,Network+CE,A+CE and an active DOD security clearance.\nStrategic Data Systems is committed to providing equal employment opportunities to all employees and applicants without regard to race, religion, sex, national origin, age, disability or any other protected status in accordance with all applicable federal, state and local laws.\nJob Type: Full-time\nSalary: $43,680.00 to $52,400.00 /year\nRequired licenses or certifications:\nActive DOD Secret Security Clearance\nCompTIA A+CE or Network+CE or Security+CE", 
        "job_date": "2017-04-18 13:56:03.946715", 
        "location": "Camp Pendleton, CA 92055", 
        "job_title": "IT Specialist"
    }, 
    "47": {
        "job_url": "/company/Enlite-IT-Solutions,-Inc./jobs/IT-Specialist-ec736e3e1e0d3555?fccid=638c7b0fae5518b0", 
        "company": "Enlite  IT  Solutions Inc", 
        "job_summary": "Enlite IT Solutions, Inc., an IT firm specializing in education IT, is seeking candidates for the position of IT specialist. Based in Tustin, CA, Enlite provides complete IT solutions to charter and private schools in the Orange, LA, and Riverside county areas. This is a full time position (40 hrs/week) with time split between the company office and onsite visits to clients.\nResponsibilities: \nReview, triage, and troubleshoot help desk tickets\nWork and consult with Senior Engineer on project planning and implementation\nSupport client environments including deployment and configuration of hardware, software, network, and telecom equipment\nSupport staff and faculty via NOC, phone, email, and Ad-hoc support sessions\nReport and communicate system issues with the Senior Engineer.\nCreate, edit, and maintain client and company documentation, including Knowledge Base articles, password revisions, client system configurations, and all IT related information\nStay abreast with emerging technological developments related to computer hardware, software, as well as the latest trends in computer and systems management\nEducation & Experience: \nBA/BS in Information Technology, Information Science, Information Systems or an equivalent combination of education & experience which has provided both theoretical and practical knowledge in the field.\n4+ years experience in IT preferred\nExperience working in a mixed client environments\nRequired Skills\nMaintain and troubleshoot Windows OS, Mac OS, Linux, Chrome OS\nKnowledge of Active Directory, Azure\nDesired Skills: \nMicrosoft Exchange Server, Office 365, and G-Suite administration\nLayer 2-Layer 7 configuration\nCCNA/CCNP, or other major vendor certification (Juniper, Brocade, etc…)\nMCP/MCSE\nKnowledge of database maintenance, administration, and best practices\nVirtualization/Container knowledge such as VMWare, Hyper-V, and Proxmox\nRemote Client access platforms, RDWeb, AWS, and Citrix\nMSP (Managed Service Provider) experience\nGeneral Skills: \nCapability of expanding quickly into larger responsibilities as the company grows rapidly\nMust successfully pass a background check\nPossess a current valid driver’s license and own a registered/insured vehicle to commute to and from work\nAbility to stand and sit for extended periods of time\nSolid written & verbal skills\nStrong communication skills (in person, phone and/or email)\nAbility to multitask\nAbility to move or carry equipment weighing up to 60lbs\nJob Type: Full-time\nSalary: $35,000.00 to $42,000.00 /year\nRequired experience:\nIT: 4 years\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-21 13:56:04.622323", 
        "location": "Tustin, CA 92780", 
        "job_title": "IT Specialist"
    }, 
    "44": {
        "job_url": "/company/Form-10-Group/jobs/Contract-Computer-Technician-8a2e6472b445f58f?fccid=b66d9a957c6a6d9e", 
        "company": "Form 10 Group", 
        "job_summary": "Our company is looking for short-term contract computer technicians to deploy workstations and related equipment in government offices statewide. Technicians must be able to travel and spend overnight away from home. Travel extending a few days to a week at a time should be expected on this project. This short-term project will run approximately 2 months, piloting in April and running through May.\nThe suitable technician should have experience with IT equipment in a corporate environment. The technician must have extensive PC hardware experience and Windows 7 knowledge. Other knowledge areas include Active Directory, Hard Drive Imaging and Network Management. A+ Certifications or equivalent is a plus.\nMandatory items are you must be a US citizen, have a valid driver's license, and must be able to pass an extensive criminal and financial background check, along with a drug screening.\nThis is a 1099 contractor position. Travel expenses will be paid.\nPlease email your resumes. We will contact suitable candidates for follow-up interview.\nJob Type: Contract\nSalary: $225.00 /day\nJob Location:\nNorth Platte, NE\nRequired experience:\nComputer Hardware: 1 year\nRequired license or certification:\nA+ Certified", 
        "job_date": "2017-03-30 13:56:03.384301", 
        "location": "North Platte, NE", 
        "job_title": "Contract Computer Technician"
    }, 
    "45": {
        "job_url": "/company/Computer-Experts/jobs/PC-Technician-5485af7a72671cd8?fccid=c38f2d1be223ddd1", 
        "company": "Computer Experts", 
        "job_summary": "Computer Experts PC Technicians work in the Service Department of the retail store.\nThe position can be Full-time or Part-time.\nRequired Knowledge/Skills: \n-Experience working with Windows Operating Systems\n-Building custom computers\n-Installing software\n-Virus removals\n-Computer diagnostics\n-Data transfers\n-Excellent interpersonal, written, and telephone skills\n-Exceptional time management ability\nQualifications: \n-Valid driver's license with reliable transportation\n-Able to pass drug test and background check\nJob Type: Full-time", 
        "job_date": "2017-04-21 13:56:03.519613", 
        "location": "Palm Bay, FL 32905", 
        "job_title": "PC Technician"
    }, 
    "42": {
        "job_url": "/company/G5-Tek-Solutions,-LLC/jobs/Network-Technician-ab6f3c40ecef51a5?fccid=44f7193f8a4664e1", 
        "company": "G5 Tek Solutions LLC", 
        "job_summary": "NETWORK TECH - Decatur/Springrield\nNEED TO FILL ASAP\nMust be able to pass a background check.Principle Purpose of Job: The Field Service Technician will be directly responsible for providing preventive maintenance and ongoing repairs to various types of Kiosk: Lobby and Intake Kiosk, In-Pod Kiosks and Video Visitation units. Technician will also be responsible for the service and collections of Lobby Kiosk when directed to do so by G5 TEK, accurately count, sort and deposit funds into a pre-determined account setup.Experience: The proposed Service Technician should have a minimum 2 years related field service experience.Job Functions: &; Test, diagnose, repair and maintain software and hardware, including smaller peripheral components. o This will include, but not be limited to, repairing and/or replacing defective or inadequate parts &; Maintain records of repairs, calibrations and test for trouble ticket tracking. &; Responsible for collecting Lobby and Intake Kiosk and depositing money in pre-determined account setup by vendor &; Must be able to travel from location to location (local travel) to execute duties associated with role, in an assigned territory &; Keep kiosk clean and maintained in proper working order &; Complete timesheets and paperwork as required for this position accurately and in a timely manner. &; Accountable for company assets and parts, as assigned &; Establish and maintain a positive and productive relationship with all current accounts within assigned territory. &; Deliver exceptional customer service, which shall include status updates on outstanding issues Skill Requirements: &; Demonstrates strong analytical, organizational, ,multi-tasking and problems solving skills &; Needs to have high degree of computer literacy, including Microsoft Word, Excel &; Knowledge of XML, Unix, and FTP protocol helpful &; Proficient in basic network troubleshooting to include being able to identify network components &; Use telephony or electrical test instruments to determine inside wire or fiber defects &; Identify and terminate cable color codes &; Basic telephony understanding, responsible for repairing inmate telephones (IE handsets/dialpad/hookswitch); Ability to pull and terminate Cat5/Cat6 cablePhysical: &; Ability to lift and/or move up to 75 pounds and frequently lift and/or move up to 40 pounds &; Ability to bend, kneel, and stand for extended periods of time Other: &; Ability to successfully pass drug screen and background check &; Must have clean driving record (past 2 years) valid state driver’s license and reliable transportation &; Able to work in a high security prison environment with direct interaction with inmates &; Signature of strict non-disclosure and confidentiality agreement(s) &; Proven ability to work with minimal supervision\nJob Type: Full-time\nSalary: $18.00 /hour\nJob Type: Full-time\nSalary: $18.00 /hour\nJob Type: Full-time\nSalary: $18.00 /hour\nRequired experience:\nNetwork Technician: 1 year", 
        "job_date": "2017-04-20 13:55:51.595432", 
        "location": "Springfield, IL", 
        "job_title": "Network Technician"
    }, 
    "43": {
        "job_url": "/company/Norman-Alan-Company,-LLC/jobs/IT-Field-Service-Technician-7eab1ce886023de3?fccid=642b93c8608bd8a9", 
        "company": "Norman Alan Company LLC", 
        "job_summary": "Norman Alan Company is a diversified staff of information technology professionals working as a team to design, implement, and maintain IT systems for companies in Greensburg and surrounding areas. Our primary IT Services include: Network Design and Placement, Managed Services, Remote Support Services, and Cloud Services.\nAs a Network Administrator, you will be responsible for onsite support at the offices of our clients. This position is responsible for providing all aspects of ongoing network administration, server support and end-user support – from solving problems, to making changes, to proactive and preventative maintenance, to reactive support.\nPrimary Responsibilities: \nInstalling, managing, configuring and troubleshooting software on desktops and laptops.\nInstalling, managing, configuring and troubleshooting software on servers.\nManaging, configuring and troubleshooting firewall security appliance.\nUser account maintenance, including: adding new user accounts; setting-up new user desktop profiles and mail profiles; deleting user accounts; and resetting passwords.\nComputer setup, including: setting up and connecting new computers, installing software, setting-up user profiles, migrating profiles and data.\nNormal working hours are Mon – Fri, 8 AM – 5 PM however, candidate must be able to work after hours and weekends as scheduled.\nNorman Alan Company will only entertain individuals that have strong work ethic, professional appearance, sharp communication skills, and experience dealing with corporate clients.\nDesired Qualifications: \nAssociate or Bachelor’s degree in technical field\n3+ yrs. experience supporting multiple customers via phone or in the field\nMicrosoft-based Server environments, SonicWALL products, disk-based and cloud based backup solutions and related network infrastructure including PC’s and mobile devices.\nMicrosoft Server OS administration and configuration\nFunctional knowledge of core networking concepts including TCP/IP, DHCP, DNS\nExchange administration with migration and upgrade experience\nStrong troubleshooting skills\nLAN/WAN (VPN, VLAN, Firewalls, etc.)\nMicrosoft Certification a plus\nWork Environment Conditions: \nLocation: Daily local car travel in a 50-mile radius of Greensburg is required, using a personal vehicle. On most occasions, work for this position is performed in the field, onsite at the offices of our clients in the local area. A valid driver's license, a reliable personal vehicle, and a responsible driving record are required.\nPhysical Requirements: \nThe employee is frequently required to stand, walk and sit, and use hands to operate computer keyboard, mouse, telephone and basic office equipment. The employee is occasionally required to stoop, kneel, crouch or crawl. The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. While performing the duties of this job, the employee is regularly required to talk, see and hear. Ability to drive a vehicle.\nSalary & Compensation: \nExpense reimbursement for any travel  * Excellent Health/Vision/Dental plans - premium 100% paid by Norman Alan Company for employee, spouse and dependents\n401k Retirement Plan w/ 6% Company Match\nPaid Vacation, Sick Time & Holidays\nRequired experience: \nIT Support: 3 years+\nRequired education: \nAssociate\nJob Type: \nFull-Time Salary\nPlease include salary requirement when submitting your resume.\nNOTE: Resumes will NOT be considered from outside the Greensburg/Pittsburgh Metro Region. NOTE: Resumes will NOT be considered if you do not have 3+ years of relevant IT experience.\nJob Type: Full-time\nSalary: $40,000.00 to $60,000.00 /year", 
        "job_date": "2017-04-18 13:56:01.810623", 
        "location": "Greensburg, PA 15601", 
        "job_title": "IT Field Service Technician"
    }, 
    "40": {
        "job_url": "/company/SalesPad/jobs/IT-Technician-7cbde58db5c8cd36?fccid=1100aa24b4534a55", 
        "company": "SalesPad LLC", 
        "job_summary": "Job Description\nThe IT Technician will assist the Network Administrator on a variety of internal IT tasks. They will be responsible for answering questions and resolving hardware/software issues for employees of SalesPad.\nJob Responsibilities\nIn essence, the IT Technician is responsible for helping to ensure the smooth running of SalesPad’s internal infrastructure. Tasks will vary depending on the assignment but will typically include the following:\nAssist with day to day operations and internal issue escalation or resolution;\nIT Troubleshooting and fielding IT related questions;\nPrioritize and manage several open cases at one time;\nNew employee hardware/software setup (new computer deployment);\nVirtual machine setup / deployment;\nAsset Management;\nAssist with developing documentation and procedures regarding SalesPad’s infrastructure.\nJob Requirements\nExperience working in a Client Help Desk setting (preferred not required);\nModerate networking skills and issue diagnosis;\nWorking knowledge of Windows 8/10 Operating System;\nHardware knowledge and experience with wireless systems;\nWorking knowledge of VMware or Hyper-V virtual machine systems;\nResults orientated attitude and strong interpersonal skills;\nExcellent written and verbal communication; strong attention to detail.\nJob Type: Full-time\nSalary: $40,000.00 /year\nRequired experience:\nInformation Technology: 1 year", 
        "job_date": "2017-04-18 13:55:48.680945", 
        "location": "Grand Rapids, MI 49546", 
        "job_title": "IT Technician"
    }, 
    "41": {
        "job_url": "/company/SmartSource,-Inc./jobs/Office-Move-eeb5076647a05b3f?fccid=ef6e70a8609c4775", 
        "company": "SmartSource Inc", 
        "job_summary": "SmartSource is in need of (3) IT Techs for an office move at a client site in the Boston area.\nLocation change: Moving from \nMalden, MA\n office to \nMedford, MA\n office.\nDates: April 26th to May 3rd\nPay Rate: $24.00 per hour\nScope of work: \n· Unmount of Server/Network equipment and remount at new location.\n· Network LAN/Wi-Fi check at new location.\n· Post move checks.\nIf you or anyone you know is qualified and would be interested in this job opportunity, please send WORD Resume ASAP!\nJob Type: Temporary\nSalary: $24.00 /hour\nJob Location:\nMedford, MA", 
        "job_date": "2017-04-20 13:55:48.891502", 
        "location": "Medford, MA", 
        "job_title": "OFFICE MOVE - IT TECHS NEED (Malden to Medford, MA)"
    }, 
    "1": {
        "job_url": "/company/Sage-Network-Inc./jobs/Helpdesk-Tech-c662677b9b630212?fccid=df77686316b7d023", 
        "company": "Sage Network & Communications", 
        "job_summary": "Helpdesk Tech I is responsible for first response in answering, commenting and replying to open incidents in the help desk. Ability to identify and organize tickets according to priority. Strong aptitude in O.S. Repairs, Spyware removal, virus removal, hardware, troubleshoot, upgrades. Update and maintain company contacts. Assist support staff with field work as needed. Sets up and operates computer and machinery peripheral to computer for purpose of providing information to requesting clients. Work requires knowledge of computer logic and methodology to run computer systems. Work requires ability to read and comprehend instruction manuals in order to make minor repairs to computer equipment. Reports to Supervisor.Employee will receive moderate supervision with some on-the job training. After completion of training, employee will receive minimal supervision. The job starts promptly at 8:00 a.m. and ends at 5:00 p.m. with static breaks.Help Desk (Support I/Tier I), has access to confidential information, it is required to fill out the non-disclosure confidentiality agreement in terms of client and company records.Responsibilities:\nAble to identify and organize tickets according to priority.\nDistribute tickets to engineers and technicians.\nAssist with fieldwork as requested.\nUpdate and maintain company contacts.\nSets and loads computer equipment with required items and prepares computer equipment for operation.\nOperates computer for purpose of providing information to requesting clients and/or other Technicians.\nTroubleshoots minor equipment malfunctions and corrects them as directed by computer operation manuals, or supervisor.\nPerforms task necessary to prepare computer-provided information for delivery to requesting clients.\nTrains clients on operating system.\nAble to react to change productively and handle other essential task as assigned.\nOffice work as assigned.\nMaintains log of all worked preformed and processed, and turned in to supervisor by the end of the day.\nOther task assigned.\nKnowledge, Skills and Abilities Required of Employee:\nStrong aptitude in OS repairs, spyware and virus removal, hardware, upgrades and troubleshooting.\nAbility to read computer instruction manuals and comprehend directions therein in order to remedy minor computer equipment malfunctions.\nKnowledge of computer logic in order to perform task listed under principal duties, and responsibilities.\nKnowledge of methodology to run computer systems and to troubleshoot minor computer equipment malfunctions.\nInterpersonal skills necessary to train others in computer systems.\nAbility to communicate problems with supervisors as they become known.\nMust maintain confidentiality.\nAbility to meet deadlines.\nAbility to provide customer with outstanding customer care and service at all times.\nAdditional or different functions may be assigned from time to time.\nAll job requirements are subject to possible modifications. This job description in no way states or implies that these are the only duties to be performed by the employee occupying this positions. Employees will be required to follow any other job related instructions and perform other job-related duties requested by their supervisor in compliance with Federal and State Laws. Requirements are representative of minimum levels of knowledge, skills, and/or abilities to perform this job successfully; the employee must possess the abilities or aptitudes to perform each duty proficiently. Continued employment on at \"at-will\" basis.\nEmployee must be able to relate to other people beyond giving and receiving instructions: Can get along with other co-workers or peers without exhibiting behavioral extremes; perform work activities requiring negotiating, instructing, supervising, persuading or speaking to others; and respond appropriately to criticism from a supervisor.\nJob Type: Full-time\nSalary: $17.00 to $20.00 /hour\nRequired experience:\nCompTIA Network: 1 year\nHelpdesk: 1 year\nComptia A+: 1 year", 
        "job_date": "2017-04-21 13:54:05.011787", 
        "location": "Camarillo, CA 93010", 
        "job_title": "Helpdesk Tech I"
    }, 
    "5": {
        "job_url": "/company/Dante's-Pool-Service-&-Repair/jobs/Pool-Service-Technician-7b312367f6cff515?fccid=50e6792999838a28", 
        "company": "Dantes Pool Service & Repair", 
        "job_summary": "Hello Job Seeker Have you been looking for us?\nThe pool servicing industry is in demand, and we are seeking the right person to join our crew.\nWe are a Tucson-based Pool Service Company, seeking an energetic and personally motivated individual who enjoys working outdoors to join our pool service team! We are a growing company and in need of aquatic masters. This job has opportunities for advancement.\nThe objective of this job is to make the customer happy with our services. The right candidate will be able to work at a quick pace but maintain a focus on \nquality\n .\nThis position is physically demanding and will require activities that include repetitive bending, reaching, stooping, lifting, etc. Regular activities include, but are not limited to: Netting the surface of the water, vacuuming pools, cleaning tiles, cleaning filters, testing and adjusting water balance, loading and unloading chemicals, study of water hydraulics and how it affects the pools water clarity; taking and reporting detailed field notes; communicating effectively with other team members and supervisors and most importantly CUSTOMERS. Typical hours are from 6:30 AM to 4:30 PM Monday through Friday, plus weekend coverage on a NEEDED basis.\nIf you believe you have what it takes to perform well in this business and have a valid AZ driver's license with clean driving record for the last 5 years (no at fault accidents, suspensions, or major moving violations). We will provide training for pool maintenance (no less than a two-week period). Prior knowledge or experience is a plus.\nTHE MORE YOU INVOLVE YOURSELF, THE MORE MONEY YOU CAN GENERATE WITH THIS COMPANY.\nJob Type: Full-time\nSalary: $80.00 /day\nJob Location:\nTucson, AZ 85716\nRequired education:\nHigh school or equivalent\nRequired experience:\nBasic Computer Skills: 1 year\nBasic Math: 1 year\nReading and Writing: 1 year\nRequired license or certification:\nDriver's License\nJob Type: Full-time\nSalary: $80.00 /day\nJob Location:\nTucson, AZ 85716\nRequired education:\nHigh school or equivalent\nRequired experience:\nReading and Writing: 1 year\nBasic Computer: 1 year\nBasic Math: 1 year\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-21 13:54:14.209878", 
        "location": "['Tucson, AZ 85716 ', '(Palo Verde area)']", 
        "job_title": "Pool Service Technician"
    }, 
    "9": {
        "job_url": "/company/Cybertools,-inc./jobs/Computer-Network-Technician-a48466bb7951844d?fccid=2c503e22ce8c4f7b", 
        "company": "Cybertools Inc", 
        "job_summary": "Computer Network Technician / Systems Administrator\nAre you an experienced network technician that is tired of spending hours on a lengthy commute to the north end? Are you interested in working for a professional and innovative company in the South Sound region?\nDo you have an outgoing personality and enjoy working directly with end users and business owners? Do you take pride in your ability to delivering excellent customer service? Are you wanting to work in a team environment where you can contribute your ideas to the company?\nAt Cybertools we provide IT consulting, managed services and break / fix solutions to small and medium sized business clients.\nWe are looking for a network support technician who can help manage and support our client’s IT infrastructures. You will work with evolving technology on a daily basis as well as a variety of networks and clients. This exposure will allow you to gain valuable experience and grow your skill set while working on the job. This unique opportunity allows you to get into an established, growing company and take advantage of the opportunities that will arise as we continue to expand.\nPrimary Responsibilities\nSolve technical issues for our clients both remotely and on-site\nAccurately track your time and work progress in our ticketing system\nIdentify technological solutions that could benefit our clients\nWork with our team to design new solutions to address client needs\nContribute to team meetings by sharing innovative ideas and providing feedback on current solutions\nTechnical Skills Needed\n2 years experience as a network technician, or systems administrator\nExperience with Microsoft server environments\nExperience with Microsoft desktop applications in a networked environment\nExperience in configuration of network firewalls, routers and switches\nExperience in client facing situations preferred\nExcellent communication and interpersonal skills\nExcellent documentation skills and attention to detail\nAbility to multi-task and manage several customer projects at once\nJob Type: Full-time\nSalary: $44,000.00 /year\nRequired experience:\nNetworking: 2 years\nRequired license or certification:\nDriver's License", 
        "job_date": "2017-04-20 13:54:27.272776", 
        "location": "Puyallup, WA 98374", 
        "job_title": "Computer Network Technician"
    }, 
    "77": {
        "job_url": "/company/FAST-I.T.-Solution/jobs/Internship-T-0b6df996477e8cd3?fccid=0e87772b119810db", 
        "company": "FAST IT Solution", 
        "job_summary": "FAST I.T. Solution is a fast-growing Cloud technology company that is a customer-oriented, business information management company. We are now looking for a people who willing to learn and gain experience in IT.\nDo you have the willingness to learn and gain experience? This is a great internship opportunity for you! We are seeking a highly-motivated individual to join our team.\nJob Type: Intern / Internship\nWho is eligible:\nA high school graduate or GED recipient\nA U.S. citizen, permanent resident, or have an employment authorization\nAvailable Monday-Friday for the full program year\nHighly motivated to learn technical and professional skills\nThe position requires:\nTechnical background and knowledge\nCloud, server, general computer hardware, network and sales skill. (Any certificates related is plus.)\nSelf-learning skills\nPeople who are confident and has a positive personality\nRequire experience: \nLinux server\nCloud Knowledge\nKnowledge of Linux System\nExperience with computers and Linux troubleshooting\nFamiliarity with IT hardware and software network\nRequired education:\nAssociate or equivalent\nSalary: $10-$15\nRequired experience:\nEngineering: 1 year\nThis is a part-time positon and will turn into full-time depend on performance.\nJob Type: Internship\nJob Location:\nFullerton, CA\nRequired education:\nHigh school or equivalent", 
        "job_date": "2017-04-21 13:57:22.056052", 
        "location": "Fullerton, CA 92831", 
        "job_title": "Internship in I.T."
    }, 
    "76": {
        "job_url": "/company/First-Community-Bank/jobs/Information-Technology-Specialist-ed539b136f323064?fccid=5c184a946b7a3505", 
        "company": "First Community Bank-Harbor Springs", 
        "job_summary": "The IT Support position is the first point of contact for First Community Bank staff seeking technical assistance for banking technology issues. Responsible for configuring and supporting computer related hardware and software to insure proper function of PC’s, thin clients, Internet Banking, Telephone Banking and other installed programs. Provide technical assistance for both local and remote users.\nThe ideal applicant would have an associates degree in computer systems or equivalent; CIS hands-on experience or equivalent in educational background. Experience troubleshooting computer, printer, and server issues. Computer programming and problem solving skills a plus.\nThis position requires a friendly presence and helpful attitude; good interpersonal skills and ability to work well with others. Ability to provide technical support over the phone; good phone skills, and professional demeanor are strongly desired. Good problem solving skills; ability to visualize a problem or situation and think abstractly to solve it. Ability to handle constantly changing work-flow; remain productive during slow times, be able to prioritize and multitask effectively during busy times, exercise patience and professionalism during stressful situations. Ability to work responsibly with or without direct supervision. Working knowledge of common operating systems and software applications. First Community Bank is an equal opportunity employer.\nJob Type: Full-time\nRequired education:\nAssociate", 
        "job_date": "2017-04-18 13:57:21.897337", 
        "location": "Harbor Springs, MI", 
        "job_title": "Information Technology Specialist"
    }, 
    "75": {
        "job_url": "/company/Team-Technology/jobs/IT-Generalist-a03b004b73b1e268?fccid=40197a9c732b1dc2", 
        "company": "Team Technology", 
        "job_summary": "Team Technology is looking for a well-rounded IT candidate for a client. In this position, you will be assisting with an ERP implementation (TEAM will handle most of the implementation), as well as handling all of the day to day for the company. Learning how to program the Machines in a manufacturing setting. This is a great position with a lot of room to grow. Starting out as a IT generalist, and developing into Director of IT.\nDesired Skills:\nPLC programming\nExperience working with an ERP system\nAbility to think ahead, and prevent issues from becoming problems\nEducation:\nDegree in Technology/Certs in Technology/Work experience in this field\nJob Type: Full-time\nSalary: $50,000.00 /year", 
        "job_date": "2017-04-07 13:57:14.408670", 
        "location": "Kings Mountain, NC", 
        "job_title": "IT Generalist"
    }, 
    "74": {
        "job_url": "/company/FAST-I.T.-Solution/jobs/Internship-T-0b6df996477e8cd3?fccid=0e87772b119810db", 
        "company": "FAST IT Solution", 
        "job_summary": "FAST I.T. Solution is a fast-growing Cloud technology company that is a customer-oriented, business information management company. We are now looking for a people who willing to learn and gain experience in IT.\nDo you have the willingness to learn and gain experience? This is a great internship opportunity for you! We are seeking a highly-motivated individual to join our team.\nJob Type: Intern / Internship\nWho is eligible:\nA high school graduate or GED recipient\nA U.S. citizen, permanent resident, or have an employment authorization\nAvailable Monday-Friday for the full program year\nHighly motivated to learn technical and professional skills\nThe position requires:\nTechnical background and knowledge\nCloud, server, general computer hardware, network and sales skill. (Any certificates related is plus.)\nSelf-learning skills\nPeople who are confident and has a positive personality\nRequire experience: \nLinux server\nCloud Knowledge\nKnowledge of Linux System\nExperience with computers and Linux troubleshooting\nFamiliarity with IT hardware and software network\nRequired education:\nAssociate or equivalent\nSalary: $10-$15\nRequired experience:\nEngineering: 1 year\nThis is a part-time positon and will turn into full-time depend on performance.\nJob Type: Internship\nJob Location:\nFullerton, CA\nRequired education:\nHigh school or equivalent", 
        "job_date": "2017-04-21 13:57:11.473696", 
        "location": "Fullerton, CA 92831", 
        "job_title": "Internship in I.T."
    }, 
    "73": {
        "job_url": "/company/NextGen-Information-Services,-Inc./jobs/IT-Infrastructure-Technician-6052b1f980255b7d?fccid=36ee1b4ad396c665", 
        "company": "NextGen Information Services Inc", 
        "job_summary": "Job Title: IT Infrastructure Technician\nJob Location: Cleveland, OH 44125\nJob Duration: ASAP - 04/12/2018\nHours: 8am to 4:30pm Mon-Fri\nJob Description: \nLocal candidates only\nPOSITION PURPOSE: \nThe IT Infrastructure Technician is responsible to implement and provide hands-on support for standard Information Technology Solutions (applications, servers, network, PC’s) for a Site organization.\nThe role is also responsible to participate in regional and global networks, to leverage existing information technology solutions and enforce corporate standards.\nKEY RESPONSIBILITIES: \nProvide support for assigned site(s) out of scope computers by completing installations, performing maintenance and/or upgrades and scheduled back-ups.\nUnderstand the interaction between the OS and applications.\nAnticipate the impact of changes and resolve problems as new OS’s hardware or software versions are deployed.\nManage all IT assets at site, including Out of Scope PCs, printers, network equipment, and software licenses.\nBe the contact for server support group in the event they need someone to physically work on the servers.\nDAILY DUTIES: \nRespond to and resolve out of scope tickets.\nEnsure conference room equipment is maintained and operational. Provide equipment support for meetings as need arises.\nEscalate issues and concerns to IT Leader in a timely fashion.\nInstall out of scope PC’s, using the standard corporate image.\nProvide site based PC support for Out of Scope machines, including hardware troubleshooting and repair, install updates/patches as needed, provide software support.\nInterface with vendors to resolve software\\hardware issues for Out of Scope PCs.\nFunction as a member of project teams for site or corporate IT initiatives, ensure the complete implementation\nAssist in development and delivery of training for users for new or existing programs\\initiatives.\nMINIMUM REQUIREMENTS: \nAssociates degree or equivalent preferred\nMinimum of 3 years applied experience in Information Technology within a business or manufacturing site\nDemonstrated ability to effectively work with and through others\nPrevious experience and demonstrated ability to interface with business, function, or site for IT issues\nDemonstrated technical skills including\nExpert level ability with PC’s and software installations\nWindows 2007 Operating System\nWorking knowledge of the Microsoft Office Suite\nKnowledge of tape backup systems.\nLevel 1 troubleshooting of TCPIP\nExperience with remote desktop software\nJob Type: Contract\nSalary: $30.00 to $41.88 /hour\nRequired education:\nAssociate\nRequired experience:\nInformation Technology: 3 years", 
        "job_date": "2017-04-13 13:57:11.321551", 
        "location": "Cleveland, OH 44125", 
        "job_title": "IT Infrastructure Technician"
    }, 
    "72": {
        "job_url": "/company/Consumer-Direct-Inc./jobs/Junior-System-Administrator-e52488cdf22ce1d9?fccid=f96142b65bae1ccb", 
        "company": "Consumer Direct Inc", 
        "job_summary": "We’re looking for a Junior Systems Administrator to step in and keep our Office and Production environment running smooth. The ideal candidate will have a passion for architecting and building out efficient and automated systems and will not shy away from change when they see a better solution.\nJob Duties\nWrite and maintain shell scripts\nConfigure & harden linux servers\nArchitect automation solutions for code deployments\nProvide office desktop support Mac & Windows\nMonitor systems daily & troubleshoot errors\nArchitect & configure upgrades/changes to production environment\nPerform regular security scan of network & severs\nPerform misc. job related duties as assigned\nKnowledge/Skills Required\nKnowledge of linux\nKnowledge of SSH\nKnowledge of relational databases including a database query language\nSkilled in the use of personal computers and related software applications\nGeneral knowledge of the Internet including surfing and how to search keywords using search engines such as Google\nEmail configuration settings for Outlook, MacMail, Thunderbird, smartphone devices and other common email clients\nFamiliarity with Protocols (HTTP, FTP, SSH, SSL, MySQL, POP3, IMAP, SMTP)\nHelpful Skills\nKnowledge of Docker\nKnowledge of MySQL\nKnowledge of Jenkins\nKnowledge of Payment Card Industry (PCI) best practices for security\nPassion for systems & network security\nPrevious server administration\nAmazon Web Services (AWS) experience\nFamiliarity with networking (routers, switches, DNS) etc.\nFamiliarity with programming languages such (JAVA, PHP)\nJob Type: Full-time\nSalary: $45,000.00 to $65,000.00 /year", 
        "job_date": "2017-04-20 13:57:11.181702", 
        "location": "Costa Mesa, CA 92626", 
        "job_title": "Jr. System Administrator"
    }, 
    "71": {
        "job_url": "/company/Interpreters-Unlimited/jobs/IT-Support-Specialist-163c7d6dfc92b944?fccid=ae56619a97def1c2", 
        "company": "Interpreters Unlimited", 
        "job_summary": "Would you like to work with top professionals in a corporate office environment in beautiful Scripps Ranch? Come work at a company where you can take lunch breaks at Lake Miramar and make a difference working with entrepreneurs that shape our industry on the daily. Check out our website for more information about our award winning company.\nTHE COMPANY:\nInterpreters Unlimited provides solutions wherever language creates a barrier to effective communication. In 1970, Interpreters Unlimited was established with the mission to provide language services nationwide. More than 40 years later, the Interpreters Unlimited database is currently comprised of over 8,000 language experts across the country offering interpretation and translation services in 130+ languages. Interpreters Unlimited has a growing national presence, with offices located in the East, Central, and Western regions of the United States.\nWe believe in a work-life balance\nWe offer the best benefits in the industry\nU.S. Small Business Administration Minority-Owned Business of the Year 2017, San Diego\nInc. 5000 Fastest-Growing Private Companies in America 2016\nTHE POSITION:\nWe're looking for an Information Technology Support Specialist for our San Diego office. You will assist with procurement and implementation of new servers, technology, systems development and user management. Provide user level technical support for end users, computers, printers, etc. and training on daily applications used, including, but not limited to: MS Word, MS Excel, MS Outlook, MS Publisher, Adobe Acrobat, and other basic computer related skills. Monitor printers, copiers, and fax machines to ensure they are working properly and receiving regular maintenance. Provide high degree of professionalism, end user satisfaction and work well with others. The setting is in a corporate office environment and the work hours are 8 AM - 5 PM Monday through Friday. Pay will commensurate with qualifications and experience ranging from $17 to $20 per hour with PTO.\nExcellent Benefits Package\nCorporate Kitchen stocked with snacks and coffee\nCasual Fridays and catered continental breakfast\nFitness Center with showers and beautiful outdoor cafe\nTHE LOCATION:\nInterpreters Unlimited is based in the affluent community of Scripps Ranch in beautiful San Diego, CA. Lake Miramar is located within Scripps Ranch and offers recreational boating and fishing. A feature of Scripps Ranch is its landscaping, which includes many mature eucalyptus trees that are most apparent along Pomerado Road. The area is a short drive to the beaches of San Diego, and is known for its natural beauty, boating, fishing and surfing. San Diego is known for it's culinary scene, top schools and great music scene.\nWHY SHOULD YOU APPLY?\nGreat pay\nSupportive work environment\nExcellent benefits\n5 day work week\nSolid award winning company\nINTERESTED?\nPlease contact us.\nJob Type: Full-time\nSalary: $17.04 to $20.12 /hour\nRequired experience:\nIT Support: 3 years", 
        "job_date": "2017-04-21 13:57:03.852726", 
        "location": "San Diego, CA", 
        "job_title": "IT Support Specialist"
    }, 
    "70": {
        "job_url": "/company/TENAX-Technologies/jobs/Tier-Tech-Support-aaf2f9c3fa3fc39a?fccid=4c7a977073e77863", 
        "company": "TENAX Technologies", 
        "job_summary": "Experience: 2-5 years IT support\nSecurity Clearance: Secret\nLocation: Aberdeen Proving Ground, MD\nJob Description: This position provides the second level of support to end users by handling service requests that have been escalated by lower tiers. Support will be provided onsite, remotely, over the phone, or via email.\nResponsibilities:\n* Develop solutions for network, desktop, and server problems.\n* Analyze existing systems and make proactive recommendations for improvements.\n* Develop, maintain, and implements all systems, applications and networking configurations.\nQualifications:\n* Microsoft Certification\n* Security+ Certification\n* Secret Clearance\nJob Type: Full-time\nJob Location:\nAberdeen Proving Ground, MD 21005\nRequired experience:\nTechnical Support: 2 years\nRequired licenses or certifications:\nMicrosoft Certification\nSecret Security Clearance\nSecurity+", 
        "job_date": "2017-04-23 13:57:03.686037", 
        "location": "Aberdeen Proving Ground, MD 21005", 
        "job_title": "Tier 2 Tech Support"
    }, 
    "79": {
        "job_url": "/company/Valley-County-Idaho/jobs/IT-Network-Analyst-92b49fd1ca677a26?fccid=646a37fd63c80ffc", 
        "company": "Valley County Idaho", 
        "job_summary": "CLASSIFICATION SUMMARY\nThe Information Technology Network Analyst provides technical support for the County computer network and information technology system, installing hardware and software and maintaining security of County systems. The position is supervised by the Information Technology Director, with latitude for independent judgment and initiative. The principal duties of the position are performed in an office environment.\nESSENTIAL DUTIES AND RESPONSIBILITIES \n(illustrative only and may vary by assignment)\nInstalls and maintains network and computer equipment, including but not limited to, servers, routers, switches, personal and desktop computers, and peripheral equipment;\nMaintains and supports system operations, including anti-virus and security programs;\nInstalls, configures, maintains, troubleshoots, and repairs desktop computers and peripheral equipment;\nInstalls, configures, maintains, troubleshoots, and repairs local area network (LAN), mobile, and wireless systems;\nResponds to requests for assistance from system users;\nWorks with vendors and vendor support to resolve technical issues;\nPlans, designs, and analyzes the data communications systems;\nCreates and maintains documentation of current network configuration to facilitate operations, maintenance, and upgrades;\nEnsures desktop computers across the County system interconnect and operate with diverse systems;\nResearches and provides input to IT Director on system upgrades, improvements, and hardware and software purchases;\nAssists in reviewing specifications and bids for system additions and upgrades;\nOrders computer supplies and equipment;\nProvides training to computer and system users;\nResponds to Commissioners’, elected and appointed officials’, County employees’ and citizens’ questions and comments in a courteous and timely manner;\nPerforms time management and scheduling functions, meets deadlines, and sets project priorities;\nCommunicates and coordinates regularly with appropriate co-workers to maximize the effectiveness and efficiency of interdepartmental operations and activities;\nMaintains strict confidentiality in all cases;\nAssists other department and County employees as needed or requested;\nPerforms all work duties and activities in accordance with County policies, procedures, and safety practices.\nSECONDARY DUTIES AND RESPONSIBILITIES:\nPerforms other duties as assigned.\nCLASSIFICATION REQUIREMENTS:\nThe requirements listed below are representative of the minimum knowledge, skill, and/or ability required for an individual to satisfactorily perform each essential duty satisfactorily and be successful in the position.\nKnowledge of:\nImplementation, operation, maintenance, and upgrades for computer information systems, networks, systems design, hardware, applications, and software to support the operations of the County;\nComputer and network installation, repair, maintenance, and troubleshooting skills;\nCounty computer and network interface and security requirements;\nPrinciples and practices of data and network security management;\nProgramming language and available software packages relevant to County operations;\nCustomer service principles, practices, and objectives;\nCounty policy and procedures for equipment use and operations.\nSkill and Ability to:\nInstall and maintain network and computer equipment;\nMaintain and support system operations, including anti-virus and security programs;\nInstall, configure, maintain, troubleshoot, and repair desktop computers and peripheral equipment, LAN, mobile and wireless systems;\nAnalyze computer systems, identify problems, and develop logical conclusions and effective solutions;\nWork with vendors and vendor support to resolve technical issues;\nCreate and maintain documentation of current network configuration;\nCommunicate and work effectively with users, County administrators, vendors, and consultants;\nMeet project schedules and timelines;\nProvide training to computer and system users;\nSpeak clearly and communicate accurate information to others;\nUse English to communicate effectively with others;\nListen carefully to, understand, and effectively communicate through oral, written, and interpersonal communication channels;\nFollow verbal and written instructions;\nWork independently and exercise initiative, with general guidance and supervision;\nWork as part of a team;\nUse good judgment to make sound and reasonable decisions and problem-solving skills to respond to customer service needs in accordance with laws, ordinances, regulations and established policies.\nMaintain a professional demeanor at all times;\nPerform a wide variety of duties and responsibilities with accuracy and speed under the pressure of time-sensitive deadlines;\nPerform multiple tasks simultaneously, including handling interruptions, and return to and complete tasks in a timely manner;\nDemonstrate integrity and ingenuity in the performance of assigned tasks and solving problems;\nPerform all duties in accordance with County policies and procedures with regard for personal safety and that of other employees and the public;\nMaintain confidentiality.\nACCEPTABLE EXPERIENCE AND TRAINING:\nHigh school diploma or GED;\nCommunity college or technical training in computer science is preferred;\nTwo (2) to three (3) years computer network support experience is preferred;\nAn equivalent combination of education and experience that provides the required skills, knowledge and abilities to successfully perform the essential functions of the position may be considered.\nPHYSICAL DEMANDS & WORK ENVIRONMENT:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this classification. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this classification, the employee is frequently required to stand, walk, sit, stoop, kneel, bend, use hands to keyboard or type, handle materials, or manipulate tools used in performing the essential functions of the classification, and reach with hands and arms. The employee must occasionally lift and/or move up to 25 pounds and, infrequently, up to 50 pounds. Specific vision abilities required by this classification include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus. Sufficient clarity of speech and hearing abilities required by this classification includes those which permit the employee to discern verbal instructions and communicate effectively in person and by telephone. While performing the duties of this classification, the employee works in an office setting where the noise level in the work environment is usually moderate.\nJob Type: Full-time\nSalary: $20.00 /hour", 
        "job_date": "2017-04-18 13:57:25.933894", 
        "location": "Cascade, ID", 
        "job_title": "IT Network Analyst"
    }, 
    "78": {
        "job_url": "/company/Clair-Global/jobs/Computer-Network-Deployment-Specialist-f4aa9af3abe8c724?fccid=6416ff169a5ebaf7", 
        "company": "Clair Global", 
        "job_summary": "Clair Global provides high-quality, industry-leading audio solutions by consistently listening and answering challenges raised by engineering and production professionals. We strive every day at any hour to exceed our clients’ expectations.\nThe Computer/Network Deployment Specialist maintains, updates, repairs and deploys rental IT equipment. The qualified candidate will excel and adapt in a fast-paced, client driven, demanding environment.as well as be available to work overtime on short notice, including weekends.\nREQUIRED software knowledge: Windows 7, Windows 10, OSX.\nPreferred: Pro Tools, Netgear/Cisco switches, Ubiquiti/Cisco/Ruckus Access Points, Clonezilla\nResponsibilities and duties include building computers for various touring applications (e.g. loudspeaker management) and repairing computers and networking equipment damaged on the road.\nJob Type: Full-time\nSalary: $18.00 /hour\nRequired experience:\nComputer Repair: 1 year", 
        "job_date": "2017-04-17 13:57:25.748126", 
        "location": "Lititz, PA", 
        "job_title": "Computer/Network Deployment Specialist"
    }
}